{"title":"Metal-Organic Framework Materials","uid":14884991,"size":26638440,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:011b0d286ad3e5655740e796b4195a4ffd8b6eba&amp;dn=Metal-Organic+Framework+Materials&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1465725652,"description":"Metal-Organic Framework Materials - Leonard R. MacGillivray, Charles M. Lukehart (Wiley, 2014).pdf\r\n\r\nISBN 978-1-119-95289-3\r\n\r\nMetal-Organic Frameworks (MOFs) are crystalline compounds consisting of rigid organic molecules held together and organized by metal ions or clusters. Special interests in these materials arise from the fact that many are highly porous and can be used for storage of small molecules, for example H2 or CO2. Consequently, the materials are ideal candidates for a wide range of applications including gas storage, separation technologies and catalysis. Potential applications include the storage of hydrogen for fuel-cell cars, and the removal and storage of carbon dioxide in sustainable technical processes. MOFs offer the inorganic chemist and materials scientist a wide range of new synthetic possibilities and open the doors to new and exciting basic research.\r\n\r\nMetal-Organic Frameworks Materials provides a solid basis for the understanding of MOFs and insights into new inorganic materials structures and properties. The volume also reflects progress that has been made in recent years, presenting a wide range of new applications including state-of-the art developments in the promising technology for alternative fuels. The comprehensive volume investigates structures, symmetry, supramolecular chemistry, surface engineering, recognition, properties, and reactions","torrent":{"xt":"urn:btih:011b0d286ad3e5655740e796b4195a4ffd8b6eba","amp;dn":"Metal-Organic+Framework+Materials","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"011b0d286ad3e5655740e796b4195a4ffd8b6eba","infoHashBuffer":{"type":"Buffer","data":[1,27,13,40,106,211,229,101,87,64,231,150,180,25,90,79,253,139,110,186]},"announce":[],"urlList":[]}}