{"title":"Principles of Heat Transfer in Porous Media","uid":12010876,"size":13872956,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:016efe2dd38aca4aa02598f9a505dc7e1cf4f24f&amp;dn=Principles+of+Heat+Transfer+in+Porous+Media&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"clouderone","files":1,"time":1434067372,"description":"ISBN 9781468404142\n\nAlthough the empirical treatment of fluid flow and heat transfer in porous media is over a century old, only in the last three decades has the transport in these heterogeneous systems been addressed in detail. So far, single-phase flows in porous media have been treated or at least formulated satisfactorily, while the subject of two-phase flow and the related heat-transfer in porous media is still in its infancy. This book identifies the principles of transport in porous media and compares the avalaible predictions based on theoretical treatments of various transport mechanisms with the existing experimental results. The theoretical treatment is based on the volume-averaging of the momentum and energy equations with the closure conditions necessary for obtaining solutions. While emphasizing a basic understanding of heat transfer in porous media, this book does not ignore the need for predictive tools; whenever a rigorous theoretical treatment of a phenomena is not avaliable, semi-empirical and empirical treatments are given","torrent":{"xt":"urn:btih:016efe2dd38aca4aa02598f9a505dc7e1cf4f24f","amp;dn":"Principles+of+Heat+Transfer+in+Porous+Media","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"016efe2dd38aca4aa02598f9a505dc7e1cf4f24f","infoHashBuffer":{"type":"Buffer","data":[1,110,254,45,211,138,202,74,160,37,152,249,165,5,220,126,28,244,242,79]},"announce":[],"urlList":[]}}