{"title":"Sketch 2.0.3","uid":7484798,"size":5861244,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:021ff91272c1b1ba7fa326c09065d76abafce5ed&amp;dn=Sketch+2.0.3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"openarena","files":-1,"time":1343546993,"description":"Hi Guys,im back (:\n\n\nSketch 2.0.3\n\n\nDescription\n\nSketch is a professional drawing app for designers with a beautiful interface and powerful tools. Making good graphics can be challenging and you need an application specifically designed for this purpose. We set out to build a better app for graphic designers. Not to copy, but rather to improve.\n\n\nSketch has excellent vector tools and the basic shapes are a great starting point for any drawing, whether you want to do web design, icon design or otherwise. Styling your layers is easy in Sketch and we have all the options you might want; multiple fills, gradients, noise, blending blur and more.\nTo top of it off Sketch has the boolean operations for combining multiple shapes into more complex ones - all of this non-destructive.\n\nAll of this power is beautifully contained into Sketch's single-window interface. Everything is there, but only when you need it. A simple interface with seriously powerful tools; everything is possible.\n\nTake a look at the screenshots to see some examples of what you can make with Sketch.\n\n** Note: Special Introductory Price **\n\nFEATURES:\n- Simple but powerful interface, built for OS X\n- Powerful styling; multiple fills, gradients, shadows, blending, blur, noise and more...\n- Flexible boolean operations for combining basic shapes into complex ones\n- Artboards and Slices for exporting multiple images out of a single document\n- Unique Color (with RGB and HSB modes) and Font pickers\n- Beautiful native text rendering and text styles\n- Vector and pixel zoom; zoom in with infinite precision or see individual pixels\n- Multi-stop and radial gradients editing right in the canvas\n- Shared &amp; Linked styles that automatically update each other\n- Powerful but easy to use Vector Tool\n\nAdditionally, if you're looking to do either of the following, Sketch has something for you:\n\nWEB AND UI DESIGN\n- Copy CSS Styles (including gradients)\n- Slices: export area of the canvas as an image\n- 960px (and others) grid\n- Multiple pages support inside a single document\n\nICON DESIGN\n- Artboards; each size its own square\n- Templates\n- Pixel Grid\n- Pixel Effects such as Gaussian and Motion Blur\n\n\nInstallation:\n\nHere's how to register:\n1. Block the app with Little Snitch\n2. Run the app once and then Quit\n3. Run the sketch_keyfilemaker (it will open in Terminal)\n4. Close Terminal\n5. Rename file ~/Library/Application Support/.sketch-countdown to .countdown (you'll have to &quot;show hidden files&quot;)\n6. Delete .countdown from ~Library/Applications Support/sketch\n7. Move (cut and paste) renamed file to ~/Library/Application Support/sketch (note that you can't &quot;Replace&quot; invisible files)","torrent":{"xt":"urn:btih:021ff91272c1b1ba7fa326c09065d76abafce5ed","amp;dn":"Sketch+2.0.3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"021ff91272c1b1ba7fa326c09065d76abafce5ed","infoHashBuffer":{"type":"Buffer","data":[2,31,249,18,114,193,177,186,127,163,38,192,144,101,215,106,186,252,229,237]},"announce":[],"urlList":[]}}