{"title":"Subtitle Finder 1.7","uid":4171896,"size":1727754,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:02989f508c82fe8e226278b69733d35b1429a21b&amp;dn=Subtitle+Finder+1.7&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"captainelliotspencer","files":1,"time":1209918553,"description":"                        SubFind 1.7 \n                     - Subtitle Finder -\n\nSearch subtitles in 8 sites at the same time.\n\nSubFind description:\n\nSubFind was developed in order to search subtitles in multiple web sites at the same time.\nThe aim is to save time for user and enable him to find the wanted subtitle in the \nshortest time. The integrated browser in the program opens all sites and lists the results in its interface. The important point is here to be indicated is the listing is done only from the first of the result pages. Since the program works as a normal browser, it does not occupy the bandwidth of the sites in vain.\n\nIt is impossible to download the listed subtitles by the program.\nHowever when you make a double click on the chosen subtitle on the list the default\nbrowser of the user opens the related download page of the web site of which the subtitle presents, as a new window page.\nDuring the search it is aimed to list the information as much as possible. However the information of some sites may be in different pages.\nIn this kind of conditions when you click on the lines written &quot;Get info&quot; or &quot;Get FPS&quot; it is possible to get information about that subtitle.\n\nPLEASE SEED WHEN YOU FINISH THE DOWNLOAD.\n\nEnjoy!!","torrent":{"xt":"urn:btih:02989f508c82fe8e226278b69733d35b1429a21b","amp;dn":"Subtitle+Finder+1.7","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"02989f508c82fe8e226278b69733d35b1429a21b","infoHashBuffer":{"type":"Buffer","data":[2,152,159,80,140,130,254,142,34,98,120,182,151,51,211,91,20,41,162,27]},"announce":[],"urlList":[]}}