{"title":"Egypt's Christian Rubbish People (2008) [Islam]","uid":10591102,"size":182968320,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:02f1855d6bcbd590e22ad7c8c5a46870df013299&amp;dn=Egypt%27s+Christian+Rubbish+People+%282008%29+%5BIslam%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Kidon01","files":1,"time":1405798361,"description":"UK Channel 4 Unreported World.\n\nChannel 4's acclaimed foreign affairs strand returns with a startling film exposing a dark side to Egypt that the authorities don't want foreigners to see: a secretive society of around 40,000 people literally living in rubbish in a Cairo ghetto overrun by rats and disease. \n\nThis group is unique for another reason. They're part of Muslim Egypt's Christian minority; a community claiming to be besieged by persecution, extremism and a creeping Islamisation in Egypt's security services.\n\n(They are all Christians living in fear of a police state supported by George Bush?s Christian America to the tune of $ 2 billion per year, at least the money that shows on the books.  Egypt makes the specious claim of being a secular state.)\n  \nUnreported World exposes a dark side to Egypt that the authorities don't want foreigners to see: a secretive society of around 40,000 people literally living in rubbish in a Cairo ghetto overrun by rats and disease.\n\nUnreported World exposes a dark side to Egypt that the authorities don't want foreigners to see: a secretive society of around 40,000 people literally living in rubbish in a Cairo ghetto overrun by rats and disease.\n\nReporter Evan Williams and producer James Brabazon are some of the first journalists to film inside the ghetto where tens of thousands live with garbage stacked to the roofs of their multi-storey homes - eking out a living recycling the rubbish by hand. It's a sight rarely seen by outsiders, and almost definitely not by the million British Tourists who visit Egypt every year.\n\nThe Unreported World team highlights one the most sensitive issues faced by some of those in Egypt - their decision to convert to Christianity - a decision that some Muslims believe should be punishable by death under a strict interpretation of sharia religious law.\n\nOne convert, &quot;Christine&quot;, tearfully claims that officers from the government's State Security Intelligence have threatened to torture those trying to convert, rape their daughters in front of them and jail them on false charges of prostitution. \n\nAdditional information: &lt;a href=&quot;\nhttp://www.barenakedislam.com/2014/01/10/shhhh-were-not-supposed-to-talk-about-the-christian-garbage-people-of-egypt/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.barenakedislam.com/2014/01/10/shhhh-were-not-supposed-to-talk-about-the-christian-garbage-people-of-egypt/&lt;/a&gt;","torrent":{"xt":"urn:btih:02f1855d6bcbd590e22ad7c8c5a46870df013299","amp;dn":"Egypt%27s+Christian+Rubbish+People+%282008%29+%5BIslam%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"02f1855d6bcbd590e22ad7c8c5a46870df013299","infoHashBuffer":{"type":"Buffer","data":[2,241,133,93,107,203,213,144,226,42,215,200,197,164,104,112,223,1,50,153]},"announce":[],"urlList":[]}}