{"title":"Classical Music in Jazz style 5CD 320k mp3 (2005) michaelrizzo","uid":6813820,"size":776278882,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:032dc484cb36230587c083639463ef1b4cdd015e&amp;dn=Classical+Music+in+Jazz+style+5CD+320k+mp3+%282005%29+michaelrizzo+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"michaelrizzo","files":-1,"time":1321123923,"description":"Classical musical Classics in Jazz style (2005) 5CD 320k \n(musicfromrizzo) mp3 format files from FLAC originals\n\nI have to say that this CD set could do with a remaster. I compared\nthe joint stereo 5CD mp3 version already being offered around (its\nbloated with several huge png files that are simply images of what each of the\ncd covers themselves look like etc) - and found the sound wasnt good enough\n- so we tried the flac version next - and found that converting these to the\nmp3 versions we have here as as good as it gets - until we have a remastered\nversion that is as there are times when the background seems to need a filtered\nfine-tune and the other mp3 versions we tried didnt succeed in getting that \naccomplished in any event.\n\nI dont know of anyone that thinks theres more than 320k mp3 at 44khz\nfrequency highs (into the harmonics at that rate certainly) can be had\nfrom a CD even if you make it a flac fle first - however feel free to\ncomment if you dont think so - its a free world anyhows - thats how we \nall learn and improve for the benefit of the community wich we serve.\n\nMichael Rizzo \n\n\nNice and even great at times backrgound music anyhows:\n\n\nEugen Cicero - Albinoni - Adagio \nEugen Cicero - C.P.E.Bach - Phillip's Swinging Fantasia from Fantasia D-minor \nEugen Cicero - D.Scarlatti - Sonata in E major \nEugen Cicero - F.Chopin - Prelude in C minor \nEugen Cicero - F.Chopin - Prelude in E minor \nEugen Cicero - F.Chopin - Valse Ã‚Â¹7 in C# minor \nEugen Cicero - F.Liszt - Hungarian Rhapsody Ã‚Â¹2 \nEugen Cicero - Gershwin - Rhapsody in Blue \nEugen Cicero - Handel - Sarabande for Angelique from Suite Ã‚Â¹4 D-minor \nEugen Cicero - J.S.Bach - Badinerie \nEugen Cicero - J.S.Bach - Erbame Dich, Mein Got \nEugen Cicero - J.S.Bach - Riverside in Rondo \nEugen Cicero - J.S.Bach - Toccata et Fuga D-minor \nEugen Cicero - Mozart - Ah! Vous dirais-je, Maman \nEugen Cicero - Mozart - Fantasia \nEugen Cicero - Mozart - Sehnsucht Nach Dem Fruhling \nEugen Cicero - Mozart-Liszt-Beethoven-Tchaikovsky - Sunny Medley \nEugen Cicero - P.I.Tchaikovsky - Neapolitan Dance \nEugen Cicero - P.I.Tchaikovsky - Old French Song \nEugen Cicero - P.I.Tchaikovsky - Theme (Tempo di Valse) from 'Swanlake' \nEugen Cicero - Tchaikovsky - Nutcracker \nEugen Cicero - W.A.Mozart - Fantasia in D minor \nFrom Classical into Jazz 5CD (musicfromrizzo).jpg\nHregor Huebner, Richie Beirach, George Mraz - Bartok - Bagatelle No.4 \nHregor Huebner, Richie Beirach, George Mraz - J.S. Bach - Siciliana \nHregor Huebner, Richie Beirach, George Mraz - Pergolesi - Eja mater fons amoris \nHregor Huebner, Richie Beirach, George Mraz - Pergolesi - Sancta mater, istrud agas \nHregor Huebner, Richie Beirach, George Mraz - Porumbescu - Balada \nHregor Huebner, Richie Beirach, George Mraz - Scrjabin - Prelude op.16 \nHregor Huebner, Richie Beirach, George Mraz - Traditional - Cossack's Song \nHregor Huebner, Richie Beirach, George Mraz - Traditional - Dubrawuschka \nSir Roland Hanna - Georga Mraz - Chant sans Paroles. Op.2 N3 - P. Tschaikovsky \nSir Roland Hanna - Georga Mraz - Clair de Lune - C. Debussy \nSir Roland Hanna - Georga Mraz - Humoresque - F. Dvorjak \nSir Roland Hanna - Georga Mraz - Prelude 18 in D flat major \nSir Roland Hanna - Georga Mraz - Prelude 19 in A minor \nSir Roland Hanna - Georga Mraz - Prelude 2 in G major \nSir Roland Hanna - Georga Mraz - Prelude 21 in E flat major \nSir Roland Hanna - Georga Mraz - Prelude 4 in C minor \nSir Roland Hanna - Georga Mraz - Prelude 7 in A minor \nSir Roland Hanna - Georga Mraz - Prelude 9 in F sharp minor \nSir Roland Hanna - Georga Mraz - Reverie 0 C. Debussy \nSir Roland Hanna - Georga Mraz - Serenade - F. Schubert \nSir Roland Hanna - Georga Mraz - Swan Lake -  P. Tschaikovsky \nSir Roland Hanna - Georga Mraz - Yours in my Heart Alone - F. Lehar \nSteve Kuhn, David Finck, Billy Drummond - C.Debussy - Reverie \nSteve Kuhn, David Finck, Billy Drummond - E.Grieg - Ich liebe dich \nSteve Kuhn, David Finck, Billy Drummond - F.Chopin - Fantasy impromptu \nSteve Kuhn, David Finck, Billy Drummond - F.Chopin - Nocturne in Eb major op.9 #2 \nSteve Kuhn, David Finck, Billy Drummond - F.Chopin - Prelude in E minor op.28, #4 \nSteve Kuhn, David Finck, Billy Drummond - G.Faure - Pavane \nSteve Kuhn, David Finck, Billy Drummond - J.Brahms - Lullaby \nSteve Kuhn, David Finck, Billy Drummond - M.Ravel - Pavane \nSteve Kuhn, David Finck, Billy Drummond - P.Tchaikovsky - Swan lake \nSteve Kuhn, David Finck, Billy Drummond - P.Tchaikovsky - Symphony #5 2nd movement ","torrent":{"xt":"urn:btih:032dc484cb36230587c083639463ef1b4cdd015e","amp;dn":"Classical+Music+in+Jazz+style+5CD+320k+mp3+%282005%29+michaelrizzo+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"032dc484cb36230587c083639463ef1b4cdd015e","infoHashBuffer":{"type":"Buffer","data":[3,45,196,132,203,54,35,5,135,192,131,99,148,99,239,27,76,221,1,94]},"announce":[],"urlList":[]}}