{"title":"Danny Cannon's Judge Dredd by TM2YC (FanEdit) - 1080p","uid":11744385,"size":5149301203,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:034ef081448f05958d5a2d16956a89fc71f47c43&amp;dn=Danny+Cannon%27s+Judge+Dredd+by+TM2YC+%28FanEdit%29+-+1080p&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"semontrax","files":6,"time":1425931997,"description":" ALL INFORMATION AND CONTENT ACQUIRED FROM: http://www.fanedit.org/ifdb/component/content/article/79-fanedit-listings/fanfix/923-danny-cannon-s-judge-dredd\n\n- ALL CREDIT TO TM2YC &amp; FANEDIT.ORG FOR MAKING THIS GREAT CONTENT AVAILABLE\n\n\n\nDanny Cannon's Judge Dredd\n\n\nTrailer, DC's original poster, artwork, cutlist and featurette included.\n\n\nBrief Synopsis:\n\nThis edit attempts to take 1995's 'Judge Dredd' closer to what might have been if Director Danny Cannon had been given total creative freedom. Without the interference from his producers and his mega-star Slyvester Stallone, could we have got a real Dredd movie that reflected the tone of the source material? Could it have been more like 2012's awesome 'Dredd'? Let's find out!\n\n\nIntention:\n\nMy intention was:\n\n1. To cut Stallone's performance as Dredd in a way that brings him inline with the Dredd from the comics. Almost every shot showing any emotion beyond anger is gone, his silly catchphrase is gone and of course his romance with Hershey is entirely removed.\n\n2. To cut Rob Schneider's character down a minimum since he essentially destroys any tention that the film is building. He constantly makes light of what are supposed to be life-threatening situations, he is generally loud and annoying, he pulls stupid faces and waves his arms around... in short, he is the Jar-Jar Binks of this movie.\n\n3. To restore Manic Street Preachers' 'Judge Yr'self' to it's proper place as the finale music for the film.\n\n4. To generally make the tone more serious while still keeping the action fun.\n\nAdditional Notes:\n\nMy intention was never to remove every frame of Rob Schneider at the expense of continuity. He now serves a purpose and that is to be an irritant for Dredd. If he speaks Dredd shoots him an angry look, this helps make Dredd's character more aggressive. He also ultimately proves useful in the end.\n\n\n\nOther Sources:\n\nJudge Dredd Blu-Ray\nJudge Dredd CD Soundtrack\nManic Street Preachers - Lipstick Traces CD Compilation\nColin MacNeil comic artwork circa the early 90s\nSpecial Thanks:\nThanks to all those on the DCJD thread who gave their feedback and previewed clips and workprints.\n\n\nScreenshots:\n &lt;a href=&quot;\nhttp://i.imgur.com/UYB30Xk.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i.imgur.com/UYB30Xk.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://i.imgur.com/AlOJgQv.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i.imgur.com/AlOJgQv.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://i.imgur.com/gjpNQQD.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i.imgur.com/gjpNQQD.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://i.imgur.com/LLTexcF.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i.imgur.com/LLTexcF.jpg&lt;/a&gt;\n\n\n\nCuts &amp; Additions:\n\n\n- Slightly de-saturated, darkened and increased the contrast of the image throughout. The look is now more gritty and sombre while the Judge's costumes look less like blue-spandex\n- Removed almost every shot of Stallone's face that showed internal conflict, sadness, happiness or any emotion other than barely suppressed anger\n- Removed Hershey/love subplot, they're like Cop partners... that's it (NO KISS!)\n- Removed as much Rob Schneider as I believe is possible without causing continuity/narrative problems. However, I have retained many instances when he says something annoying and then Dredd gets angry with him (Dredd getting angry is good for the movie!)\n- Removed all footage of Rob Schneider making light of the supposedly dangerous situations he is in. Including being shot, burned alive, murdered, eaten by cannibals and worst of all, joking around while he's critically inured from a gunshot wound to the stomach. Schneider's antics destroy the tension in all those moments.\n- Stallone's heavily repeated &quot;I knew you'd do/say that&quot; catchphrase removed (He now says those words once only)\n\n\n130 major changes in total","torrent":{"xt":"urn:btih:034ef081448f05958d5a2d16956a89fc71f47c43","amp;dn":"Danny+Cannon%27s+Judge+Dredd+by+TM2YC+%28FanEdit%29+-+1080p","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"034ef081448f05958d5a2d16956a89fc71f47c43","infoHashBuffer":{"type":"Buffer","data":[3,78,240,129,68,143,5,149,141,90,45,22,149,106,137,252,113,244,124,67]},"announce":[],"urlList":[]}}