{"title":"3D fileSpace v. 1.1.1 [K]racked","uid":6923904,"size":721462,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:045145bdc6ed4799ac9737f627af5bcdeabd093c&amp;dn=3D+fileSpace+v.+1.1.1+%5BK%5Dracked&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"polisdavid","files":-1,"time":1325374004,"description":"Note: This one is a weird app - download it and see if you like it - otherwise, just download for the fun of looking at what developers are doing out there!\n\nOfficial Web Site: &lt;a href=&quot; http://marcmoini.com/f3_en.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://marcmoini.com/f3_en.html&lt;/a&gt;\n\n3D fileSpace brings you the new possibilities and larger spaces of tomorrow's 3D displays, on your Mac today:\n\n* Instead of having to navigate through folders, rise above them and\n  directly see the icons you are looking for!\n\n* Keep on hand the contents of all the Finder folders you often go to, all\n  at once, in multiple 3D panes in a single window.\n\n* Get point-and-click access to each of hundreds of items, drag and drop\n  and perform Finder-like tasks, all in one place.\n\nBecause 3D views show depth and distance as in the real 3D world, the same visual and spatial skills you use to get around town, and to know where things are in the home, now also make it easier to get to your files and applications in the computer.\n\nEasy visual access to your files and applications\n\n* Rise above the labyrinth of folders and see all the icons in the whole\n  landscape at once\n\n* Just click to open files and applications, no need to remember names or\n  navigate file lists\n\n* No need to remember the exact location of each item, &quot;it's around that\n  group in the back&quot; or &quot;near that one there&quot; is enough\n\n* Rearrange files and folders in the landscape as you wish, which at the\n  same time makes them more memorable\n\n* Compose multiple Finder folders into a single window, to have fewer\n  &quot;places&quot; to keep track of\n\nUnlimited desktop space\n\n* Let your desktop extend into the distance instead of being limited by the\n  edges of the screen\n\n* Add new items easily, the desktop just grows to accommodate them\n\n* Existing items stay where they are, new items create their own space in\n  front\n\n* No more clutter; no more having to make room for new items; no more\n  having to decide what to throw out\n\n* As older items recede in the back you can always go back to them, or\n  bring them to the front again\n\n* Clear your desktop by putting desktop items in a drawer, they'll stay\n  close at hand without taking over the whole screen\n\n* Keep a miniature view of your desktop items in a corner of the screen,\n  if you prefer to always see them\n\nFast file/folder browser\n\n* See the contents of dozens of folders and their sub-folders at a glance,\n  without having to visit each sub-folder\n\n* Enlarge any item by simply pointing at it\n\n* Get full-size Quick Look previews without having to click or press\n  keys\n\n* Zoom, pan and tilt with simple gestures\n\n* Expand folders into platforms with one click\n\n* Stacked platforms keep the big picture in view so you can always see\n  where you are\n\n* Drop any Finder folder on 3D fileSpace's icon in the Dock to view that folder as a 3D landscape\n\nUse drawers for instant access\n\n* Drawers stand by along the edge of the screen, out of the way\n\n* Use a drawer as a convenient visual launcher for all those applications\n  that don't fit in the dock\n\n* Change any window into a drawer\n\n* Open a drawer at any time with just a flick of the finger or mouse\n\nArrange and customize landscapes\n\n* Drag items and folders to create groups and other visually meaningful\n  arrangements\n\n* Make key icons larger so they stand out from afar; shrink icons that you\n  don't need to see but don't want to remove\n\n* Resize folders to have them show more or less of their contents\n\n* Make 3D views small and use them as status panels, or make them\n  extra large to immerse yourself in the landscape\n\nPerform file management tasks directly in the 3D view\n\n* Drag and drop items to/from the Finder and other applications\n\n* Copy, move, rename, delete items and folders as with the Finder\n\n* Multi-pane windows make copying, moving or rearranging items faster\n  and easier\n\nSystem Requirements: Intel Mac, OS X.6.6 or later\n\n--- PLEASE SEED ---","torrent":{"xt":"urn:btih:045145bdc6ed4799ac9737f627af5bcdeabd093c","amp;dn":"3D+fileSpace+v.+1.1.1+%5BK%5Dracked","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"045145bdc6ed4799ac9737f627af5bcdeabd093c","infoHashBuffer":{"type":"Buffer","data":[4,81,69,189,198,237,71,153,172,151,55,246,39,175,91,205,234,189,9,60]},"announce":[],"urlList":[]}}