{"title":"American Pie 1-7 (1999-2009) DVDRip Xvid DutchReleaseTeam [Komed","uid":6071161,"size":5401527657,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:053c009d57b7f0381b33d23bb7265f1326005390&amp;dn=American+Pie+1-7+%281999-2009%29+DVDRip+Xvid+DutchReleaseTeam+%5BKomed&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Koedje","files":11,"time":1293623275,"description":"American Pie 1-7 Hardcoded subtitles:\n\n\n\n\nDeel 1:\n\n\nVerenigde Staten\nKomedie\n95 minuten\n\ngeregisseerd door Paul Weitz en Chris Weitz\nmet Jason Biggs, Alyson Hannigan en Shannon Elizabeth\n\nVier vrienden besluiten na een feestje een pact te sluiten: ze zullen er alle vier alles aan doen om nog voor ze gaan studeren hun maagdelijkheid te verliezen. Het eindbal is natuurlijk de laatste kans voor de jongens. Terwijl het feest steeds dichterbij komt doen de jongens er alles aan om te scoren.\n\n\n\n\n\n\n\n\nDeel 2:\n\n\n\nVerenigde Staten\nKomedie\n100 minuten\n\ngeregisseerd door James B. Rogers\nmet Jason Biggs, Shannon Elizabeth en Alyson Hannigan\n\nDe jongens uit deel ÃƒÂ©ÃƒÂ©n hebben inmiddels een jaar studie achter de rug, en komen elkaar weer tegen. Nadia komt Jim opzoeken, maar hij is bang dat hij seksueel gezien nog steeds niet helemaal klaar is voor haar. Hij besluit Michelle weer op te zoeken, in de hoop zo nog het ÃƒÂ©ÃƒÂ©n en ander te leren.\n\n\n\n\n\n\n\n\nDeel 3:\n\n\n\nVerenigde Staten\nKomedie\n96 minuten\n\ngeregisseerd door Jesse Dylan\nmet Jason Biggs, Alyson Hannigan en Seann William Scott\n\nIn dit derde deel uit de American Pie-reeks vraagt Jim Michelle ten huwelijk. De families van beiden komen samen voor de aanstaande bruiloft. Terwijl Jim er alles aan doet om een goede indruk te maken op de ouders van Michelle, doen Finch en Stifler hun best om indruk te maken op haar jongere zus.\n\n\n\n\n\n\n\n\nDeel 4:\n\n\n\n\nVerenigde Staten\nKomedie\n87 minuten\n\ngeregisseerd door Steve Rash\nmet Arielle Kebbel, Tad Hilgenbrinck en Eugene Levy\n\nMatt Stifler, het jonge broertje van Steve, wordt na de zoveelste grap op zijn school door de directeur gedwongen om naar Band Camp te gaan. Matt besluit vervolgens om verborgen camera's mee te nemen naar het kamp, zodat hij opnames kan maken van dronken Band Camp meiden, die de wildste dingen doen. Dit gaat echter niet helemaal zoals gepland ...\n\n\n\n\n\n\n\n\nDeel 5:\n\n\n\nVerenigde Staten\nKomedie\n98 minuten\n\ngeregisseerd door Joe Nussbaum\nmet Candace Kroslak, Steve Talley en John White\n\nWanneer Erik Stifler beseft dat hij het enige lid van de Stifler-familie is dat als maagd van de middelbare school zou kunnen afkomen, wordt het tijd om zijn afkomst eer aan te doen. Na goedbedoeld advies van Jims vader acht Erik de tijd rijp om zijn geluk te beproeven tijdens de beruchte jaarlijkse Naked Mile-race, die door zijn toegewijde vrienden en een paar ongeremde studentes wordt aangegrepen om er een megaspannend weekend van te maken.\n\n\n\n\n\n\n\n\nDeel 6:\n\n\n\nVerenigde Staten\nKomedie\n89 minuten\n\ngeregisseerd door Andrew Waller\nmet Eugene Levy, Steve Talley en John White\n\nErik, Ryan, en Cooze gaan naar een college en komen terecht bij de Beta House studentenclub, waar de legendarische Dwight Stifler de scepter zwaait. Probleem is dat een andere studentenclub dreigt om de uitspattingen van de Betas aan banden te leggen. Daar laten de Betas het niet bij zitten, ze gaan vechten voor het recht om te feesten!\n\n\n\n\n\n\n\n\nDeel 7:\n\n\n\nVerenigde Staten\nKomedie\n94 minuten\n\ngeregisseerd door John Putch\nmet Bug Hall, Kevin M. Horton en Brandon Hardesty\n\nTien jaar na de avonturen in American Pie, ontdekt een stel nieuwe leerlingen van East Great Falls High hun 'Bijbel', verborgen in de bibliotheek. Het probleem is echter dat het boek beschadigd is door ÃƒÂ©ÃƒÂ©n van die leerlingen. Ze nemen contact op met Noah Levenstein (Eugene Levy), die samen met de jongens probeert om de verhalen in de Bijbel weer terug te krijgen.\n\n\n\n\n\nMeer zien? Kijk dan op - http://hetmultimediacafe.nl/index.php\n\nDutchReleaseteam = Hardcoded Dutch Subs","torrent":{"xt":"urn:btih:053c009d57b7f0381b33d23bb7265f1326005390","amp;dn":"American+Pie+1-7+%281999-2009%29+DVDRip+Xvid+DutchReleaseTeam+%5BKomed","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"053c009d57b7f0381b33d23bb7265f1326005390","infoHashBuffer":{"type":"Buffer","data":[5,60,0,157,87,183,240,56,27,51,210,59,183,38,95,19,38,0,83,144]},"announce":[],"urlList":[]}}