{"title":"Chashme-Baddoor-blu-ray-x264-720P-dts-[DDR]","uid":8652664,"size":3476858327,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:064c7814280f6ec226befe5b22bb2d744b1873ae&amp;dn=Chashme-Baddoor-blu-ray-x264-720P-dts-%5BDDR%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":16,"time":1373146164,"description":"VIDEO~~~\nLENGTH - 02:04:20\nFRAME WIDTH - 1280\nFRAME HEIGHT - 720\nDATA RATE - 3551kbps\nTOTAL BITRATE 3679kbps\nFRAME RATE - 29 frames/second\n\nAUDIO~~\nBIT RATE - 127kbps\nCHANNELS - 2(STEREO)\nAUDIO SAMPLE RATE - 48kHz\n\nFILES~~\n3.19GB SIZE\nFILE TYPE MP4\n\n\n\n\n\nABOUT THE FILM------\nSeema (Taapsee Pannu) is a young aged girl, who lives in Mumbai with her father (Anupam Kher). He being an active military officer, wants Seema to marry a similar man. He had arranged Seema's marriage to such people 5 times in a row, with Seema evading all five arrangements. Her father had now arranged her marriage for the sixth time, which Seema evades again, and escapes to Goa, to live with her uncle, her father's younger brother. Siddharth Kashyap (Ali Zafar), Jai (Siddharth) and Omi (Divyendu Sharma) are three friends who live in a rented apartment. Miss Josephine (Lilette Dubey) is their landlady. All the three are frequent visitors to a cafe, owned by Joseph Furtado (Rishi Kapoor). The three owe huge amounts of money to Joseph and Josephine. One day, Omi spots Seema taking a walk with her dog Aryabhatt. Attracted to her, he calls his friend Jai. Both of them try to impress her. One after the other, they break into Seema's house. Omi tries to impress Seema with his poetry. Meanwhile, Seema mistakes him for a dog trainer and takes him straight into her bedroom. Omi assumes Seema is interested him and starts browsing her bedroom while Seema prepares her dog. Unable to handle the dog, Omi runs back home, where he tells everyone a completely different story. Omi tells his friends that they had sex and were deeply in love. Jealous, Jai tries his luck. Jai breaks in, telling them he was a reputed film-maker. Upon realization, Seema calls her aunt, and makes her beat up Jai until he finally makes his run. Back home, Jai tells a similar story. Jai tells the other two that they two were deeply in love and were now dating. Siddharth, meanwhile, isn't interested in Seema.\nHowever, one day, Siddharth (Sid) accidentally bumps into Seema, unaware of the fact that she is the girl Jai and Omi failed to impress. Both of them have a chat over lunch. Seema is impressed with Sid and asks him out on a date. Both of them get along very well and date frequently, until one day, Jai and Omi spot them. Both of them, jealous of the fact that they are now dating, tell Sid that she isn't a good girl and ask him to break up with her. Seema, on the other hand is shocked about the fact that they are both Sid's friends. Sid pretends to beat up both his friends to impress Seema, which later turns out to be Omi and Jai's imagination. Albeit the fight, They continue to try and split Sid and Seema. One day, Josephine gets caught in heavy rain. Joseph too was present at the scene and helps out Josephine. Both of them were amused at the similarities between them. They both fall in love, but hesitate to start dating. Jai and Omi try to make advantage of the situation. They assume that Joseph would stop asking them to pay the cafe bills and Josephine would let them stay at her apartment for free, if they helped unite them. In their many attempts, the somehow unite Joseph and Josephine. Despite that, they still don't forgive the three. So Jai and Omi start lying about each of the two to the other. They get the money they wanted. However, Joseph and Josephine do not break up as the soon realize that all the secrets told to them were lies.\nSoon after that, Sid and Seema break up, following successful attempts by Jai and Omi. However, Sid is deeply hurt and gets drunk. One day, he attempts suicide. Realizing that they have made a really bad mistake, Jai and Omi try several times to unite Sid and Seema again. But they fail. One day finally, they go to Seema's house and meet her aunt. She comes up with a rather filmy solution and suggests Jai and Omi to cosplay kidnappers and supposedly kidnap Seema. Then, the aunt goes to Sid and asks him to rescue Seema from the kidnappers. Finally, Sid and Seema start dating again. Seema's uncle, who had always been trying to marry Seema to a civilian, rather than a military officer, suggests Seema to marry Sid. At the same time, Seema's father turns up trying to take Seema back home. In order to solve the problem, Sid unites the brothers by telling them, that every military officer was once a civilian. Impressed, they both let Sid and Seema marry.","torrent":{"xt":"urn:btih:064c7814280f6ec226befe5b22bb2d744b1873ae","amp;dn":"Chashme-Baddoor-blu-ray-x264-720P-dts-%5BDDR%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"064c7814280f6ec226befe5b22bb2d744b1873ae","infoHashBuffer":{"type":"Buffer","data":[6,76,120,20,40,15,110,194,38,190,254,91,34,187,45,116,75,24,115,174]},"announce":[],"urlList":[]}}