{"title":"The Anthony Cumia Show 2015-02-17 MP4 MP3 combo","uid":11709560,"size":329951915,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:07b13a5e516ad5e6123a2276d677048eedc8835b&amp;dn=The+Anthony+Cumia+Show+2015-02-17+MP4+MP3+combo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"mothergoose58","files":2,"time":1424272287,"description":"*** CAUTION: 100% UNCENSORED CONTENT!!! ***\n\n-NOT FOR VIEWING BY CHILDREN OR THE FAINT OF HEART-\n\nFresh off his &quot;separation&quot; from SiriusXM, Anthony Cumia, formerly of The Opie and Anthony Show launches his live, uncensored HD video webcast at AnthonyCumia.com Monday-Thursday 4pm-6pm EST. Current events, politics, news and anything can and will be discussed with celebrity guests and comedians stopping by as well. This show is not for those who are inclined to be &quot;politically correct&quot; and will contain boundary-pushing language and topics. Proceed with caution...\n\nGuest(s): Tom McCaffrey\n\nEpisode 111: Ant jumps right into H1Z1 and how it went down last night for him, the Twitter feedback he got for commenting on Cindy Crawford's untouched photo, he breaks down TBS digitally &quot;speeding up&quot; Seinfeld reruns, and reads an article about Joe Biden getting creepy once again. Anthony plays part of Larry King's appearance on Opie and Jimmy's show today, we get the latest (and quite possibly the last) on Joe DeRosa, and since a holiday cock-blocked the mail yesterday, we go through it today. Comedian Tom McCaffrey joins TACS to talk about his documentary &quot;Adventures in Comedy&quot;, having others edit your work, growing up in New York, old movies set in New York, and he tells us how he got into the biz and performed at the Oscars. Tom talks about his early days of stand-up, the guys wax about success versus selling out, how easily &quot;celebrities&quot; can be replaced, the travel that comes along with stand-up, and comedy groupies (or lack thereof). They then channel some Dr. Phil shit by discussing attempting to be yourself in a relationship, meeting &quot;the dad&quot; long-term relationships, intimacy issues, cheating, Ant revisits his Jill Nicolini story for Tom, they get into dating hot chicks, jealousy, meaningless arguments, bad break-ups, and then wrap up talking about old sitcoms that tried to include &quot;a message&quot;.\n\nIncludes an MP4 video file and an MP3 audio file; download both or only what you need and please seed!\n\n\n\nNew ups at: http://thepiratebay.se/user/mothergoose58/\n\nSubscribe at AnthonyCumia.com!!!","torrent":{"xt":"urn:btih:07b13a5e516ad5e6123a2276d677048eedc8835b","amp;dn":"The+Anthony+Cumia+Show+2015-02-17+MP4+MP3+combo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"07b13a5e516ad5e6123a2276d677048eedc8835b","infoHashBuffer":{"type":"Buffer","data":[7,177,58,94,81,106,213,230,18,58,34,118,214,119,4,142,237,200,131,91]},"announce":[],"urlList":[]}}