{"title":"PC Ã‚Â» SPLIT SECOND Full Game directplay by globe@","uid":5575553,"size":3066126129,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:093fe483c079d4ec9625978da127477ef14a0284&amp;dn=PC+%C3%82%C2%BB+SPLIT+SECOND+Full+Game+directplay+by+globe%40&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":"globeplus","files":-1,"time":1274375258,"description":"* Hello PC great games fans ...\n\n\n* Enjoy all the car competition in this new car racing game ...\n\n\n* The freeware FREEARC is needed to extract the arc file .\n\n\n* File info : total complete game , just work in some videos and the tutorial videos 100% originals \n\n\n* Gameplay : \n\n* In Split Second: Velocity, players take part in a fictional reality TV program where participants race for money and glory. Throughout a race, players can build up their &quot;powerplay&quot; meter by performing stunts such as jumps and precision driving such as passing very close to objects and drifting. As the player builds up their meter, special events can be triggered which create obstacles for other players, create shortcuts or alter the race course entirely. These triggers are also activated by the player's AI opponents.\n\n \nTarget-rendered screenshot showing cars driving past an exploding airport.Such events include explosions, airplane crashes and building collapses. The severity of the events available to trigger varies depending on how full the player's meter is. The first level of events are available when one of the three bars on the HUD are full and the most extreme can only be triggered once all three are full. Event locations, and the vehicles they will affect, are highlighted with blue icons for the level one powerplays, and red icons for level two, and the player must time the action accurately in order to hinder his or her competitors as much as possible. One section of the powerplay meter resets once a level one event is triggered, so the player must also strategize to choose whether to activate the less destructive first-level events as soon as they are available, or save their powerplay points for longer and build them up further in order to use the top-tier actions. There are also certain powerplays that reset for the next lap, such as bombs dropped from helicopters, small environmental changes and secret shortcuts, but there will also be powerplays that will never reset, until the race is finished, restarted or quit. Black Rock Studios also wanted to make the HUD as simple as possible by taking away all unnecessary elements such as the speedometer and the track map (rendered useless due to the dynamic nature of the track) leaving only the lap count, position that the player is in, and the powerplay meter, all positioned behind the car itself, so as to leave more room to display visuals.\n\nUsing the reality TV show premise, the game is broken up into 72 events across 12 episodes, with different modes available. One such mode, &quot;Nemesis&quot;, has the player racing along a given track, while contending with a time limit and a series of trucks rolling colored barrels out of the back to stop the player reaching the finish in time. Blue barrels takes away seconds and red barrels result in instant death, followed by a respawn. Overtaking a truck will add extra seconds to the timer. When the timer runs out, the game goes into a sudden death phase where the next fatal impact will end the race. Another mode, &quot;Survival&quot;, sees the player dodge incoming missile fire from a helicopter. The power-play gauge acts as a way to steer the missiles back at the helicopter, ultimately destroying it.\n\nThe game also has a multiplayer mode, with both 8-player online and 2-player split-screen offline available.\n\n\n\nMinimum System Requirements:\n============================\n\nOperating System: Microsoft Windows 7 / Vista SP2 / XP SP3 \nProcessor: 3.0 GHz Intel Pentium D processor (Windows 7 / Vista) / 2.6 GHz Intel Pentium D processor (Windows XP) or 2.0 GHz AMD Athlon 64 X2 or equivalent processor \nMemory: 2.5 GB RAM (Windows 7 / Vista) / 2.0 GB RAM (Windows XP) \nHard Drive: 6.5 GB uncompressed hard drive space \nVideo Card (graphics): 256 MB DirectX 9.0c-compatible, 3D video card supporting Shaders 3.0 (NVIDIA GeForce 7600 or better, ATI Radeon X1600 or better) -- NOTE: Onboard (built-in) integrated chipsets are not supported \nSound Card: 16-bit DirectX 9.0c-compatible sound card\n\n\n\n\n\n\n\n\n                                ***** enjoy ... ***** \n\n","torrent":{"xt":"urn:btih:093fe483c079d4ec9625978da127477ef14a0284","amp;dn":"PC+%C3%82%C2%BB+SPLIT+SECOND+Full+Game+directplay+by+globe%40","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"093fe483c079d4ec9625978da127477ef14a0284","infoHashBuffer":{"type":"Buffer","data":[9,63,228,131,192,121,212,236,150,37,151,141,161,39,71,126,241,74,2,132]},"announce":[],"urlList":[]}}