{"title":"World's Deadliest Animals-4 Episodes_NGC_PDTV_XviD~Ekolb","uid":4810111,"size":1465804460,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:09af6c83158cbd766cfb436f3cde81b61cc14b2a&amp;dn=World%5C%27s+Deadliest+Animals-4+Episodes_NGC_PDTV_XviD%7EEkolb&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Ekolb","files":6,"time":1238347938,"description":"World's Deadliest Animals\nThe world is home to an array of creatures that have evolved to survive harsh environments and brutal competition. Find out which species are among the deadliest twelve animals in: Costa Rica, the Amazon, Asia and the Asia Pacific.\n\n- Asia - Land Of Extremes\n- Costa Rica\n- Amazon\n- Asia Pacific\n\nAsia - Land Of Extremes\nAsia is the largest most populated continent on earth. Life here is harsh. To survive, the animals here have evolved into the toughest of the tough.\n\nCosta Rica\nFrom Southwestern USA's parched deserts to Costa Rica's lush forests, explore some of the planet's most diverse ecosystems.\n\nAmazon\nThe steamy jungles of the Amazon region reverberate with the sound of screeches, growls and grunts. These are the noises of creatures hidden in the trees vying with one another for survival. From the snapping jaws of the Caiman to the bloody kiss of the Vampire Bat to the razor sharp teeth of the Piranha, count down the twelve most deadly animals in the world's largest rainforest. \n\nAsia Pacific\nSpanning two vast oceans and covering a region seven times larger than Europe, the Asia-Pacific contains unique ecosystems that boast more lethal creatures on land and undersea than anywhere else on Earth. From South-East Asia through Indonesia and down to Australia, jungles and farmland and volcanic mountains dot the tropical waters. Amongst these, there are twelve animals with the brains, bodies and temperaments that set them apart in a class of their own. From the Spitting Cobra to the Komodo Dragon and the Moray Eel to the Sumatran Tiger, meet Asia Pacific's deadliest animals.\n\nEnjoy!\nEkolb","torrent":{"xt":"urn:btih:09af6c83158cbd766cfb436f3cde81b61cc14b2a","amp;dn":"World%5C%27s+Deadliest+Animals-4+Episodes_NGC_PDTV_XviD%7EEkolb","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"09af6c83158cbd766cfb436f3cde81b61cc14b2a","infoHashBuffer":{"type":"Buffer","data":[9,175,108,131,21,140,189,118,108,251,67,111,60,222,129,182,28,193,75,42]},"announce":[],"urlList":[]}}