{"title":"The Message (1977) The Story Of Islam","uid":11769983,"size":735138816,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:09c2e67c09f458b09deb6ef318c1bbef4a35cca9&amp;dn=The+Message+%281977%29+The+Story+Of+Islam+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SamirDZ","files":1,"time":1427031587,"description":"This must-see epic depicts the birth of Islam. In the 7th century Mohammed is visited by Angel Gabriel who urges him to lead the people of Mecca and worship God. But they're exiled in Medina before returning to Mecca to take up arms against their oppressors and liberate their city in the name of God.\n\nHandsomely-mounted historical epic concerns the birth of the Islamic faith and the story of the prophet Mohammed -- who, in accordance with the tenants of Islam, is never to be depicted (as this is against certain Islamic schools of thought). In Mecca in the 7th century, Mohammed is visited by a vision of the Angel Gabriel, who urges him to lead the people of Mecca to cast aside the 300 idols of Kaaba and instead worship the one true God, speaking out against the corrupt political and military leaders who rule Mecca. With the help of his uncle, a brave warrior named Hamza (Anthony Quinn), Mohammed and his followers return to Mecca to liberate the city in the name of God. The Message (originally screened in the U.S. as Mohammed, Messenger of God) proved to be highly controversial during its production and initial release. Unfounded rumors had it that Mohammed would not only be depicted in the film, but that he was to be played by Charlton Heston or Peter O'Toole. This resulted in protests by some Muslim, until director Moustapha Akkad hired a staff of respected Islamic clerics as technical advisors. The Message was shot in two versions, one in English and one in Arabic (entitled Al-Ris-Alah), with different actors taking over some of the roles due to language requirements.\n\nBrowse my other torrents :)\n\nPlease seed after you finish, and share with others anywhere not just through the net only (flash disks, burn to disks, send via emails...etc) to friends, colleagues, relatives, neighbors....\nI hope that you will benefit from the books and stuff, and like the movie :)\nSHARING IS CARING :p \n.......................\nBrowse my other torrents :)  &lt;a href=&quot;\nhttp://thepiratebay.se/user/SamirDZ/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/SamirDZ/&lt;/a&gt;\n\nPlease seed after you finish, and share with others anywhere not just through the net only (flash disks, burn to disks, send via emails...etc) to friends, colleagues, relatives, neighbors....\nI hope that you will benefit from the books and stuff :)\nSHARING IS CARING :p","torrent":{"xt":"urn:btih:09c2e67c09f458b09deb6ef318c1bbef4a35cca9","amp;dn":"The+Message+%281977%29+The+Story+Of+Islam+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"09c2e67c09f458b09deb6ef318c1bbef4a35cca9","infoHashBuffer":{"type":"Buffer","data":[9,194,230,124,9,244,88,176,157,235,110,243,24,193,187,239,74,53,204,169]},"announce":[],"urlList":[]}}