{"title":"The Melancholy of Haruhi Suzumiya Complete Series","uid":15931770,"size":18791665795,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:0ad3763f1edb7ec76eb52dca7f238af4caad9452&amp;dn=The+Melancholy+of+Haruhi+Suzumiya+Complete+Series+&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":5,"uploader":"anime4life.","files":67,"time":1475364596,"description":"Summary\r\nThe story follows the narrator and male protagonist Kyon, a cynical and incredulous student of North High School in Nishinomiya. He is dragged along by his classmate, the eponymous female protagonist Haruhi Suzumiya, an eccentric girl seeking supernatural phenomena and figures such as aliens, time travelers, and espers. With Kyon's reluctant help, Haruhi establishes a club called the &quot;SOS Brigade&quot;, short for &quot;Spreading Excitement all Over the World with Haruhi Suzumiya Brigade&quot;, to investigate mysterious events. Haruhi later recruits three additional members: the laconic bibliophile Yuki Nagato, the shy and timid Mikuru Asahina, and the extremely friendly transfer student Itsuki Koizumi. These members soon reveal themselves (to Kyon) to be the types of extraordinary characters that Haruhi is seeking. The three additional members have been sent by their various organizations to observe Haruhi who is unaware that she possesses destructive reality warping powers and to prevent these powers from being unleashed. This leaves Kyon the task of maintaining the illusion of a normal life for Haruhi.\r\n\r\nVideo\r\nVideo Source: Blu ray\r\nVideo Codec: H.265/HEVC\r\nVideo Resolution: 1920x1080p HD (16:9)\r\n\r\nAudio\r\nCodec: AC3\r\nTrack 1: English 5.1ch\r\nTrack 2: Japanese Stereo\r\n\r\nSubtitles\r\nEnglish\r\n\r\nThe Disappearance of Haruhi Suzumiya Movie Info\r\n\r\nSummary\r\nFollowing on from the events of The Melancholy of Haruhi Suzumiya anime series, the story takes place from December 18 until December 24, a month after the cultural festival. The SOS Brigade, led by Haruhi Suzumiya, makes plans to have a nabe party for Christmas. However, on the morning of December 18, Kyon arrives at school and finds that the very nature of his reality has changed; Haruhi and Itsuki Koizumi are missing, Ryoko Asakura has mysteriously returned, Mikuru Asahina does not recognize him and Yuki Nagato is an ordinary human. Only Kyon is aware that everything is different and no one else remembers anything about Haruhi or the SOS Brigade.\r\n\r\nVideo\r\nVideo Source: Blu ray\r\nVideo Codec: H.265/HEVC\r\nVideo Resolution: 1920x1080p HD (16:9)\r\n\r\nAudio\r\nCodec: AC3\r\nTrack 1: English 5.1ch\r\nTrack 2: Japanese 5.1ch\r\n\r\nSubtitles\r\nEnglish\r\n\r\nPlease Seed!","torrent":{"xt":"urn:btih:0ad3763f1edb7ec76eb52dca7f238af4caad9452","amp;dn":"The+Melancholy+of+Haruhi+Suzumiya+Complete+Series+","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0ad3763f1edb7ec76eb52dca7f238af4caad9452","infoHashBuffer":{"type":"Buffer","data":[10,211,118,63,30,219,126,199,110,181,45,202,127,35,138,244,202,173,148,82]},"announce":[],"urlList":[]}}