{"title":"Shingeki no kyojin - 08 [SORE SUBBED] XviD [JKS ENCODED]","uid":8512384,"size":676025826,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:0b74ee4750f50b195fbed0bacd728be481314df6&amp;dn=Shingeki+no+kyojin+-+08+%5BSORE+SUBBED%5D+XviD+%5BJKS+ENCODED%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"jksADIDAS","files":1,"time":1369613288,"description":"Shingeki no kyojin - 08 [SORE SUBBED] XviD [JKS ENCODED]\n--------\nVideo\nXviD .avi\nLength: 24:06\nFrame width.: 1280\nFrame Height: 720\nData rate: 3611kbps\nTotal bitrate: 3739kbps\nFrame rate: 23 f/s\n.\nAudio\nMP3\nBit Rate: 128kbps\nChannels: 2 stereo\nAudio sample rate: 44kHz\n------\nWiki Link: https://en.wikipedia.org/wiki/Shingeki_no_Kyojin\n------\nShingeki no kyojin is a Japanese manga series written and illustrated by Hajime Isayama, which is set in a world where the remains of the human population live inside cities surrounded by enormous walls due to the sudden appearance of the Titans, gigantic humanoid creatures who devour humans seemingly without reason. The story centers around the life of Eren Jaeger and his adoptive sister Mikasa Ackerman, whose lives are changed forever after the appearance of a colossal titan brings about the destruction of their home and the death of their mother.\nAn anime television series debuted on April 7, 2013. A live action film adaptation is also in production\n------\nShingeki no kyojin Episode 08\nTitle: I Can Hear a Heartbeat: Battle of Trost District, Part 4 Original Air Date: May 25, 2013\n...\nWith the supply depot area swarming with Titans, Armin has the idea of using the Rogue Titan to defeat them. Connie and Mikasa agree with his plan and defeat the Titans attacking it, before rushing there. Meanwhile Jean and the others reach the supply depot, despite suffering more casualties on the way, with Armin, Connie and Mikasa arriving soon after. Armin's plan works, but while the Rogue Titan fights the enemies outside, seven smaller Titans lurk arround the fuel storage area. With their gears out of fuel, Armin comes with another plan. The survivors draw the Titans' attention and shoot them in the eyes to blind them, except by seven soldiers who jump from the ceiling to finish them off. Connie and Sasha fail to kill their targets and are saved by Mikasa and Annie. Having sucessfully replenished their fuel, the soldiers prepare to retreat, but they see the Rogue Titan defeating all the other giants and falling down, and much to their shock, watch Eren emerging from its body. Mikasa reaches Eren and cries upon confirming that he is alive, while Armin notices that somehow his severed limbs had recovered as well","torrent":{"xt":"urn:btih:0b74ee4750f50b195fbed0bacd728be481314df6","amp;dn":"Shingeki+no+kyojin+-+08+%5BSORE+SUBBED%5D+XviD+%5BJKS+ENCODED%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0b74ee4750f50b195fbed0bacd728be481314df6","infoHashBuffer":{"type":"Buffer","data":[11,116,238,71,80,245,11,25,95,190,208,186,205,114,139,228,129,49,77,246]},"announce":[],"urlList":[]}}