{"title":"Hawthorne Heights Video Pack","uid":8937339,"size":1083316212,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:0b80fd28ac4b567f22385dc67d8df094693bcddd&amp;dn=Hawthorne+Heights+Video+Pack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"politux","files":-1,"time":1379601739,"description":"\n  Hawthorne Heights Video Pack\n\n  Source: Youtube\n  Container: mp4\n\n  Full Sets:\n\n  Full Set Live in Providence, RI (Alex is Legend)\n  Full Set Live in Foxborough, MA (Alex is Legend)\n  Full Set Live at Warped Tour 2013 Mansfield, MA\n  \n  Live Songs:\n\n  321 - Live at Glass House\n  Bring You Back - Live in New Jersey\n  Dead in the Water - Live at Jack's Bar\n  Dissolve and Decay - Live\n  Golden Parachutes - Live at Warped Tour 2013\n  Hate - Live at Jack's Bar\n  Hope - Live in Houston, TX\n  Nervous Breakdown - Live at the Varsity\n  Niki FM - Live\n  Oceans - Live in Orlando\n  Ohio is for Lovers - Live at CBGB's\n  Ohio is for Lovers - Live on Jimmy Kimmel\n  Pens and Needles - Live\n  Rescue Me - Live at Glass House\n  Running in Place (Niki AM) - Live \n  Saying Sorry - Live on Conan O'Brien\n  Saying Sorry - Live on Jimmy Kimmel\n  Somewhere in Between - Live at Glass House\n  This is Who We Are - Live at Luxor, Cologne\n  Unforgiveable - Live\n  Wake Up Call - Live at Jack's Bar\n  Where I Can Stab Myself in the Ears - Live\n  \n  Artist Bio:  \n  \n  Punky emo pop quintet Hawthorne Heights came to life in the summer of 2001. Originally called A Day in the Life, the Ohio-based band saw numerous lineup changes and shifting musical styles before settling on a permanent formation. Composed of drummer Eron Bucciarelli, bassist Matt Ridenour, vocalist/guitar player J.T. Woodruff, and guitarists Casey Calvert and Micah Carli, Hawthorne Heights built their fan base on a demo recording and a series of self-booked national tours that saw them sharing stages with the likes of From Autumn to Ashes and the Descendents. In 2003, they signed with Chicago label Victory Records, resulting in the 2004 release of their powerful full-length debut, The Silence in Black and White. While the bandmates relentlessly toured behind it, the album became Victory's highest-selling debut, and its lead single, &quot;Ohio Is for Lovers,&quot; slowly invaded rock radio.\n\n  Hawthorne Heights' second album, If Only You Were Lonely, arrived in 2006 along with a DVD titled This Is Who We Are. Leading up to the album's release, Victory urged the band's street team members to help it chart above R&amp;B singer Ne-Yo, whose own album was slated to be released the same day. Questionable promotional tactics included rearranging store displays to hide Ne-Yo's record and make Hawthorne Heights' more prominent. Lonely debuted at number three on the charts, though more than a few eyebrows were raised in the band and label's direction. Regardless, the album continued to sell well, eventually going gold.\n\n  However, controversy came to a head in early August when Hawthorne Heights suddenly announced that they were leaving Victory Records (a move that violated a contractual obligation calling for two more albums) and suing the company over various issues, including unpaid royalties and tarnishing their name over the aforementioned incident (the band claimed to have no knowledge of the infamous street team letter). In a statement issued online, the bandmembers compared their time at the label to being in an &quot;abusive relationship&quot; and directly attacked &quot;greed driven&quot; label head Tony Brummel. As issues were sorted out behind the scenes (and Victory countersued the band, claiming they just wanted to jump to a major's roster), Hawthorne Heights continued touring nationwide and served as a headlining act on the fall 2006 version of the popular Nintendo Fusion Tour.\n\n  Following several court dates with their label, Hawthorne Heights returned to the road in late 2007. However, guitarist Casey Calvert died in his sleep just several hours into the tour, the victim of a lethal combination of anti-depressant medications and Vicodin (Calvert had reportedly undergone a root canal prior to the band's departure, hence his need for painkillers). Soldiering on as a quartet, the bandmates resolved their issues with Victory Records and issued a third album, Fragile Future, in August 2008. Rather than replace Calvert, the band decided to have guitarist Micah Carli fill in on vocals. In 2010, Hawthorne Heights finally did switch labels by having Wind-Up Records issue Skeletons, their fourth album. Meanwhile, Victory wrapped up its contract with the band by releasing Midwesterners: The Hits, which featured material from their first three albums. The band split from Wind-Up in 2010 and formed their own label, Cardboard Empire. Along with touring, they began work on a series of EPs beginning with Hate in the summer of 2011, then Hope in late 2012. The following year the band showed their ambitions with Zero, a post-hardcore concept album about a group of rebels in a dystopian, near-future America.","torrent":{"xt":"urn:btih:0b80fd28ac4b567f22385dc67d8df094693bcddd","amp;dn":"Hawthorne+Heights+Video+Pack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0b80fd28ac4b567f22385dc67d8df094693bcddd","infoHashBuffer":{"type":"Buffer","data":[11,128,253,40,172,75,86,127,34,56,93,198,125,141,240,148,105,59,205,221]},"announce":[],"urlList":[]}}