{"title":"Bones and Muscles - An Illustrated Anatomy (Malestrom)","uid":4700287,"size":9876652,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0e25d7e3443ecf8e8c7b8d359189a996324ab072&amp;dn=Bones+and+Muscles+-+An+Illustrated+Anatomy+%28Malestrom%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"malestrom_HH","files":1,"time":1233694063,"description":" &lt;a href=&quot;http://www.image-upload.net/images/vzoutsl2p6ebvnal6xp.jpeg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.image-upload.net/images/vzoutsl2p6ebvnal6xp.jpeg&lt;/a&gt;\n\nVirginia Cantarella, &quot;Bones and Muscles: An Illustrated Anatomy&quot;\nebook | ISBN: N/A | 192 pages | PDF \n\nBones and Muscles: An Illustrated Anatomy is 187 pages long with 144 full-color illustrations. It is the first anatomy textbook available only in ebook format. It can be downloaded in whole or in part as a PDF file, or ordered as a CD at a fraction of the cost of a typical medical textbook.\nBones and Muscles focuses on only one aspect of the human body--the origins and insertions of the voluntary muscles. The format is simple and uncluttered, with drawings on the right and text--including actions, origins and insertions of the muscles--on the left. Translations of the names of the bones and muscles from the Latin and Greek are provided.\n\n\nThe author and illustrator, Virginia Cantarella, is a renowned medical illustrator with 20 major medical texts to her credit, including the classic Aesthetic Plastic Surgery by Thomas Rees, M.D.\nHere is what Rees has to say about Bones and Muscles:\n&quot;The study of anatomy is innately difficult because of the built in &quot;dryness&quot; of the subject. The mental exercise required to memorize the details is a boring task at best. In medical school, I found the study of Gray's Anatomy to be tedious beyond words. The illustrations were not appealing.\n\n&quot;This new work by Virginia Cantarella is a delight to the eye and makes the study of anatomy a pleasure... She has married accuracy of detail with art - a most difficult task. I was lucky enough to have Ms Cantarella's services in illustrating two editions of my texts AESTHETIC PLASTIC SURGERY, of which I was the editor and author. The clarity and appeal of her illustrations of surgical anatomy contributed much to the success of these books which drew compliments from plastic surgeons from all over the World.\n&quot;I have found these anatomical plates and their accompanying text to be a delight to the eye and the mind. The anatomy is almost incidental to the art. I believe this work will become the classic by which all future texts on anatomy will be measured. The work is useful for all workers in the field of health care whether a surgeon, nurse, paramedic, rehabilitation specialist, or other health provider.&quot;\n\n--Thomas D. Rees, M.D., F.A.C.S.\n&quot;Congratulations on a fine book. I'm impressed. I recommend it highly for surgeons, chiropractors and and massage therapists.&quot;\n-- Dr. Michael Patipa, West Palm Beach, Florida\n&quot;Your illustrations are so clear and precise that we can use them in educating parents on specific injuries/muscles.&quot;\n-- Susan Shonbrun, PT from St. Joseph's Hospital, Tampa, Florida ","torrent":{"xt":"urn:btih:0e25d7e3443ecf8e8c7b8d359189a996324ab072","amp;dn":"Bones+and+Muscles+-+An+Illustrated+Anatomy+%28Malestrom%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0e25d7e3443ecf8e8c7b8d359189a996324ab072","infoHashBuffer":{"type":"Buffer","data":[14,37,215,227,68,62,207,142,140,123,141,53,145,137,169,150,50,74,176,114]},"announce":[],"urlList":[]}}