{"title":"Camtasia.Studio.v6.0.0.Build.689 English-Spanish(Por Gucho)","uid":4560250,"size":42537577,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:0e3e4ce69446d1052ee54453b7a5f25337b9cff7&amp;dn=Camtasia.Studio.v6.0.0.Build.689+English-Spanish%28Por+Gucho%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"gucho1966","files":5,"time":1228609966,"description":"Applications : Windows : English\nCamtasia Studio is one of the most popular and highly-regarded tools when it comes to professional screen recording and editing.\n\nWith Camtasia Studio you can create screencasts and video tutorials in a friendly working environment, including sound, transitions, video effects and a customized intro menu. Plus the latest versions of the recording suite take advantage of the new high-definition video formats to produce high-quality material for the web.\n\nProducing a video with Camtasia Studio is easier than it looks. Firstly, because the program is thoroughly documented, so you&amp;#039;ll always find help if you get stuck; and secondly, because the whole process is divided into three main stages to make things easier for you: recording, editing and producing.\n\nIn the first stage Camtasia Studio provides you with a dedicated built-in tool to record images from your screen. The Camtasia Recorder features many different options to customize your recording settings: use the whole screen or a user-defined area, add cursor effects, record audio as well, and more.\n\nWhen the recording is finished, Camtasia Studio plays the resulting file straight away. If you&amp;#039;re happy with it, it&amp;#039;s time to move on to the next stage, editing. Camtasia Studio offers again a varied range of tools to personalize your video: you&amp;#039;ll be able to draw attention to a certain area with zoom, add more information with on-screen text captions or make it more eye-catching with transition effects, to name a few. The only area in which Camtasia may not be that complete is sound: the audio editor only includes a couple of tools to normalize volume and remove background noise, respectively.\n\nFinally, the production stage. Camtasia Studio makes it really easy, even if you&amp;#039;ve never used video editors before. The trick is using one of the production presets the program includes, such as blog, CD, iPhone, Youtube and of course, HD. Camtasia Studio will guide you through the selection of codecs, sizes and other details, and will finally render your video. Done!\n\nWhether you&amp;#039;re out to make screencasts or need a friendly and complete tool to record videos, Camtasia Studio is the application of choice.\nLanguages:\n\nEnglish/Spanish\nRecent changes in Camtasia Studio:\n\n* HD-quality video for the web: Produce videos for the web using the industry-leading H.264 format\n* Three new production presets (YouTube, HD display, and Screencast.com\n* Independent audio &amp; video editing for fewer mistakes\n* Editing hotkeys\n* Rebuilt recorder\n* Support to edit MOV video files\n* New 3D tilt effect for your videos\n* Finer control over effects: Control the duration of transitions and fades with ultimate precision, right down to a tenth of a second!\n* Web sharing made easy with the Screencast.com preset\nOS requirements for Camtasia Studio:\n\n* OS: Win2000/NT/XP/2003/Vista\n\nMinimum requirements:\n\n* Processor: 1 GHz\n* Free space: 500 MB\n* DirectX 9.0 or later\n* Apple QuickTime 7.1 or later\n* PowerPoint 2000, 2002, 2003, or later\n\n\n\n\nSeguro que alguna vez has has visto un vÃƒÂ­deo a travÃƒÂ©s de Internet y no puedes guardarlo de ninguna forma, o quizÃƒÂ¡ te habrÃƒÂ­a gustado capturar un vÃƒÂ­deo de tu pantalla a modo de tutorial, Camtasia Studio sirve para ambas cosas y para muchas mÃƒÂ¡s.\n\nEsta gran aplicaciÃƒÂ³n es capaz de capturar a vÃƒÂ­deo cualquier cosa que aparezca en tu pantalla, editar el vÃƒÂ­deo resultante, mejorarlo y, finalmente, compartirlo.\n\nEn cuanto a la grabaciÃƒÂ³n, Camtasia Studio permite capturar una ventana, una zona o la pantalla completa. Es capaz de capturar audio, recoger la imagen de una cÃƒÂ¡mara web e incluso se atreve con un PowerPoint. LÃƒÂ³gicamente, los posibilidades son muchas.\n\nSi hablamos de ediciÃƒÂ³n, Camtasia ofrece funciones para hacer zoom, aÃƒÂ±adir audio, crear efectos de transiciÃƒÂ³n e incluso limpiar el sonido de ruidos.\nPor ÃƒÂºltimo, al exportar, encontrarÃƒÂ¡s que puedes publicar tu creaciÃƒÂ³n en Flash, QuickTime, AVI, prepararlo para web, CD o incluso DVD.\nCambios recientes en Camtasia Studio:\n\n* EdiciÃƒÂ³n de vÃƒÂ­deo HD\n* EdiciÃƒÂ³n de audio y vÃƒÂ­deo por separado\n* Atajos de teclado para editar\n* Soporte para archivos MOV\n* Efectos 3D\n* Preset para publicaciÃƒÂ³n en Screencast.com\nPara utilizar Camtasia Studio necesitas:\n\n* Sistema operativo: WinXP/Vista\n\nRequisitos mÃƒÂ­nimos:\n\n* Procesador: 1,0 GHz\n* Memoria: 500 MB\n* Espacio libre en disco: 60 MB\n\nRequisitos recomendados:\n\n* Procesador: 2,5 GHz\n* Memoria: 1,0 GB\n\n\n","torrent":{"xt":"urn:btih:0e3e4ce69446d1052ee54453b7a5f25337b9cff7","amp;dn":"Camtasia.Studio.v6.0.0.Build.689+English-Spanish%28Por+Gucho%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0e3e4ce69446d1052ee54453b7a5f25337b9cff7","infoHashBuffer":{"type":"Buffer","data":[14,62,76,230,148,70,209,5,46,229,68,83,183,165,242,83,55,185,207,247]},"announce":[],"urlList":[]}}