{"title":"Kim Wilde Come Out And Play 2010(320kps@SSDJ)","uid":5977980,"size":64962658,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:0f792226fb56c46c9b9873cabecf054bf65f3eed&amp;dn=++Kim+Wilde+Come+Out+And+Play+2010%28320kps%40SSDJ%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"michelinman","files":17,"time":1290504591,"description":"[img]http://ecx.images-amazon.com/images/I/51ZzuCLsK8L._SL500_AA300_.jpg[/img]\n# Audio CD (26 Aug 2010)\n# Number of Discs: 1\n# Format: CD, Import\n# Label: Sony\n# full set of covers\nFour years after dipping her toes in the music market with the strong but safe, 'Never Say Never', Kim Wilde returns with quite possibly the album of her career. Reawakening her old sound with an incredible 2010 twist, this really is an inspired return to form that builds on the strengths of 'Never Say Never' (the re-recorded 'Kids...', 'Perfect Girl', 'I Fly', 'Maybe I'm Crazy' and then goes supersonic!\n\nAlbum opener, 'King of the World' (a tribute to a recently deceased friend) kicks the album off at a pace, with guitars from all angles (&quot;Electric Guitaaaaaaar!!!) and Kim in complete control. It has hit written all over it, as does the 2nd track 'Lights Down Low' a track that could and should be topping the charts worldwide. It's as strong as any of her biggest hits and would be embraced on dancefloors around the globe if only it got the airplay.\n\nThe pace slows only slighty on 'Real Life' which is a real teaser as it builds and builds, promising a massive chorus which it finally delivers. Insantly likeable and laden with hooks, it could easily be a big single. Glenn Gregory joins Kim on 'Greatest Journey' a grinding ballad in the style of 'Cambodia' before she rocks out again with 'I Want What I Want', a rousing attitude stomper that captures the overall mood of the album well.\n\nA ballad with Nik Kershaw, 'Love Conquers All' follows which altho good is probably one of the weaker tracks on the album. Good but slightly dated and therefore not quite in step with the rest of the tracks, but this is soon overturned with 'Hey! You!' a massive concert friendly assualt, with echoes of Depeche Modes 'Personal Jesus', that could easily be another single. The pace doesn't let up with 'Suicide' and 'This Paranoia' which hark back to Kim's earliest albums, and evoke a very early 80's/New Wave feel.\n\n'Loving You More (Than You Know) follows, a massive electro heavy, atmospheric ballad which is quite possibly one of the best ballads Kim has ever sung. Material like this is gold dust, and she totally delivers on this one. It's a much more produced version than those she's sung live recently, very much in the vein of Depeche Mode's 'Home'. Then comes 'Get Out' a breathless belter of a song that never lets up from start to finish leaving you exhausted by the end. Any current girl band would kill for this song and Kim stamps her authority all over it. If they had the balls to release it and it got picked up by radio it'd be MASSIVE!!\n\nBack into cruise control for 'My Wish Is Your Command', another 80's rock number similar to 'Chequered Love' before the album turns on its head with 'Jessica' a self penned ditty where Kim sings beautifully with just a piano and a few sparse backing vocals. If you liked 'Lucky Guy' from her 'Close' album you'll LOVE this. If it was just a little bit longer it'd be perfect and it closes the album in a surprising and delicate way.\n\nAn album like this doesn't come along every day. If you've ever liked Kim Wilde, take a chance and buy this album. It seriously will blow you away with it's energy. There's at least 8 absolute belters on here that will stick in your head like the best of her hits. It's criminal that we all know it will go unheard by the masses, but in some ways that's what makes us love Kim all the more as she's put her heart and soul into this album for us fans and for that I can't thank her enough. Now how about a gig at the Shepherds Bush Empire..?\n[IMG]http://i896.photobucket.com/albums/ac169/pbf99/tr.gif[/IMG]\n01-kim_wilde_-_king_of_the_world.mp3\t5.11 MB\n02-kim_wilde_-_lights_down_low.mp3\t4.37 MB\n03-kim_wilde_-_real_life.mp3\t5.56 MB\n04-kim_wilde_-_greatest_journey_(duett_with_glenn_gregory).mp3\t5.77 MB\n05-kim_wilde_-_i_want_what_i_want.mp3\t4.84 MB\n06-kim_wilde_-_love_conquers_all_(feat_nik_kershaw).mp3\t4.85 MB\n07-kim_wilde_-_hey_you.mp3\t4.65 MB\n08-kim_wilde_-_suicide.mp3\t4.42 MB\n09-kim_wilde_-_this_paranoia.mp3\t4.03 MB\n10-kim_wilde_-_loving_you_more.mp3\t5.92 MB\n11-kim_wilde_-_get_out.mp3\t6.22 MB\n12-kim_wilde_-_my_wish_is_your_command.mp3\t4.7 MB\n13-kim_wilde_-_jessica.mp3\t1.34 MB\n\n[IMG]http://i896.photobucket.com/albums/ac169/pbf99/ENJOY.gif[/IMG]\n[img]http://torrent-stats.info/73ca/78596392.png[/img]","torrent":{"xt":"urn:btih:0f792226fb56c46c9b9873cabecf054bf65f3eed","amp;dn":"++Kim+Wilde+Come+Out+And+Play+2010%28320kps%40SSDJ%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0f792226fb56c46c9b9873cabecf054bf65f3eed","infoHashBuffer":{"type":"Buffer","data":[15,121,34,38,251,86,196,108,155,152,115,202,190,207,5,75,246,95,62,237]},"announce":[],"urlList":[]}}