{"title":"The First Law Series","uid":7753088,"size":2194585,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:10b93f36e35841cbe0df4be5afc6a897185f6bb8&amp;dn=The+First+Law+Series&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"sumodhkrishna","files":5,"time":1351015057,"description":"Logen Ninefingers, infamous barbarian, has finally run out of luck. Caught in one feud too many, he's on the verge of becoming a dead barbarian - leaving nothing behind him but bad songs, dead friends, and a lot of happy enemies.\nNobleman, dashing officer, and paragon of selfishness, Captain Jezal dan Luthar has nothing more dangerous in mind than fleecing his friends at cards and dreaming of glory in the fencing circle. But war is brewing, and on the battlefields of the frozen North they fight by altogether bloodier rules.\n\nInquisitor Glokta, cripple turned torturer, would like nothing better than to see Jezal come home in a box. But then Glokta hates everyone: cutting treason out of the Union one confession at a time leaves little room for friendship. His latest trail of corpses may lead him right to the rotten heart of government, if he can stay alive long enough to follow it.\n\nEnter the wizard, Bayaz. A bald old man with a terrible temper and a pathetic assistant, he could be the First of the Magi, he could be a spectacular fraud, but whatever he is, he's about to make the lives of Logen, Jezal, and Glotka a whole lot more difficult.\n","torrent":{"xt":"urn:btih:10b93f36e35841cbe0df4be5afc6a897185f6bb8","amp;dn":"The+First+Law+Series","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"10b93f36e35841cbe0df4be5afc6a897185f6bb8","infoHashBuffer":{"type":"Buffer","data":[16,185,63,54,227,88,65,203,224,223,75,229,175,198,168,151,24,95,107,184]},"announce":[],"urlList":[]}}