{"title":"Flying Corps Gold","uid":11999106,"size":802528680,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:115cd254def3f9fb0aedda723d259d248eaf1aad&amp;dn=Flying+Corps+Gold&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"MADJACKTHEPISSEDPIRATE","files":4,"time":1433719874,"description":"well after finding redgaurd and draken were on here my first search of tpb netting nothing cause i spelled drakan wrong. heres another of my old image filed games that i archived with clone cd..you can burn the image to a cd with clone cd  if nothing else works\n\nIF YOU GRAB THIS PLEASE SEED IT TO 1.5....I HAVE VPN PROBLEMS AND EVEN WITH VPN LIFEGAURD I CANT LEAVE MY PC UNATTENDED FOR LONG JUST IN CASE..AND IT KICKS OUT ONCE EVERY FEW HRS ON AVERAGE..SO I CAN ONLY SEED FOR 8 HRS TDAY AT 100KBPS MAX. THANKS\n\n\n\nFlying Corps is a 1996 World War I flight simulator developed by Rowan Software and published by Empire Interactive. It was one of the most popular flight simulators of its time due to its accurate flight models and graphics, and also the novelty factor of a First World War dog fight simulator. Flying Corps is one of the few flight simulators to have dealt with the First World War - Red Baron, Knights of the Sky and the more arcade-oriented Wings have attempted to do the same, but most companies focus on modern air combat and World War II (usually the Battle of Britain).\n\nThe game is split in four campaigns: The Flying Circus (1917), Battle of Cambrai 1917, Spring Offensive (1918) and Hat In The Ring (1918). Several airplanes are available, including the Sopwith Camel, the Nieuport 28 and the Fokker Dr.I.\n\nIt was reshipped in 1997 with 3dfx support and a few extras in a package named Flying Corps Gold","torrent":{"xt":"urn:btih:115cd254def3f9fb0aedda723d259d248eaf1aad","amp;dn":"Flying+Corps+Gold","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"115cd254def3f9fb0aedda723d259d248eaf1aad","infoHashBuffer":{"type":"Buffer","data":[17,92,210,84,222,243,249,251,10,237,218,114,61,37,157,36,142,175,26,173]},"announce":[],"urlList":[]}}