{"title":"Yoshishige Yoshida - Kagami no onnatachi aka Women in the Mirror","uid":4718720,"size":2112227746,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:1249930a4d65a51581b1f78982c4d77be561bcff&amp;dn=Yoshishige+Yoshida+-+Kagami+no+onnatachi+aka+Women+in+the+Mirror&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"lord_terabyte","files":-1,"time":1234404474,"description":"Yoshishige Yoshida - Kagami no onnatachi aka Women in the Mirror (2002)\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0317793/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0317793/&lt;/a&gt;\n\nLanguage\tJapanese\nSubtitles\tincluded: English &amp; Francais sub/idx\n &lt;a href=&quot;\nhttp://img134.imageshack.us/img134/5406/womeninthemirrortv0.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img134.imageshack.us/img134/5406/womeninthemirrortv0.jpg&lt;/a&gt;\n\n[QUOTE]Women In The Mirror is the story of three generations of women: a grandmother, Ai (Mariko Okada); her daughter Masako (Yoshika Tanaka); and Masako's daughter Natsuki (Sae Isshiki). It has been 24 years since Masako's disappearance not long after Natsuki's birth. Grandmother and granddaughter are living together in Tokyo when Ai learns that Masako has been found. The family is reunited, but Masako, suffering from amnesia, only recognizes one name: Hiroshima. Could she really be Ai's daughter?[/QUOTE]\n\n[QUOTE]Kijyu Yoshida's first feature in 15 years, &quot;Kagami no Onnatachi (Femmes En Miroir),&quot; is a throwback to the humanistic films with critical social and political agendas that once flowed from Japan's 1960s nouvelle vague. Together with Nagisa Oshima, Masahiro Shinoda and Shohei Imamura, Yoshida was a prominent member of this movement due to such films as &quot;Joen (The Affair),&quot; &quot;Eros Plus Gyakusatsu (Eros Plus Massacre),&quot; and &quot;Rengoku Eroika (Heroic Purgatory).&quot;\n\nIt is also a reminder of why such films have become harder to sell to younger Japanese audiences; Yoshida's concern with the impact of the Hiroshima atomic bombing across the decades will hardly seem pressing to an apolitical generation that only knows the war and its aftermath from textbooks (if that), while his orthodox stylistics and weepy story of maternal guilt and redemption will remind them less of Japanese Golden Age classics than lugubrious TV dramas designed to make viewers empty their Kleenex boxes.\n\nAt the center of the film's three-generation story line is Ai Kawase (Mariko Okada), an elderly widow who lives alone in an elegant old house. Her only daughter, Miwa, ran away from home 24 years ago at the age of 20, leaving an infant daughter, Natsuki -- and no subsequent word of her whereabouts. Her husband, a prominent physician, died several years ago, but Ai still feels haunted by his absence -- and continues her search for Miwa. Then, one day , she receives word that Miwa (Yoshiko Tanaka) has been found, arrested on a kidnapping charge. She is going by a different name, Masako, and has no memory of her previous life.\n\nStunned and excited by this news, Ai calls Natsuki (Sae Isshiki), who is now living in the United States, and asks her to return home. That day, she also receives a visit from a young TV producer (Mirai Yamamoto), who wants her cooperation for a documentary program about a U.S. soldier who was in Hiroshima at the time of the atomic bombing -- and was saved by Ai's husband. Ai, however, curtly refuses, saying that she knows nothing of this incident -- a lie, as it turns out.\n\nWhen Ai finally meets Masako, who has been released on bail, she suspects that this blank-faced woman could indeed be her daughter -- after all, Masako still has a notebook with a record of Natsuki's development as an infant. But when Masako says she is willing to get a DNA test to confirm the relationship, Ai hesitates.\n\nShe wants to first reconstruct a family that has been torn apart -- a task seemingly as difficult as repairing the mirror in the hallway that Miwa shattered shortly before she ran away.\n\nThe trauma of Hiroshima, the film implies, has echoed through three generations -- following her mother's abandonment, even Natsuki finds it difficult to trust other human beings. Yoshida describes this trauma obliquely, with images of broken mirrors, disturbed dreams and the inevitable shots of the Hiroshima Peace Park and Atomic Dome.\n\nThis in-your-face symbolism may resonate with the aforementioned TV drama fans, but younger audiences, as well as older moviegoers who remember Yoshida's best work, will be less impressed. &quot;Kagami no Onnatachi&quot; has little new or striking to say about a tragedy that some of Japan's greatest filmmakers, including Shohei Imamura (&quot;Black Rain&quot;) and Akira Kurosawa (&quot;Record of a Living Being,&quot; &quot;Rhapsody in August&quot;) have dealt with over the decades.\n\nOkada, a favorite of Mikio Naruse and Yasujiro Ozu, who returns to the screen after a 19-year absence, brings a matronly dignity to the role of Ai, though her motherly agonizing stays at the same pitch for too long.\n\nThe strongest performance is that of Tanaka, whose economy in conveying Miwa/Masako's isolation and anger stands in sharp contrast to the over-emoting around her. The film, however, never quite makes clear how much of her predicament is due to Hiroshima specifically, the war in general, or simply the tribulations of life itself. Yoshida evidently needs Hiroshima to tell his story, but the story could probably still stand without it.[/QUOTE]\n &lt;a href=&quot;\nhttp://bayimg.com/image/hanobaabe.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/image/hanobaabe.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://bayimg.com/image/hanoaaabe.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/image/hanoaaabe.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://bayimg.com/image/hanocaabe.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/image/hanocaabe.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://bayimg.com/image/hanodaabe.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/image/hanodaabe.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://bayimg.com/image/hanoeaabe.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/image/hanoeaabe.jpg&lt;/a&gt;\n\n---my rip---\n\nThis is an upgrade. The previous WRD rip had an extremely low bitrate, less than half of what would be adequate. I ended up with a higher bitrate than planned. I'm not sure how it happened, but much of the movie is quite dark so it's not entirely a bad thing.\n\n\nFile Size (in bytes):...........................2,083,358,720                     \n                                                                                \n--- Video Information ---                                                       \nVideo Codec Name:...............................XviD ISO MPEG-4              \nDuration (hh:mm:ss):............................2:09:54                \nFrame Count:....................................186869             \nFrame Width (pixels):...........................656                  \nFrame Height (pixels):..........................352                  \nAspect Ratio:...................................1.864                     \nFrames Per Second:..............................23.976          \nVideo Bitrate (kbps):...........................1937                 \n......MPEG-4......B-VOP........................                    \nQuality Factor (bits/pixel)/frame:..............0.350&quot;                     \n                                                                                \n--- Audio Information ---                                                       \nAudio Codec:....................................0x0055 MPEG-1 Layer 3                   \nAudio Sample Rate (Hz):.........................48000             \nAudio Bitrate(kbps):............................192                 \nAudio Bitrate Type (&quot;CBR&quot; or &quot;VBR&quot;):............CBR            \nAudio Channel Count:............................2           \n\nFreakyflicks is a free and open community dedicated to preserving and sharing cinematic art in the digital era. Our goal is to disseminate such works of art to the widest audience possible through the channels provided by P2P technology.\n\nThe Freakyflicks collection is limited to those films that have played an exceptional role in the history of cinema and its progression in becoming a great art. Films that are usually described as classic, cult, arthouse and avant-garde.\n\nIf you have films that fit this description feel free to share them and participate in our community. All you need do is include this tag in your upload and join us at the forum to announce your release.\n\n\n'If we all seed just 1:1, give at least what we take, this torrent will NEVER DIE","torrent":{"xt":"urn:btih:1249930a4d65a51581b1f78982c4d77be561bcff","amp;dn":"Yoshishige+Yoshida+-+Kagami+no+onnatachi+aka+Women+in+the+Mirror","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1249930a4d65a51581b1f78982c4d77be561bcff","infoHashBuffer":{"type":"Buffer","data":[18,73,147,10,77,101,165,21,129,177,247,137,130,196,215,123,229,97,188,255]},"announce":[],"urlList":[]}}