{"title":"David Gray - Flesh -  2004 CD Reprint of 1994 Release","uid":9432952,"size":280995792,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:131346da51ed1e082f8358aeeeb25e5094cbbde2&amp;dn=David+Gray+-+Flesh+-++2004+CD+Reprint+of+1994+Release&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Big-Papi","files":-1,"time":1388796753,"description":"Source: 2001 CD (1994 Reprint)\n\n\nBy Thomas J C\n&quot;The definition of romance&quot;\n\nDavid Gray's second album continues in the same folk-acoustic-ballad-rock vein of his previous masterpiece 'A Century Ends'. There is a definite development here though - it's a much more romantic record, probably because Gray got married around the time of making it. There's more of a relaxed feel, it seems he's got a lot of his anger and frustration out and is now relishing the love in his life - the MOST important thing. The songs - driving folk-rockers 'Made Up My Mind' and 'Love's Old Song' add some nice pace to proceedings. The soaring 'Coming Down', 'Flesh', 'New Horizons' and 'The Light' are perfect uplifting folk ditties/ballads, the latter being especially brilliant. The epitomie of love and romance that are 'Mystery of love' and 'Lullaby' leave you yearning for your own loved one. Gray even conjures a protest song of sorts in 'What Are You' - a Dylan esque diatribe, spat in fury, about how wrong it is to sell your soul to commercialism. (Some fans suggest that's what he did with releasing all those songs from 'White Ladder' but not me - he can do what he damn likes). There were a few of these on 'A Century Ends' and only one here. The best song here is the beautiful piano based 'Falling Free', similar in many respects to his other classic 'This Years Love', this is Gray at his genius best - a simple yet heartbreakingly beautiful confession of love. Get this album for ' Falling Free' and 'The Light' alone'- you will not regret it. One of my favourite albums ever. Brilliant voice, brilliant musician, brilliant album.","torrent":{"xt":"urn:btih:131346da51ed1e082f8358aeeeb25e5094cbbde2","amp;dn":"David+Gray+-+Flesh+-++2004+CD+Reprint+of+1994+Release","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"131346da51ed1e082f8358aeeeb25e5094cbbde2","infoHashBuffer":{"type":"Buffer","data":[19,19,70,218,81,237,30,8,47,131,88,174,238,178,94,80,148,203,189,226]},"announce":[],"urlList":[]}}