{"title":"Missogyny-------MG-0425 - Tori Lux gets locked in stocks","uid":8514176,"size":709100877,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:136f63c85c0259ffc3d0ee210e3b3e6334b2c855&amp;dn=Missogyny%5C-------MG-0425+-+Tori+Lux+gets+locked+in+stocks&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"merzedes","files":-1,"time":1369673044,"description":"MissogynyMG-0425 - Tori Lux &amp; MISSogyny - Tori Lux gets locked in stocks\n\n\nDescription: Tori Lux keeps proving her usefulness to Mistress MISSogyny as a submissive slut and dungeon test subject. She has a tremendous appetite for pain and punishment, and her willingness to accept discipline puts her in the top of Mistress MISSogynys class. During her session in this video, Mistress has a set of stocks she has been dying to play with and she wanted dear, sweet Tori to be the first to try out. The stocks are inverted however, and the punishee is locked in at the wrists and ankles with a large space for the ass to protrude instead of the head. So Tori finds herself on her knees, bent over until her face is also planted on the floor with her hands and feet locked into the stocks and her bare ass nakedly on display for Mistress MISSogyny to play with and abuse. And abuse she does. She spanks and flogs Toris sweet ass until it is red and glistening with pain and then she buzzes her pussy with a magic wand until she is on the brink of orgasm. Finally Mistress frees Tori from the stocks, only to tie her upright and continue the punishment. Device bondage of this quality knows no restraints. \n\n\n\nScreens                                &lt;a href=&quot;\nhttp://www.missogyny.com/t2/show.php?a=1753_3&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.missogyny.com/t2/show.php?a=1753_3&lt;/a&gt;\n\n\n10 000 uploads and counting, if you like what Shallow2 and I upload, how about leaving us a nice comment below ? :)   \n\n\nCheers  :-)","torrent":{"xt":"urn:btih:136f63c85c0259ffc3d0ee210e3b3e6334b2c855","amp;dn":"Missogyny%5C-------MG-0425+-+Tori+Lux+gets+locked+in+stocks","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"136f63c85c0259ffc3d0ee210e3b3e6334b2c855","infoHashBuffer":{"type":"Buffer","data":[19,111,99,200,92,2,89,255,195,208,238,33,14,59,62,99,52,178,200,85]},"announce":[],"urlList":[]}}