{"title":"agp12.zip","uid":6849404,"size":266296774,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:1396e9b25b0f60a6f22d281c5549dc428b1c3da2&amp;dn=agp12.zip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mempile","files":1,"time":1322464819,"description":"AGP 12 is the second of two featuring the work of Aribert Reimann, a gifted German composer born in 1936, whose work combines a stirring lyricism with highly stimulating harmonies and orchestrations. Some of his compositions are in print, including his opera King Lear, and a selection of works for voice and piano that was recorded in the 1970s has been re-released (there is a listing for it at Presto Classical). However, some of his most significant compositions have never been released on CD, including the works that comprise AGP 11 and 12.\n\nThis installment features three works composed between 1967 and 1972. Like most of Reimann\\\\\\\\\\\\\\'s works, two of these are for voice, demonstrating his remarkable melodic sense. Inane was written especially for Joan Carroll, who performs it in this recording. The piano concerto melds the piano with various combinations of the 19 accompanying instruments in a series of chamber ensembles, alternating with dense polyphony in the tutti sections. The text file included in the installment contains the English notes that came with the LPs, including a long analysis of Reimann\\\\\\\\\\\\\\'s works up to the early 1970s.\n\nNOTE: This installment can be combined with AGP 11 on two CDs, as follows: Inane fits with the first two sides of the Requiem, and the last two sides of the Requiem fit with the remaining two works in this installment.","torrent":{"xt":"urn:btih:1396e9b25b0f60a6f22d281c5549dc428b1c3da2","amp;dn":"agp12.zip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1396e9b25b0f60a6f22d281c5549dc428b1c3da2","infoHashBuffer":{"type":"Buffer","data":[19,150,233,178,91,15,96,166,242,45,40,28,85,73,220,66,139,28,61,162]},"announce":[],"urlList":[]}}