{"title":"Countrymen (2013) Bo Lidegaard (multi)","uid":9498495,"size":24839115,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1459b1a9d2aaecda6d84fa3f0aa9ff74f2954c2e&amp;dn=Countrymen+%282013%29+Bo+Lidegaard+%28multi%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"7","files":-1,"time":1390163645,"description":"Countrymen by Bo Lidegaard\n\n\nFormat: mobi/epub/azw3\nLength: 416 pages\nGenre: History\nDate: 14 December 2013\n\nThe untold story of a nation of Schindlers: this is the gripping, moving and ultimately life-affirming story of how during WWII the people of Denmark rallied to save their Jewish population from the Nazis.\n\nThe rescue of the Danish Jews from Nazi persecution in October 1943 is a unique exception to the tragic history of the Holocaust. Within a few weeks some 7,000 people managed to escape, leaving the German occupation forces in Denmark almost empty handed. What made this possible? Who rescued the Jews and who enabled their rescue? What was the interplay between the Nazi leadership in Berlin, their agents in Copenhagen, the Danish authorities and indeed the Jews and their Danish compatriots?\n\nFor decades these questions have been answered only by simplistic myths. Now, for the first time, Bo Lidegaard brings together decades of research and new evidence to tell the story as seen both through the eyes of individual refugees and through the prism of politics at all levels, from the Fuhrer himself down to the Danish police. Based on contemporary documentation, the narrative draws upon primary sources not previously known to the public, as well as on a host of historical research into various aspects of the rescue. Ultimately, this story is a tribute to the inspiring capacity of an entire people to stand up and do the right thing in a time of crisis.\n\nAuthor:\n\nBo Lidegaard is a Danish historian, author and editor-in-chief of the daily broadsheet newspaper Politiken. He has been awarded some of the highest of Denmark's national honours for his writings. ","torrent":{"xt":"urn:btih:1459b1a9d2aaecda6d84fa3f0aa9ff74f2954c2e","amp;dn":"Countrymen+%282013%29+Bo+Lidegaard+%28multi%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1459b1a9d2aaecda6d84fa3f0aa9ff74f2954c2e","infoHashBuffer":{"type":"Buffer","data":[20,89,177,169,210,170,236,218,109,132,250,63,10,169,255,116,242,149,76,46]},"announce":[],"urlList":[]}}