{"title":"The Well Beloved - Thomas Hardy  (Unabridged)","uid":6694780,"size":95159657,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:155bbfacbf8eebf1770767792f5431c6b8c050fc&amp;dn=The+Well+Beloved+-+Thomas+Hardy++%28Unabridged%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"neil1966hardy","files":12,"time":1316732502,"description":"This is an unabridged version, 91MB, running for 6.6 hours.\n\nEncoded as 32kbps 22050Hz MP3 mono - radio quality.\n\n------------------------------------------------------------------------------------------\n\n\nReview found on DooYoo.co.uk\n\n\nThe Well-Beloved is, apart perhaps from Desperate Remedies, Hardy's least-known novel, perhaps because it has never been filmed. It is also the least realistic, or the most &quot;modern&quot;, and a personal favorite that I discovered simply because I had read all the better-known works.\n\nJocelyn Pierston, a sculptor from the Isle of Slingers (the Isle of Portland in the real world) returns home from London and meets his childhood friend Avice Caro, who runs up to him and kisses him. He, with his refined London manners, is initially put out by this forwardness and, though he loves Avice, their relationship never quite recovers from this initial awkwardness. It finally comes to and end when Pierston elopes with Junoesque beauty Marcia Bencomb, though owing to a mix up with the licence they do not marry.\n\nUnusually for a male Hardy character, Pierston is successful, sophisticated and something of a womaniser, who banters with his friends about the well-beloved - his ideal woman whom he glimpses from time to time in real women but who never remains in any one lover for long. Time, however, catches up with him, and his relationships all end in disappointment as the well-beloved departs from the scene.\n\nPierston is increasingly drawn to the memory of Avice, and returns home to court her daughter, Avice number two, who lacks her mother's sterling qualities, and tries to match Pierston with her own daughter, Avice number three. His liaison with a girl forty years his junior is somewhat ridiculous, but intentionally so, and he is forced humiliatingly to confess to her that he one courted her grandmother, on hearing which the naive girl merely asks if he loved her great grandmother also.\n\nPierston eventually marries Marcia, but her merits are obscured by his knowledge that she never was, or ever can be, the well-beloved. The Pursuit of the Well-Beloved, the earlier of the two versions of the story, is the bleaker, ending with Pierston utterly destroyed, laughing hysterically as he compares the ageing Marcia's face - a &quot;parchment-covered skull&quot; - with a picture of his lost Avice. In the later, more mature version, he quietly fades into respectable obscurity.\n\nI can imagine some readers not liking this book: Pierston is a narcissistic character who has plenty of the good things in life and is still unsatisfied. But he is given worldly success in order to show that his happiness lay in another direction: when he turns away from Avice the first because she offends convention he loses his hope of true happiness. The French Lieutenant's Woman was inspired by this book and uses many of the same ideas, including the alternative endings.\n\nThe Well-Beloved shows Hardy at the height of his powers, playing games with the conventions of fiction, but to serious purpose. If any of Hardy's characters &quot;is&quot; Hardy then it is Pierston: the artist whose worldly success never compensates for the lost love of his cousin. And there is no character that Hardy so systematically humiliates: &quot;Alas for this grey shadow, once a man!&quot;\n\n------------------------------------------------------------------------------------------\n\nRead by Robert Powell\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:155bbfacbf8eebf1770767792f5431c6b8c050fc","amp;dn":"The+Well+Beloved+-+Thomas+Hardy++%28Unabridged%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"155bbfacbf8eebf1770767792f5431c6b8c050fc","infoHashBuffer":{"type":"Buffer","data":[21,91,191,172,191,142,235,241,119,7,103,121,47,84,49,198,184,192,80,252]},"announce":[],"urlList":[]}}