{"title":"Rick Springfield - Love Somebody (Live-Beat Club) (2nafish)","uid":5240448,"size":115380228,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:173bdd557d2a24b5a962702e0662c22efd4f78ea&amp;dn=Rick+Springfield+-+Love+Somebody+%28Live-Beat+Club%29+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"2nafish","files":-1,"time":1261740176,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nRick Springfield (born Richard Lewis Springthorpe on 23 August 1949 in Sydney, Australia) is an Australian-American songwriter, musician and actor. As a musician, he is most famous for the 1981 #1 single &quot;Jessie's Girl&quot;, which became a Grammy Award-winning landmark of 1980s pop-rock and helped establish the emerging music video age. As an actor, Springfield's best known role is that of the character Dr. Noah Drake on the daytime drama General Hospital. He originated the character from 1981-1983 and then returned to play him again from 2005 until 2008[when?]. He then appeared on Don't Forget The Lyrics in January 2009 to sing &quot;Jessie's Girl&quot; and his new song &quot;What's Victoria's Secret&quot;. He stayed until the show was over[when?]. On March 19, 2009, he played a gig in support of &quot;Voices of Uganda&quot; at the Key Club in Los Angeles. The gig was co-organized by fellow General Hospital alum, actress Melissa Fitzgerald.\n\nIn 1984, Springfield made one full length feature film Hard to Hold. It was considered a box office failure, but the movie did produce a successful soundtrack with a top ten song &quot;Love Somebody.&quot;\n\nHard to Hold is an album released by Rick Springfield in 1984 as the soundtrack to the movie of the same name. The single &quot;Love Somebody&quot; reach #5 on the US Hot Singles chart.The Album was originally released on RCA-Victor as ABL1-4935.\n\nHis 1984 single &quot;Love Somebody&quot; (from the soundtrack album to the Hard to Hold movie he starred in that year) was his last top ten hit in the U.S. to date, reaching #5 on the Billboard singles chart. He stopped touring in 1985, for the birth of his first son, Liam. Also in 1984, Mercury Records released Beautiful Feelings which were unreleased sessions Springfield recorded in 1978 remixed with new instrumentation. Springfield took out advertisements in the music press decrying the release. Despite the controversy, &quot;Beautiful Feelings&quot; reached number 78 on the LP charts, and a single, &quot;Bruce&quot;, a song about people mistaking Springfield for Bruce Springsteen, hit number 27 on the Hot 100.\n\nSpringfield was one of several performers who participated in the Live Aid charity concert. After releasing the album Tao in 1985, Springfield chose to take a break from recording to spend more time with his family, and to deal with the depression that had affected him since his adolescence.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:173bdd557d2a24b5a962702e0662c22efd4f78ea","amp;dn":"Rick+Springfield+-+Love+Somebody+%28Live-Beat+Club%29+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"173bdd557d2a24b5a962702e0662c22efd4f78ea","infoHashBuffer":{"type":"Buffer","data":[23,59,221,85,125,42,36,181,169,98,112,46,6,98,194,46,253,79,120,234]},"announce":[],"urlList":[]}}