{"title":"MomsTeachSex - Alli Rae, Brandi Love, Kimmy Granger","uid":12939133,"size":332602323,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:18050bc03f7be271634f39b847948efefcc0e936&amp;dn=MomsTeachSex+-+Alli+Rae%2C+Brandi+Love%2C+Kimmy+Granger&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"feeldabyte","files":1,"time":1449614125,"description":"Screens &amp; Info :\r\n\r\n―――――――――――――――――――――――――――――――――\r\n \nhttp://imgkiss.com/image/rl2Er \nhttp://imgkiss.com/image/rl8Tq\r\n\r\n―――――――――――――――――――――――――――――――――\r\n\r\nKimmy Granger and Alli Rae are playing a game with Damon Dice when Alli's mom Brandi Love joins them. Damon gets uncomfortable when the girls start talking about penis size, and he is truly stunned into silence when they decide to see whether his cock is a big one. When all three girls start undressing him, Damon can only go with the flow. Soon Kimmy has pulled Damon's hardening dick from his boxers. Brandi decides to give an impromptu blowjob lesson to help Kimmy bring him up to full size. After getting the younger girls' shirts off, Brandi orders them down on their knees so that both girls can suck Damon off at the same time. While Alli starts deep throating Damon's dick, Brandi and Kimmy work on undressing each other. Once they're both naked, they join Alli on the ground and force the blonde to share her fuck sick so that they can all suck him off and work on their deep throating skills. Settling Damon down on the couch with Alli still working him with her mouth, Kimmy and Brandi change tactics and go for Alli's pussy instead. Brandi gets Kimmy settled eating Alli out and using her fingers to take the blonde's tight little twat to a whole new level of pleasure, and then scoots down to mimic those movements on Kimmy's cock hungry snatch. Wanting to give Kimmy something even hotter, Brandi soon coaxes the younger girl onto the couch so that she can eat Kimmy out while finger fucking Alli's twat. That kicks off a pussy feast and everyone is invited! The girls take turns eating each other out, with one of them always putting their mouth to work on Damon's fuck stick. When Alli has finally grown too horny to wait, she climbs onto Damon's lap and slides her juicy twat down onto his dick so that she can go for a ride while Kimmy and Brandi continue to pleasure each other's twats. Eventually Brandi and Kimmy each replace Alli, taking their turn getting their pussies thoroughly pounded. As much fun as all three girls are having, eventually their good times must come to an end when their stud works himself up to his inevitable climax. Pulling out of Kimmy's creamy fuck hole, Damon lets Brandi and Alli use their hands to bring him over the edge so that he covers Kimmy in his creamy cum. As they all cool down from their lovemaking binge, the girls exchange salty kisses and play with Damon's jizz.\r\n\r\n\r\nSail to another one :  https://thepiratebay.se/user/feeldabyte/","torrent":{"xt":"urn:btih:18050bc03f7be271634f39b847948efefcc0e936","amp;dn":"MomsTeachSex+-+Alli+Rae%2C+Brandi+Love%2C+Kimmy+Granger","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"18050bc03f7be271634f39b847948efefcc0e936","infoHashBuffer":{"type":"Buffer","data":[24,5,11,192,63,123,226,113,99,79,57,184,71,148,142,254,252,192,233,54]},"announce":[],"urlList":[]}}