{"title":"Buttmans Nordic Blondes (2010) ","uid":5791103,"size":2200784896,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:1853484d927101a1a223917dd5b24f087d8c3ff0&amp;dn=Buttmans+Nordic+Blondes+%282010%29+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"webchella","files":3,"time":1282849992,"description":"Buttmans Nordic Blondes (2010) \n &lt;a href=&quot;\nhttp://www.spicetvstore.com/exec/v1_item.asp?item_id=1539387&amp;partner_id=10008496&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.spicetvstore.com/exec/v1_item.asp?item_id=1539387&amp;partner_id=10008496&lt;/a&gt; &lt;a href=&quot;\nhttp://www.tlavideo.com/raw-buttmans-nordic-blondes/p-311952-4?sn=263&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.tlavideo.com/raw-buttmans-nordic-blondes/p-311952-4?sn=263&lt;/a&gt;\n\nStudio \tEvil Angel\nRelease Date Aug 21, 2010\nCategory All Sex, Anal, Blondes\nDirector John Stagliano\nStarring Mandy Bright, Kate Frost, Dora Venter, Tanja De Vries, Christy, Judith Grant, Mark DeBruin, Manuel Ferrara, Rocco Siffredi, Brandon Iron, Alberto Rey, Andrew Youngman\n\n\nLegendary director Stagliano handpicked seven episodes from his voluminous library, with Nordic blondeias theionly prerequisiteifor theiladies fucking andisuckingiin scenes that range from classic gonzo, suchias Dutch beauty Tanyaiin theiseminal Adventures of Buttman,ito theifetish explorationiin his shot-on-film opus, Fashionistas. The latter isn't fromia Buttman movie; however, who could complain about theiinclusion of an award-winning scorcher like Stagliano's perfectly captured encounter featuring Rocco Siffredi's old-world domination of towheaded American Kate Frost? The cover shot of Nikki Anderson, perhaps one of theimost iconic of Buttman's photo images, isifrom Buttmaniin Budapest. A visitito Christoph Clark's hilltop lair exposes theiflawless golden blonde sunbathing onitheibalcony. Christoph coaxesia reluctant Nikkiito open upifor Buttman's camera andibefore long,ia double penetration fuck with Christoph andiAndrew shot fromia voyeur's point-of-view. The narration andicamera angles reveal theisense of wonder andiexcitement that isicentralito everyman's identification with Buttman. Watching Buttman's hand enter theiframe so he can squeeze Dora Venter's perfectly round, goose-pimpled ass, held aloft byiher white tights creating that spill-over butt flesh effect, isiwhy POV porn succeeds. The viewer isitheidoer ... fantasy created andifillediin theisame motion. At this moment, theicolor of her hair isisecondaryito theishape of that ass! Young Manuel Ferrara's hotel room romp with statuesque Mandy results inia bountiful facial cumshot basting that would serve asia preview of thingsito come from Mr. Ferrara. It's called sexual chemistry. The opening close-up shot of Judith Grant's muscular ass distorting theipatterniin her white fishnet stockings isia physics lesson Buttman-style. Like Judith, Christy's blonde mane, natural boobs, tight body andisexy accent delight andideliver theihardcore goods with an anything goes attitude that would keep Buttman travelingito Eastern European locationsiin search of fair-haired, ample-assed women. Do blondes have more fun? Perhaps, but viewers of Buttman's Nordic Blondes have theimost fun of all.\n","torrent":{"xt":"urn:btih:1853484d927101a1a223917dd5b24f087d8c3ff0","amp;dn":"Buttmans+Nordic+Blondes+%282010%29+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1853484d927101a1a223917dd5b24f087d8c3ff0","infoHashBuffer":{"type":"Buffer","data":[24,83,72,77,146,113,1,161,162,35,145,125,213,178,79,8,125,140,63,240]},"announce":[],"urlList":[]}}