{"title":"The Ed Show 1-2-13.mp4","uid":7982464,"size":187151861,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:1a1eab5fe0a2d6fb0bdeee70f49b01a2c87be9ef&amp;dn=The+Ed+Show+1-2-13.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"liberal42","files":1,"time":1357211908,"description":"The Ed Show; January 2, 2013.\n\nPresident Obama gets his deal, but with the debt ceiling battle on the horizon, how long does the victory last?\n\nOn the very first &quot;The Ed Show&quot; of 2013, Ed Schultz welcomed Rep. Debbie Wasserman Schultz (D-FL, Chair of the Democratic National Committee), to talk about where Democrats go from here.\n\nThen, Grover Nordquist's no-tax hike pledge is dead and it's the end of an era for conservatives.\n\nKaren Finney (MSNBC Political Analyst and former DNC Communications Director), and Michael Steele (former Chairman of the Republican National Committee and MSNBC Analyst), looked at a Republican Party in total disarray.\n\nNew Jersey Gov. Chris Christie, the keynote speaker at the Republican National Convention, utterly destroyed the Republican House majority on delaying disaster relief. Rep. Jerrold Nadler, (D-NY) responded to the Republican disgrace over Superstorm Sandy relief funds.\n\nSecretary of State Hillary Clinton was discharged from the hospital on (1/2/13), where she was treated for a blood clot related a concussion. But the far-right still thinks she's faking it. What's the evidence?\n\nAnd in the BIG Finish, President Obama refused to let gun control fall out of focus even as students at Sandy Hook Elementary begin their return to school. Sam Stein (Huffington Post political editor), updated The Ed Show on where Congress stands in their fight against the NRA.","torrent":{"xt":"urn:btih:1a1eab5fe0a2d6fb0bdeee70f49b01a2c87be9ef","amp;dn":"The+Ed+Show+1-2-13.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1a1eab5fe0a2d6fb0bdeee70f49b01a2c87be9ef","infoHashBuffer":{"type":"Buffer","data":[26,30,171,95,224,162,214,251,11,222,238,112,244,155,1,162,200,123,233,239]},"announce":[],"urlList":[]}}