{"title":"Darkwood Alpha 8.0","uid":15963520,"size":701787998,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:1ab2e47bad337e6aecdb328bbe5b39c746719194&amp;dn=Darkwood+Alpha+8.0&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":5,"uploader":"dauphong","files":1,"time":1475699926,"description":"PLEASE READ BEFORE BUYING:\r\nDarkwood is in Early Access right now. This means the game will have bugs (ranging from minor annoyances to not being able to run the game at all) and will change during development. Your savegames will be wiped on each update, which will happen about once a month. However it may happen that if we are in the middle of implementing a new chapter, or making a transition to a newer version of our game engine, these updates may be slower. If these things bother you and you'd rather just play the finished game, simply wait until the final release.\r\nPLEASE READ THE KNOWN ISSUES THREAD BEFORE BUYING\r\n\r\nDarkwood is a unforgiving, story-driven survival horror with a procedurally generated, open world. If you crave for a deep and rewarding experience with dense atmosphere, memorable characters, satisfying exploration, crafting and challenging combat, Darkwood will suck you in for days.\r\n\r\nThe fear of unknown is powerful. Your senses will be deceived by Darkwood's surreal terrors. No answer will be given to you for free, yet somewhere in the woods lies the truth, an explanation to what has happened in this godforsaken place","torrent":{"xt":"urn:btih:1ab2e47bad337e6aecdb328bbe5b39c746719194","amp;dn":"Darkwood+Alpha+8.0","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1ab2e47bad337e6aecdb328bbe5b39c746719194","infoHashBuffer":{"type":"Buffer","data":[26,178,228,123,173,51,126,106,236,219,50,139,190,91,57,199,70,113,145,148]},"announce":[],"urlList":[]}}