{"title":"SEGA - Boogerman: A Pick and Flick Adventure","uid":11803768,"size":6557447,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:1abcf4ceae8fe0fded32a298d3a0ecf7d3d340cd&amp;dn=SEGA+-+Boogerman%3A+A+Pick+and+Flick+Adventure&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"zxfghfg","files":1,"time":1428506523,"description":"Boogerman - A Pick and Flick Adventure\n\nIf you're sick and tired of all the blood-and-guts violence of most action games these days, then stick your nose into Boogerman: A Pick and Flick Adventure. While most superheroes rely on their extraordinary abilities and special talents, Boogerman is more conventional in using his overly powerful mucous and his penchant for flatulence in the fight against evil.\n\nA truly unique arcade game that takes the superhero concept and then cuts the cheese with it. You are Boogerman, savior of the world of gross, and you must battle your many enemies with an assortment of farts, belches, booger flicks, and so on.\n\nYou are Snotty Ragsdale: suave millionaire by day, unappreciated superhero by night. Your mission is to enter the bowels of the Earth to stop the evil Booger Meister from polluting the planet. The journey will take you through six worlds, each having multiple stages: Flatulent Swamps, The Pits, Boogerville, Mucous Mountains, Nasal Caverns and the mysterious Pus Palace.\n\nAs Boogerman, you can use your natural powers to defeat eighteen different enemies and four bosses on your way to confront Booger Meister himself","torrent":{"xt":"urn:btih:1abcf4ceae8fe0fded32a298d3a0ecf7d3d340cd","amp;dn":"SEGA+-+Boogerman%3A+A+Pick+and+Flick+Adventure","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1abcf4ceae8fe0fded32a298d3a0ecf7d3d340cd","infoHashBuffer":{"type":"Buffer","data":[26,188,244,206,174,143,224,253,237,50,162,152,211,160,236,247,211,211,64,205]},"announce":[],"urlList":[]}}