{"title":"A First Course in Mathematical Logic and Set Theory","uid":12915329,"size":13285291,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1bf797acb6c6d237a1c6b1cde1f605c68626e01f&amp;dn=A+First+Course+in+Mathematical+Logic+and+Set+Theory&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"TopShelfBook","files":3,"time":1449338602,"description":"A First Course in Mathematical Logic and Set Theory 1st Edition\r\n\r\n\r\nA mathematical introduction to the theory and applications of logic and set theory with an emphasis on writing proofs\r\n\r\nHighlighting the applications and notations of basic mathematical concepts within the framework of logic and set theory, A First Course in Mathematical Logic and Set Theory introduces how logic is used to prepare and structure proofs and solve more complex problems.\r\n\r\nThe book begins with propositional logic, including two-column proofs and truth table applications, followed by first-order logic, which provides the structure for writing mathematical proofs. Set theory is then introduced and serves as the basis for defining relations, functions, numbers, mathematical induction, ordinals, and cardinals. The book concludes with a primer on basic model theory with applications to abstract algebra. A First Course in Mathematical Logic and Set Theory also includes:\r\n\r\nSection exercises designed to show the interactions between topics and reinforce the presented ideas and concepts\r\nNumerous examples that illustrate theorems and employ basic concepts such as Euclid’s lemma, the Fibonacci sequence, and unique factorization\r\nCoverage of important theorems including the well-ordering theorem, completeness theorem, compactness theorem, as well as the theorems of Löwenheim–Skolem, Burali-Forti, Hartogs, Cantor–Schröder–Bernstein, and König\r\nAn excellent textbook for students studying the foundations of mathematics and mathematical proofs, A First Course in Mathematical Logic and Set Theory is also appropriate for readers preparing for careers in mathematics education or computer science. In addition, the book is ideal for introductory courses on mathematical logic and/or set theory and appropriate for upper-undergraduate transition courses with rigorous mathematical reasoning involving algebra, number theory, or analysis.\r\n\r\n**PLEASE SEED**","torrent":{"xt":"urn:btih:1bf797acb6c6d237a1c6b1cde1f605c68626e01f","amp;dn":"A+First+Course+in+Mathematical+Logic+and+Set+Theory","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1bf797acb6c6d237a1c6b1cde1f605c68626e01f","infoHashBuffer":{"type":"Buffer","data":[27,247,151,172,182,198,210,55,161,198,177,205,225,246,5,198,134,38,224,31]},"announce":[],"urlList":[]}}