{"title":"Lee Hayward - Blast Your Biceps","uid":8686202,"size":7992893,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1cd99a5bc0601725438873d5de60797402ed19d9&amp;dn=Lee+Hayward+-+Blast+Your+Biceps&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"acer47x","files":5,"time":1373808579,"description":" You see I've spent the last 20+ years in the Iron Game. I started working out back in 1990 and have done my fair share of &quot;trial &amp; error&quot; training along with reading everything under the sun with regards to building muscle.\n\nIn addition to that I've worked with several top level bodybuilders and powerlifters. I've also coached and gotten real world feedback through literally thousands of guys from all over the world via my Total Fitness Bodybuilding website www.LeeHayward.com.\n\nThrough all this I have finally &quot;cracked the code&quot; so to speak on effective arm specialization training. I personally took my skinny noodle thin arms and transformed them into a decent set of attention getting ripped muscular guns.\n\tLee Hayward 210 Pounds Of Solid Muscle &amp; Big Muscular Arms\n\nI want to help YOU achieve similar muscle gains in your own physique!\n\nNow granted I don't have the biggest arms in the world by any stretch of the imagination, and quite honestly I wouldn't want my arms to get THAT big. But non the less they are a hell of a lot bigger, stronger, and better looking now than what I started out with.\n\nAll this time my friends and training partners who have literally watched me transform my physique and bring up my arm development kept saying to me...\n\n    &quot;Lee this is awesome!\n    You've got to write program showing people how to do this...&quot; \n\nSo that's exactly what I've done. I literally charted out the very best of everything that I did, workout by workout, and outlined a complete step-by-step Mass Building Arm Specialization training system in my new book in plain, easy-to-understand language that anyone could follow.\n\nBlast Your Biceps Book \tThe book is called: Blast Your Biceps!\n&quot;How To Add 2 Inches Of Muscle To Your Arms\nIn Just 8 Weeks.&quot;\n\nI've learned the hard way that most guys with crappy genetics and skinny arms do exactly the WRONG things in their efforts to build muscle. I personally wasted years fumbling around in the gym before I figured this stuff out. And in my book I'll teach you the RIGHT things to do, things that will actually produce visible muscle growth that you will be able to see in the mirror in the matter weeks - NOT Months! ","torrent":{"xt":"urn:btih:1cd99a5bc0601725438873d5de60797402ed19d9","amp;dn":"Lee+Hayward+-+Blast+Your+Biceps","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1cd99a5bc0601725438873d5de60797402ed19d9","infoHashBuffer":{"type":"Buffer","data":[28,217,154,91,192,96,23,37,67,136,115,213,222,96,121,116,2,237,25,217]},"announce":[],"urlList":[]}}