{"title":"The Favorite Son - Tiffany L. Warren","uid":11740792,"size":1018055,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1d6034b850c4ebce4a3daa223c6c4752e9c94ad8&amp;dn=The+Favorite+Son+-+Tiffany+L.+Warren&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1425813134,"description":"Do family, faith--and fame--go together? In this captivating novel from award-winning author Tiffany L. Warren, two brothers reach for the stars, but are they prepared for a fall?. . .\n\nThey're handsome, smart, and musically gifted. Brothers Camden and Blaine Drake have put their talents together and founded a gospel group. The quieter one, Camden is the songwriter, while charismatic Blaine is the performer. At first, their Bishop father is against the idea--until Blaine, his favorite, wows the congregation with his performance at a church revival. Sure enough, once the bishop witnesses their effect on the crowd he wants them there every Sunday. But he may have set the stage for trouble. . .\n\nAs the group's popularity grows, so do the groupies--and promiscuous Blaine is more than happy to share his love. Gigs across the country, meetings with music execs, a chance to sign with a major label, and a sexy new band member bring new connections--and dangerous new temptations. Soon, a slew of rumors and a shocking betrayal threaten to destroy the group--and the brothers' relationship. But one event is going to rock their world forever. Do they have enough faith, forgiveness, and brotherly love left to find harmony once more?","torrent":{"xt":"urn:btih:1d6034b850c4ebce4a3daa223c6c4752e9c94ad8","amp;dn":"The+Favorite+Son+-+Tiffany+L.+Warren","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1d6034b850c4ebce4a3daa223c6c4752e9c94ad8","infoHashBuffer":{"type":"Buffer","data":[29,96,52,184,80,196,235,206,74,61,170,34,60,108,71,82,233,201,74,216]},"announce":[],"urlList":[]}}