{"title":"Pyrite - A Natural History of Fool's Gold - 1st Ed (2015) Gooner","uid":12650876,"size":23030560,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1ee0228f7921ac53213e0763300523b5c9006bbf&amp;dn=Pyrite+-+A+Natural+History+of+Fool%27s+Gold+-+1st+Ed+%282015%29+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GoonerTPB","files":1,"time":1446128033,"description":"Publisher: Oxford University Press; 1 edition (May 1, 2015)\r\nLanguage: English\r\nISBN-10: 0190203676\r\nISBN-13: 978-0190203672\r\n\r\nMost people have heard of pyrite, the brassy yellow mineral sometimes known as fool's gold. Pyrite behaves like stone and shines like metal, and its dual nature makes it a source of both metals and sulfur. Despite being the most common sulfide mineral on the earth's surface, pyrite's bright crystals have attracted the attention of many different cultures, and its nearly identical visual appearance to gold has led to tales of fraud, trickery, and claims of alchemy. Pyrite occupies a unique place in human history: it became an integral part of mining culture in America during the 19th century, and it has a presence in ancient Sumerian texts, Greek philosophy, and medieval poetry, becoming a symbol for anything overvalued. \r\n\r\nIn Pyrite, geochemist and author David Rickard blends basic science and historical narrative to describe the many unique ways pyrite is integral to our world. He explains the basic science of oxidation, showing us why the mineral looks like gold, and inspects death zones of present oceans where pyrite-related hydrogen sulfide destroys oxygen in the waters. Rickard analyzes pyrite's role in manufacturing sulfuric acid and discusses the significant appearance of the mineral in literature, history, and the development of societies. The mineral's influence extends from human evolution and culture, through science and industry, to our understanding of ancient, modern, and future earth environments. Energetic and accessible, Pyrite is the first book to show readers the history and science of a mineral that helped make the modern world","torrent":{"xt":"urn:btih:1ee0228f7921ac53213e0763300523b5c9006bbf","amp;dn":"Pyrite+-+A+Natural+History+of+Fool%27s+Gold+-+1st+Ed+%282015%29+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1ee0228f7921ac53213e0763300523b5c9006bbf","infoHashBuffer":{"type":"Buffer","data":[30,224,34,143,121,33,172,83,33,62,7,99,48,5,35,181,201,0,107,191]},"announce":[],"urlList":[]}}