{"title":"PSX - Active Sky X - HiFi Flightware","uid":4116605,"size":75638575,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:1f78510dd55a556c9f3c4a4cd6b0d86fd9316b5b&amp;dn=PSX+-+Active+Sky+X+-+HiFi+Flightware+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"eduwildvet","files":4,"time":1207342266,"description":"Active Sky X + serial\n\n\nActive Sky X is a complete re-design incorporating our experience over the past 5 years designing award-winning weather add-ons for FS. We brought the latest development technologies, a new approach to user interface design, and a robust architecture together in order to create the weather add-on we\\\\\\&amp;#039;ve always dreamed of.\n\nElegance, simplicity, realism, flexibility and intuitiveness. All were equally-important critical design requirements as we began development over 2 years ago. We wanted a system that had the power and technical fidelity of our previous products, but we wanted to make sure all that power was going to be easy to use for all types of users. We decided on a simple yet pleasing graphical approach to navigation and functional usage, and centered the design around a graphical mapping system. All the data you could possibly want is now brought to you in a very easy-to-understand visual format.\n\n\nThe new user interface design just scratches the surface. We designed the entire weather synthesis and processing system to work smarter and faster. Multi-threading and intelligent data synchronization was a must. This required a brand new weather server system and totally new client data access technologies. What it means to our users is increased coverage, quicker downloads and processing, and cool new features like the ability to access and playback historical weather data while remaining online!\n\nOf course, we realized this new product would need to take full advantage of the newest version of FS, Flight Simulator X. We quickly learned and adopted the new FSX weather system and API (SimConnect). For the first time ever, Active Sky would communicate directly with FS without the need for any other interfaces. This allowed us to create more efficient and flexible routines and manipulate the weather environment in brand new ways. We are now fully controlling all the important parameters that bring you beautiful and realistic weather depiction to your simulated flights.\n\nOne of the cool new things that this new technology allows us to do is realistically simulate hurricanes! Our servers actively collect actual live hurricane data and provide it for Active Sky X client access during normal weather update downloads, either live or historical. These hurricanes are then depicted on both the graphical mapping system and within the simulator.\n\nWe\\\\\\&amp;#039;re also able to dynamically generate weather stations and thus depict weather throughout your flight with more coverage and detail than ever before possible.\n\nX Gauge, included, is a brand new weather graphics and information display gauge that will bring the new graphical imagery direct to your cockpit. A simple X Gauge Installation Wizard is also included to apply this gauge automatically to your existing installed FSX aircraft.\n\nOf course the new features don\\\\\\&amp;#039;t stop there. How about high-fidelity wake turbulence simulation? Again using the new FSX and SimConnect technologies, we actively sample and simulate multiple wake trails within the local range of your aircraft. There can be dozens of active wake trails that slowly weaken, sink and drift over time until they dissipate. With active resolution of less than 10 feet (horizontal or vertical), you can realistically practice wake turbulence avoidance procedures. If you enter a wake trail, you\\\\\\&amp;#039;ll get a realistic rolling effect on your aircraft with an intensity that varies with the dissipated strength of the wake trail, your aircraft weight, and the generating aircraft\\\\\\&amp;#039;s weight and lift configuration. Wake turbulence simulation works for all AI or multiplayer aircraft (including your own!).\n\nWe\\\\\\&amp;#039;ve provided enhanced weather briefing features which, coupled with the graphical mapping system and weather reporting system, will give you a very comprehensive view of the weather you are likely to experience during your flight. We\\\\\\&amp;#039;ve also enhanced voice weather report playback for better realism in tuning and audio panel configurations. With Active Sky X you\\\\\\&amp;#039;ll be even more informed on the weather situation both before and during your flight.\n\nAll aspects of fundamental weather collection, synthesis and depiction have been improved to offer the best combination between realism and graphical appeal within Flight Simulator X. The skies will be more complex, challenging and beautiful than ever before.\n\nA new weather configuration system allows you to configure every possible parameter to achieve any kind of weather situation you desire. From simply loading a preset weather condition and applying it to your local area, to explicitly editing cloud and wind layers for specific stations, everything is provided in one easy to use screen.\n\nMany other features and improvements in weather simulation, reporting and control are included, as well as a comprehensive user guide and top-notch HiFi customer support.\n\nIn conclusion, Active Sky X represents the next step in high-fidelity weather simulation for Microsoft Flight Simulator. We appreciate the chance to show you a bit of what it offers!\n","torrent":{"xt":"urn:btih:1f78510dd55a556c9f3c4a4cd6b0d86fd9316b5b","amp;dn":"PSX+-+Active+Sky+X+-+HiFi+Flightware+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1f78510dd55a556c9f3c4a4cd6b0d86fd9316b5b","infoHashBuffer":{"type":"Buffer","data":[31,120,81,13,213,90,85,108,159,60,74,76,214,176,216,111,217,49,107,91]},"announce":[],"urlList":[]}}