{"title":"Various Artists - Plug It In! Turn It Up! Electric Blues 1939-20","uid":9572737,"size":276032432,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:1f949baa11740a750fe0e2ccce1e545b2b54ab2a&amp;dn=Various+Artists+-+Plug+It+In%21+Turn+It+Up%21+Electric+Blues+1939-20&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":-1,"time":1391653088,"description":"mp3 v0\n\nVarious Artists - Plug It In! Turn It Up! Electric Blues 1939-2005 - The Definitive Collection! Part 1: Beginnings 1939-1954 [2012]\n\nOriginal Release / Bear Family Records / BCD 16921 CP / CD\n\nAmazon Review:\n\n(3 CD-digipac with 160-page booklet) Blues historian and musicologist Bill Dahl from Chicago has produced the most comprehensive history of electric blues ever!\nWith nearly 300 tracks, BEAR FAMILY RECORDS is telling the story from the beginning into the new millennium. Every significant artist... every significant recording from the 1930s to the present day, including T-Bone Walker, Muddy Waters, Howlin' Wolf, George Thorogood, and Freddie, B.B. and Albert King, Jeff Beck, Fleetwood Mac, Charlie Musselwhite, Eric Clapton, and Stevie Ray Vaughan, and literally hundreds more! Cross-licensed from every record company to be truly comprehensive!\n\nIn the 1930s, the invention of Gibson's ES-150 - the first electric guitar - changed popular music forever. The first generation of blues pioneers\nplayed acoustic instruments, but with the invention of amplification, guitar and harmonica players could be heard over the piano, drums and horns. Music was revolutionized!\n\nThis is one of four 3-CD sets in elegant deluxe digipacs. All four sets combined add up to 12 generously full CDs plus more than 650 pages in four lavishly illustrated booklets, in which Bill Dahl writes authoritatively about the history of electric blues, and how it influenced rock music during the 1960s and beyond. Here's the complete story from jazz-inspired jump numbers in the late 1930s to hard-driving blues/rock from the States and Great Britain in the 1960s, '70s, and beyond. The journey closes with today's contemporary blues. This is it! Truly definitive! Done as only BEAR FAMILY can do it!\n\nReview by Stephen Thomas Erlewine (allmusic)\n\nBear Family's Electric Blues history Plug It In! Turn It Up! may not seem quite as ambitious as some of their projects, but that's only because it arrives in four volumes of three CDs, not a hulking 12-disc, 12X12 box complete with a hardcover book. Taken on its own terms, it is a pretty impressive chronicle of electrified blues from its infancy to its prime. Here in the first volume, the spotlight shines on its birth, opening up with a cut from Andy Kirk &amp; His Twelve Clouds of Joy, a 1939 side called &quot;Floyd's Guitar Blues&quot; featuring a solo by Floyd Smith, and running to 1954, when the jumping, hard-charged sound started to break into the big time. Wisely, Bear Family is happy to repeat artists -- there is no way to limit yourself to just one T-Bone Walker or Muddy Waters song, after all -- and they bend the rules ever so slightly, letting in sides by R&amp;B singers like Fats Domino and Ray Charles, artists who aren't always strictly classified as electric blues but certainly fit this wide definition. Roughly speaking, the first disc here is devoted to the swinging, jumping sounds of the '40s and '50s, with the second finding the rawer, nastier sounds starting to sneak in (Jackie Brenston's 'Rocket '88',&quot; Howlin' Wolf's &quot;How Many More Years,&quot; Elmore James' &quot;Dust My Broom,&quot; and Little Walter's &quot;Juke&quot; pop up here), and the third concluding with the rise of overdriven Chicago blues and boogie, with Jimmy Reed rubbing shoulders with Wynonie Harris. Perhaps there are some seminal sides from these 15 minutes -- almost certainly there are -- but this first volume of Plug It In! Turn It Up! tells its story expertly and, best of all, it sounds like a party as it does so.\n\nTrack Listing -\n\nDisc 1\n\n01 - Kirk, Andy and His Twelve Clouds of Joy - Floyd's Guitar Blues\n02 - Walker, T-Bone - Mean Old World - 1942\n03 - Tharpe, Sister Rosetta - Strange Things Happening Every Day\n04 - Johnny Moore's Three Blazers - Drifting Blues\n05 - Jordan, Louis and his Tympany Five - Ain't That Just Like a Woman\n06 - Crudup, Arthur 'Big Boy' - That's All Right\n07 - Hopkins, Lightnin' - Let Me Play with Your Poodle\n08 - Walker, T-Bone - Call It Stormy Monday (But Tuesday Is Just as Bad)\n09 - Williamson, Sonny Boy - Better Cut That Out\n10 - Big Bill (Broonzy) &amp; His Rythm Band - Ramblin' Bill\n11 - Waters, Muddy - I Can't Be Satisfied\n12 - Hooker, John Lee - Boogie Chillen\n13 - Crayton, Pee Wee - Blues After Hours\n14 - Brown, Clarence 'Gatemouth' - Mary Is Fine\n15 - McGhee, Stick and His Buddies - Drinkin' Wine Spo-Dee-O-Dee\n16 - Littlefield, Little Willie - Hit the Road\n17 - Witherspoon, Jimmy - Who's Been Jivin' You\n18 - Nighthawks, The (Robert Nighthawk) - Black Angel Blues (Sweet Black Angel)\n19 - Warren, Baby Boy - My Special Friend Blues\n20 - Fulson, Lowell - Every Day I Have the Blues (Lonely Heart Blues)\n21 - Carter, Goree and His Hepcats - Rock Awhile\n22 - Garlow, Clarence - Bon Ton Roula\n23 - Baby Face Leroy Trio - Rollin' and Tumblin' Part 1\n24 - Phillips, Gene with Jack McVea Orchestra - Slippin' and Slidin'\n25 - McCracklin, Jimmy - Rockin' All Day (aka Rockin' and Reelin')\n26 - Brown, Roy and His Mighty Mighty Men - Love Don't Love Nobody\n\nDisc 2\n\n01 - Rogers, Jimmy - That's All Right\n02 - Tampa Red - Midnight Boogie\n03 - Brown, Charles - Black Night\n04 - Gant, Cecil - Rock Little Baby\n05 - Johnson, Lonnie - Why Should I Cry_\n06 - Brenston, Jackie - Rocket '88'\n07 - Howlin' Wolf - How Many More Years_\n08 - Brown, James 'Wide Mouth' - Boogie Woogie Nighthawk\n09 - Dixon, Floyd - Baby Let's Go Down to the Woods\n10 - Nighthawk, Robert - Kansas City Blues\n11 - Williamson, Sonny Boy - Pontiac Blues\n12 - James, Elmore - Dust My Broom\n13 - Hooker, John Lee - I'm In The Mood\n14 - Walker, T-Bone - Cold Cold Feeling\n15 - Gilmore, Boyd - Ramblin' on My Mind\n16 - Blair, Sunny - Please Send My Bany Back\n17 - Domino, Fats - Trust in Me\n18 - Little Walter - Juke\n19 - Memphis Minnie - Me and My Chauffeur Blues\n20 - Boyd, Eddie - Five Long Years\n21 - Vinson, Eddie 'Cleanhead' - Lonesome Train\n22 - Thornton, Willie Mae 'Big Mama' - Hound Dog\n23 - Lewis, Pete 'Guitar' - Chocolate Pork Chop Man\n24 - King, B.B. - Woke up This Morning\n25 - Shines, Johnny - Evening Sun\n26 - Pryor, Snooky - Cryin' Shame\n\nDisc 3\n\n01 - Norris, Chuck - Messin' Up\n02 - King, B.B. - Please Love Me\n03 - Overbea, Danny - Forty Cups of Coffee\n04 - Brim, John - Ice Cream Man\n05 - Charles, Ray - Losing Hand\n06 - Louis, Joe Hill - Hydramatic Woman\n07 - Little Junior's Blue Flames - Feelin' Good\n08 - Milburn, Amos - One Scotch, One Bourbon, One Beer\n09 - Thomas, Rufus Jr. - Tiger Man\n10 - Little Walter - Blues With a Feeling\n11 - Jackson, Lil' Son - Piggly Wiggly\n12 - Turner, Joe - TV Mama\n13 - Guitar Slim - The Things That I Used to Do\n14 - Dupree, Champion Jack - Shim Sham Shimmy\n15 - Brown, Clarence 'Gatemouth' - Dirty Work at the Crossroad\n16 - Reed, Jimmy - You Don't Have to Go\n17 - Waters, Muddy - I'm Your Hoochie Coochie Man\n18 - Rogers, Jimmy - Sloppy Drunk\n19 - Harris, Wynonie - Shake That Thing\n20 - Lightfoot, Papa - Wine, Women, Whiskey\n21 - Hare, Pat - I'm Gonny Murder My Baby\n22 - Hutto, J.B. - Pet Cream Man\n23 - Fulson, Lowell - Reconsider Baby\n24 - Thomas, Lafayette - Don't Have to Worry\n25 - Ross, Dr. - The Boogie Disease","torrent":{"xt":"urn:btih:1f949baa11740a750fe0e2ccce1e545b2b54ab2a","amp;dn":"Various+Artists+-+Plug+It+In%21+Turn+It+Up%21+Electric+Blues+1939-20","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1f949baa11740a750fe0e2ccce1e545b2b54ab2a","infoHashBuffer":{"type":"Buffer","data":[31,148,155,170,17,116,10,117,15,224,226,204,206,30,84,91,43,84,171,42]},"announce":[],"urlList":[]}}