{"title":"Miracle Planet DVDrip [documentary]","uid":4392826,"size":3669401874,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:1fa13f15bf005ee430bf59d86f98eadbebfd97cd&amp;dn=Miracle+Planet+DVDrip+%5Bdocumentary%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"K1L0GR4m","files":-1,"time":1221277311,"description":" &lt;a href=&quot;http://ecx.images-amazon.com/images/I/51B6G6G2W3L._SS500_.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://ecx.images-amazon.com/images/I/51B6G6G2W3L._SS500_.jpg&lt;/a&gt;\n\n\nMiracle Planet is a five-part documentary series, co-produced by Japan's NHK and the National Film Board of Canada (NFB), narrated by Christopher Plummer, which tells the 4 billion year old story of how life has evolved from its humble beginnings to the diversity of living creatures today.\n\nFilmed around the world and based upon the most recent scientific findings, Miracle Planet combines location footage and interviews with leading scientists, along with computer animation, to depict the cataclysmic events that have shaped our planet and all of the life-forms within it.\n\nThe five episodes depict the evolution of life on Earth in perspective with our place in the universe - from the simplest microbes to the complexity and diversity that is found on the planet today. The entire 5-hour series Miracle Planet aired on Discovery Channel in Canada on April 22, 2005 as an Earth Day special. Music composed by Hironori Doi, orchestrated by Wataru Hokoyama.\nContents\n\nEpisodes\n\n(fifty minutes each)\n\nThe Violent Past\n\nThis episode chronicles the early stages of the earth's history, from formation to the mid-Precambrian. It discusses the beginning of life on earth, mentioning panspermia as a possible candidate. It then simulates a collision with an asteroid 500km wide, similar to those that formed the protoplanets.\n\nSnowball Earth\n\nThis episode mainly focuses on the two Snowball Earth events in the Mid-precambrian period, and the effect they had on life. It simulates a similar occurrence in the modern day.\n\nNew Frontiers\n\nThis episode follows our ancestors from the shallow saltwater seas to the freshwater rivers, then discusses the colonization of land. Mainly Devonian and Carboniferous.\n\nExtinction and Rebirth\n\nThis episode centres on the Permian to Tertiary periods, showing numerous extinctions, including the Siberian Traps event 200 mya and the K-T asteroid impact. It also shows the rise of life after each event.\n\nSurvival of the Fittest\n\nThis episode chronicles primates that would evolve to become humans and why we succeeded over Neanderthals.","torrent":{"xt":"urn:btih:1fa13f15bf005ee430bf59d86f98eadbebfd97cd","amp;dn":"Miracle+Planet+DVDrip+%5Bdocumentary%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1fa13f15bf005ee430bf59d86f98eadbebfd97cd","infoHashBuffer":{"type":"Buffer","data":[31,161,63,21,191,0,94,228,48,191,89,216,111,152,234,219,235,253,151,205]},"announce":[],"urlList":[]}}