{"title":"Yoga.Para.NiÃƒÂ±os.Macarena.Kojakovic","uid":5789053,"size":41528901,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:201f85675eac6a2d3d0e885c4845cb2142670588&amp;dn=Yoga.Para.Ni%C3%83%C2%B1os.Macarena.Kojakovic&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"furtaperas","files":-1,"time":1282767686,"description":"Los niÃƒÂ±os al igual que los adultos, viven en una sociedad que impone un ritmo de vida estresante. Esta presiÃƒÂ³n y competencia con que crecen, los hace convertirse en pequeÃƒÂ±os adultos, con horarios, rutinas y normas estructuradas. El yoga surge para ellos de la misma manera que para sus padres, como un espacio para recuperar la energÃƒÂ­a y relajarse. (Enviado por Sergio Tanhnuz) El yoga es una disciplina de origen indio que se relaciona con la naturaleza y el alma humana, trabaja a travÃƒÂ©s de un sistema de ejercicios fÃƒÂ­sicos, tÃƒÂ©cnicas de respiraciÃƒÂ³n y meditaciÃƒÂ³n que mejoran la salud, tonifican el cuerpo y llevan a la persona a un estado de equilibrio y armonÃƒÂ­a.\nEste libro, completamente ilustrado en colores enseÃƒÂ±a posturas y tÃƒÂ©cnicas de yoga que pueden ser aprendidas fÃƒÂ¡cilmente por los niÃƒÂ±os y sus padres.\n\nAcerca de la autora:\nMacarena Kojakovic (1977) es periodista de la Universidad Diego Portales desde 2001. Como tal ha realizado colaboraciones para el diario El Mercurio y para la empresa de diseÃƒÂ±o y publicidad Raya S.A. ReciÃƒÂ©n egresada comienza a practicar yoga con Gustavo Ponce en el Centro Yogashala y se especializa en su enseÃƒÂ±anza a travÃƒÂ©s de un curso para profesores en el mÃƒÂ©todo Dynamic. El aÃƒÂ±o 2002 viaja a Estados Unidos, donde asiste a clases de Historia del Arte en la UCSB (Santa BÃƒÂ¡rbara) y al curso de formaciÃƒÂ³n de profesores de yoga con Erich Schifmann. De vuelta en Chile, trabaja como instructora de yoga para niÃƒÂ±os en el centro de Sitaram, en Chicureo y en el taller de la librerÃƒÂ­a ?HabÃƒÂ­a una vez libros?. El aÃƒÂ±o 2005 viaja en India a la ciudad de Pune, a instruirse en la escuela del prestigioso maestro B.K.S. Iyengar.\n\nEl presente libro es su primera publicaciÃƒÂ³n.\nArgumentos de venta: Se trata de un manual de yoga para niÃƒÂ±os. Es libro didÃƒÂ¡ctico, con ilustraciones modernas y coloridas que permiten a los niÃƒÂ±os realizar 18 posturas bÃƒÂ¡sicas del yoga tradicional. Los textos estÃƒÂ¡n indicados paras ser leÃƒÂ­dos junto a los padres o por los mismos niÃƒÂ±os. Es un libro para compartir, con pequeÃƒÂ±os cuentos que introducen a los lectores a una historia o personaje relacionados con los ejercicios. \n","torrent":{"xt":"urn:btih:201f85675eac6a2d3d0e885c4845cb2142670588","amp;dn":"Yoga.Para.Ni%C3%83%C2%B1os.Macarena.Kojakovic","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"201f85675eac6a2d3d0e885c4845cb2142670588","infoHashBuffer":{"type":"Buffer","data":[32,31,133,103,94,172,106,45,61,14,136,92,72,69,203,33,66,103,5,136]},"announce":[],"urlList":[]}}