{"title":"The Energetic Tunnel - JD Fuentes","uid":8842876,"size":8043718,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:20d88dc4c0f08d620f3a696acc5f48013b73be74&amp;dn=The+Energetic+Tunnel+-+JD+Fuentes&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ZamKhan","files":-1,"time":1377292164,"description":"The Energetic Tunnel - JD Fuentes\n\n\nRadically Revamp the &quot;Energy&quot; Women Sense from You-- So They Feel Your Magnetism At a Distance Before You Talk to Them, and Then Feel Heat and Electricity Tingling and Crackling Inside Themselves... When They Finally Get to Hear Your Voice!\nQuite apart from a man's appearance, there's something about him that attracts or repels women-- even before he talks to them.\nWhy is this?\nIt's because women are sensitive to certain flows of information that men are not. (Women may not always interpret or use this information in logical or practical ways... but that's another matter.)\nWould you like to understand, guide, and drive these flows of information yourself?\nIf so, you'll enjoy putting The Energetic Tunnel to use.\n\nThe Energetic Tunnel is a new eight-part audio program designed to teach you how to consciously modulate your &quot;energy&quot;.\nDon't bother wondering what &quot;energy&quot; means or is-- just know, for now, that you're going to make it into an extremely powerful tool for attracting women.\nUsing The Energetic Tunnel, you'll be able to go out... adjust yourself... and see and feel women responding to you. Before you even talk to them. Before they are even aware you are there.\nTheir instincts will them that you are a very special man... that your energy is powerful.\nMagnetic.\nWorth having.\nYou will be broadcasting into their depths... you will see them shift and tremble like lilies... touched by your radiance.\nWithout you saying a word.\nAnd when you select the woman you want... and you do take the time to say a word... your words, your body, your presence will exude the sweet, delicious energy that women will naturally desire.","torrent":{"xt":"urn:btih:20d88dc4c0f08d620f3a696acc5f48013b73be74","amp;dn":"The+Energetic+Tunnel+-+JD+Fuentes","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"20d88dc4c0f08d620f3a696acc5f48013b73be74","infoHashBuffer":{"type":"Buffer","data":[32,216,141,196,192,240,141,98,15,58,105,106,204,95,72,1,59,115,190,116]},"announce":[],"urlList":[]}}