{"title":"Arrested Development and Philosophy Audio and Epub","uid":8246144,"size":220506023,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:223de4afa445e20d4f0b7147d3c3b610f4ad6782&amp;dn=Arrested+Development+and+Philosophy+Audio+and+Epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"hombrep","files":-1,"time":1363061900,"description":"Editorial Reviews\nFrom the Back Cover\nIs George Michael's crush on his cousin unnatural?\nIs it immoral for Lindsay to lie about stealing clothes to hide her job?\n\nIs Gob better off living his life in bad faith?\n\nWhat inferences can we draw from Tobias's double-entendres?\n\nAre the pictures really of bunkers or balls?\n\nThe Bluth family's faults, foibles, and character flaws are so excruciatingly familiar that we squirm in painful recognition of the outrageous impulses that we all have but would never act on. The Bluths seem utterly unaware of the gaping distance between their behavior and accepted social norms. Lurking behind this craziness are large moral and philosophical issues to be explored. From Plato to Aristotle, from Descartes to Marx, Arrested Development and Philosophy draws from great philosophical minds to shed new light on the show's key questions and captivating themes, including the nature of self-knowledge and happiness, business ethics and capitalist alienation, social class, the role of error in character development, and much more.\n\nTo learn more about the Blackwell Philosophy and Pop Culture series, visit www.andphilosophy.com\n\nAbout the Author\nKRISTOPHER G. PHILLIPS is a PhD candidate (ABD) in the Department of Philosophy at the University of Iowa.\nJ. JEREMY WISNEWSKI is an associate professor of philosophy at Hartwick College. He is the editor of Family Guy and Philosophy, The Office and Philosophy, and 30 Rock and Philosophy, and coeditor of X-Men and Philosophy and Twilight and Philosophy.\n\nWILLIAM IRWIN is a professor of philosophy at King's College. He originated the philosophy and popular culture genre of books as coeditor of the bestselling The Simpsons and Philosophy and has overseen recent titles including House and Philosophy, Alice in Wonderland and Philosophy, and Mad Men and Philosophy.\n\nProduct Details\nPaperback: 272 pages\nPublisher: Wiley; 1 edition (December 20, 2011)\nLanguage: English\nISBN-10: 047057559X\nISBN-13: 978-0470575598","torrent":{"xt":"urn:btih:223de4afa445e20d4f0b7147d3c3b610f4ad6782","amp;dn":"Arrested+Development+and+Philosophy+Audio+and+Epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"223de4afa445e20d4f0b7147d3c3b610f4ad6782","infoHashBuffer":{"type":"Buffer","data":[34,61,228,175,164,69,226,13,79,11,113,71,211,195,182,16,244,173,103,130]},"announce":[],"urlList":[]}}