{"title":"I Do It With the Lights On (2016).epub Gooner","uid":14981496,"size":14647624,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:22c5c9a5c58922ffee4c0992a7d22547150e2398&amp;dn=I+Do+It+With+the+Lights+On+%282016%29.epub+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GoonerTPB","files":1,"time":1466277388,"description":"I Do It With the Lights On - And 10 More Discoveries on the Road to a Blissfully Shame-Free Life (2016).epub Gooner\r\n\r\nPublisher: Ballantine Books (31 May 2016)\r\nLanguage: English\r\nISBN-10: 0399594507\r\nISBN-13: 978-0399594502\r\n\r\nFrom the star of TLC s &quot;My Big Fat Fabulous Life&quot; and the YouTube sensation A Fat Girl Dancing comes an empowering memoir about letting go of your limitations and living the life you deserve. Right now. \r\nWhitney Way Thore stands five feet two inches tall and weighs well over three hundred pounds, and she is totally, completely, and truly . . . happy. But she wasn't always the vivacious, confident woman you see on TV. Growing up as a dancer, Whitney felt the pressure to be thin, a desire that grew into an obsession as she got older. From developing an eating disorder as a teenager, to extreme weight gain in college, to her ongoing struggle with polycystic ovarian syndrome (PCOS), Whitney reveals her fight to overcome the darkest moments in her life. She holds nothing back, opening up about the depths of her depression as well as her resilience in the face of constant harassment and mistreatment. \r\n\r\nNow Whitney is on top of the world and taking no BS (Body Shame, of course). And she s sharing the steps she took to get there and the powerful message behind her successful No Body Shame campaign. She even reveals her favorite F word (it s probably not what you think), the thrill of doing it with the lights on, and the story behind the Fat Girl Dancing video that started it all. \r\n\r\nExuberant and utterly honest, &quot;I Do It with the Lights On&quot; is the inspiring story of how Whitney finally discovered her fabulousness when she stepped off the scale and into her life, embracing herself unconditionally body, heart, and soul","torrent":{"xt":"urn:btih:22c5c9a5c58922ffee4c0992a7d22547150e2398","amp;dn":"I+Do+It+With+the+Lights+On+%282016%29.epub+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"22c5c9a5c58922ffee4c0992a7d22547150e2398","infoHashBuffer":{"type":"Buffer","data":[34,197,201,165,197,137,34,255,238,76,9,146,167,210,37,71,21,14,35,152]},"announce":[],"urlList":[]}}