{"title":"Dokuro v1.2.6 Apk-XpoZ","uid":15600002,"size":54511555,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:23334d6b1de69f8d31f6a3583d000a5ddf42b474&amp;dn=Dokuro+v1.2.6+Apk-XpoZ&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"meXpoZ","files":4,"time":1471621853,"description":"Dokuro v1.2.6 Apk-XpoZ \r\n\r\n| Category: Action | | Requires : Android 2.3 and up | \r\n\r\n \r\n\r\nCan you spring the Princess from the castle? \r\n\r\n----------------------------\r\nWhat is in this version : \r\n----------------------------\r\n\r\n*Changed to hide advertising banners by default. \r\n*Fixed some small bugs. \r\n\r\n----------------------------\r\nGame Review: \r\n----------------------------\r\n\r\nArise, lowly skeleton, and rescue the Princess from the Dark Lord's castle! \r\nYou are a nameless skeleton in the Dark Lord's army. After a chance encounter with the Princess, who was abducted to become the dreaded Dark Lord's wife, you found yourself setting her free. Guide the Princess from the shadows in Skeleton Form, switching to Hero Form when it's time to mount a gallant offense! Can you spring the Princess from the castle? \r\n\r\n·The Game \r\nAid the Princess in her flight from the Dark Lord's castle, guarding her from traps and enemies as you strike an artful balance between both Skeleton and Hero Forms--each boasting a palette of unique abilities and traits. Can you safely guide your royal counterpart to the flower at the end of each area? Succeed, and the fairytale will further unfold! \r\n\r\nDeep gameplay and whimsical storytelling come together in a resplendent production you can pick up and play--as well as save and stop--anytime you please! Equal parts action and puzzle, a new kind of fairytale awaits you! \r\n\r\nThis application also supports tablets. You can change the key configuration from the Options Menu. \r\n\r\n·The Story \r\nOnce upon a time, the Princess of a faraway land ruled in tranquility--until she was kidnapped by the scheming Dark Lord.\r\n\r\nThe Dark Lord was bent on making the unwilling Princess his bride. Locking her away in his castle, he ordered a skeleton to keep a stern watch over his prize. The docile henchmen kept to his orders... at least at first. \r\n\r\n\r\n\r\nThe weeping beauty before the skeleton conjured strange feelings. Yes, he wanted to return the Princess to her former life, away from the Dark Lord's marital machinations! And so it was the lowly skeleton betrayed his master and set the Princess free. \r\n\r\nBut can the pair make it out of the castle in one piece? Our story begins... \r\n \r\n----------------------------\r\nMore At GooglePlay:-\r\n---------------------------- \nhttps://play.google.com/store/apps/details?id=jp.gungho.dokuro\r\n\r\nHigh Quality Movies in Ultra compressed size \r\n\r\n\r\nwithout loss in Quality. \r\n\r\n&amp;&amp;&amp; \r\n\r\nFull Android Games &amp; App. \r\n\r\n\r\nXpoZ.Torrent \r\n\r\nPlz seed Back &amp; keep alive this torrent. \r\n\r\nIf You Need Seeder any of My torrent, Let me Know. \r\n\r\nI'm always there for Seeding. \r\n\r\nAnd Also If You Liked My Torrent, Plsz Don't Forget to Left FeedBack and Comment. \r\n\r\nMore Uploads &amp; For FeedBack Me..... \r\n\r\n\r\nFollow Me At Google+..........:- https://plus.google.com/+XpoZTorrent","torrent":{"xt":"urn:btih:23334d6b1de69f8d31f6a3583d000a5ddf42b474","amp;dn":"Dokuro+v1.2.6+Apk-XpoZ","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"23334d6b1de69f8d31f6a3583d000a5ddf42b474","infoHashBuffer":{"type":"Buffer","data":[35,51,77,107,29,230,159,141,49,246,163,88,61,0,10,93,223,66,180,116]},"announce":[],"urlList":[]}}