{"title":"GoSexy - Face and body tune v3.0.0 APK (Android)","uid":14262910,"size":17669594,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:23450364d78a79faa50215755475672bd9b1147b&amp;dn=GoSexy+-+Face+and+body+tune+v3.0.0+APK+%28Android%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Pahly","files":1,"time":1460248936,"description":"Enhance your pictures and photos to look beautiful, skinny, slim, fit and taller on your beauty photos. GoSexy is an enhance booth for your portraits, selfies, facie and belfie. GoSexy has UNIQUE face tune and photo editing tools. You can alter the shape of your photo. You will have natural-looking and amazing results! GoSexy offers much more than classic photo filters.\r\n\r\nFeatures:\r\nGoTall - Look taller on your photos!\r\nGoSexy - Make impressive curves! Breast, hips augmentation. Boob and butt enhancer.\r\nGoFit - Make your body look fit! Slimming photo effect on belly, waist, arms and legs. Tummy tuck.\r\nGoLipsy - Make your lips plump and shiny! Have a great smile.\r\nGoNose - Lift your nose! Rhinoplasty - Nose job. For facial photography.\r\nGoCheek-Lift your cheekbones! Supermodel cheek bones. Makeup contouring.\r\nGoTan - Suntan effect on your photos! Get tanned!\r\nGoFx - Bonus filters.\r\nGoSexy is a selfie and facie editor to look amazing and beautiful. As a skinny app it photoshops photos to look slim, fit and perfect. Have Kardashians curves with one tap. Post beautiful photos on social networks. Look like a barbie on Instagram. Face tune or body tune on your photos. Impress your friends. Boost your confidence.\r\n\r\nGoSexy photo editor and portrait enhancer tools detailed explanation:\r\n\r\nGoTall for body\r\n\r\nLook taller on your photos. Increase your height and have longer legs on your photos. Look tall and lean with GoTall.\r\n\r\nGoSexy for body\r\n\r\nMake impressive Kardashians curves! Use GoSexy to have great bikini photos. Look great in a gorgeous night dress. Plastic surgery effect on your body. Make beauty photos. Retouch photos to see the difference without going to a plastic surgeon.\r\n\r\nGoFit for body\r\n\r\nMake your body look fit! Photoshop slimming photo effect on belly, waist, arms and legs. You can slim your body and have skinny photos. Body fitness and tummy tuck effect is easy with one tap.\r\n\r\nGoLipsy for selfies\r\n\r\nMake your lips plump and shiny! No more kissing the camera. Plump your lips to have thick, glossy lips. Retouch photos to have lip makeup and plastic surgery effect. Portrait enhancer tool.\r\n\r\nGoNose for selfies\r\n\r\nLift your nose. Nose narrowing and lifting is easy with GoNose. Retouch photos to have nose job, nose surgery effect. Face contouring makeup effect.\r\n\r\nGoCheek for face\r\n\r\nLift your cheekbones! Supermodels have high cheek bones that look amazing on photos.\r\n\r\nSelfie Cam and photo editor tools\r\n\r\nCrop, Rotate, Flip-Easily crop, rotate and flip your photos and selfies. Blur and edit photos.\r\n\r\nSocial\r\n\r\nShare your perfect photos and selfies to get likes.\r\n\r\nWhat's in this version : (Updated : Nov 30, 2015)\r\nWe have fixed an issue causing app to stop on Samsung S6, Samsung S6 Edge, Galaxy Note 5. Sorry for this everyone.\r\nOptimized for Android 5.0\r\nRequired Android O/S : 4.0+","torrent":{"xt":"urn:btih:23450364d78a79faa50215755475672bd9b1147b","amp;dn":"GoSexy+-+Face+and+body+tune+v3.0.0+APK+%28Android%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"23450364d78a79faa50215755475672bd9b1147b","infoHashBuffer":{"type":"Buffer","data":[35,69,3,100,215,138,121,250,165,2,21,117,84,117,103,43,217,177,20,123]},"announce":[],"urlList":[]}}