{"title":"College Cum Collectors (2015) WEBRip","uid":13519742,"size":2230108525,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:23ecdbf2792f582de6d20b4cbbcf349eeec0003e&amp;dn=College+Cum+Collectors+%282015%29+WEBRip+&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ImgSnaps","files":1,"time":1455347151,"description":"Screenshots:\r\n \nhttp://imgsnaps.com/image/GjK\r\n \nhttp://imgsnaps.com/image/GjW\r\n\r\nDescription\r\nJasmine Web, Cherry Stone, Chantelle Fox, Jools Brooke, Syren Sexton.\r\n\r\nBrunette teen slut Chantelle Fox is all hot and horny at college so bunks off lecture to go have some fun with a guy she met on the bus. This dirty girl soon has his big cock in her mouth as she gives a blowjob before getting her tight pussy slammed. Stunning young Asian girl Cherry Stone is picked up outside of college by a cheeky lad for some afternoon fun. Once she is back at her dorm she offers up a deep throat blowjob before pulling down her tight denim jeans so she can be fucked. Stunning ebony babe Jasmine Webb is one horny young college babe. This filthy slut has a row with her fuck buddy that has to be settled by giving her his big hard cock. She's soon on her knees blowing his fat dick and loving every minute of it. On her way home from college, petite porn slut Jools Brooke is feeling horny so invites a guy back to her dorm room. She can't wait to get a big cock to play with as she gives him a deep throat blowjob before getting her young wet cunt hard fucked. Syren Lee is one filthy young blonde college slut. She picks up a guy after her lecture for a bit of fun and gets way more than she bargained for. After sucking and wanking off his monster cock she gets a deep fuck in her young cunt and cum covered","torrent":{"xt":"urn:btih:23ecdbf2792f582de6d20b4cbbcf349eeec0003e","amp;dn":"College+Cum+Collectors+%282015%29+WEBRip+","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"23ecdbf2792f582de6d20b4cbbcf349eeec0003e","infoHashBuffer":{"type":"Buffer","data":[35,236,219,242,121,47,88,45,230,210,11,76,187,207,52,158,238,192,0,62]},"announce":[],"urlList":[]}}