{"title":"[PS3] The Awakened Fate Ultimatum","uid":11991680,"size":1745806662,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:2444df8d55e4ca51d1a76d3cff4bb04b07d39335&amp;dn=%5BPS3%5D+The+Awakened+Fate+Ultimatum&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"fuckface69","files":1,"time":1433530421,"description":" &lt;a href=&quot;http://www.nisamerica.com/games/awakened_fate_ultimatum/index.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.nisamerica.com/games/awakened_fate_ultimatum/index.html&lt;/a&gt;\n\n* Accessible Roque like appeal: Explorer randomly generated dungeons and wield the powers of angels and devils as you carefully plan your next move to avoid destruction.\n* Engrossing story: Follow the characters' adventures and guide them as they make hard choices with wide-ranging impact for the peoples of Earth and Celestial.\n* Unique game design: Enjoy the story of an RPG mixed with the gameplay of a rogue like wrapped in beautiful artwork not normally present in this genre. The gorgeous characters and world come to life through the art of Noise Ito and Airi Hori.\n* Languages: Enjoy in-game English text and English and original Japanese in-game voices.\n\nThe Awakened Fate Ultimatum is a story-driven rogue like RPG. Several years after a certain revolution came to pass, and the powerful Nathanael was defeated, the devils were still dominant in their constant war against the angels. Meanwhile, a certain Celestial was resorting to guerilla warfare to survive. The angels focused on researching a way to create a &quot;God&quot; to use as their ultimate weapon against the devils. After creating the &quot;Fate Awakening Crystal,&quot; which can turn a human into God, the angels awaited the day to find someone who would be compatible. Walking home from school in the human world, a boy is attacked and stabbed through the heart by a group of devils. As he lay dying, his life is saved by a mysterious girl. He wakes up in an unfamiliar location-Celestial. As if guided by the Fate Awakening Crystal implanted in his chest, he finds himself thrust into the middle of the war between angels and devils. He must harness his newly awakened powers, choose how to use them, and ultimately decide which of the two new girls in his life he will do anything to save.\n_______________________________________\n\nTO EXTRACT ARCHIVE USE LATEST WINRAR 5!","torrent":{"xt":"urn:btih:2444df8d55e4ca51d1a76d3cff4bb04b07d39335","amp;dn":"%5BPS3%5D+The+Awakened+Fate+Ultimatum","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2444df8d55e4ca51d1a76d3cff4bb04b07d39335","infoHashBuffer":{"type":"Buffer","data":[36,68,223,141,85,228,202,81,209,167,109,60,255,75,176,75,7,211,147,53]},"announce":[],"urlList":[]}}