{"title":"REH Video - Jazz Lines (Joe Pass) (Recyclebin32)","uid":8072830,"size":810741779,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:25113ed553898e0b965851efb99493a01aa4c63f&amp;dn=REH+Video+-+Jazz+Lines+%28Joe+Pass%29+%28Recyclebin32%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"RecycleBin32","files":2,"time":1359311932,"description":"In Jazz Lines Joe Pass discusses the scales and arpeggios he uses when improvising. Joe also demonstrates non-stop improvised lines for: major 7th, minor 7th, static and altered dominant 7th chord types plus a special section on turnarounds. Get insight into how Joe 'thinks' while improvising.\n\nThe DVD includes a booklet with all of the video examples transcribed on the treble clef - with absolutely no tablature. If you live off of tab then I wouldn't recommend this video, but if you can read music there is a wealth of information to study and learn from.\nJoe breaks everything down to its simplest form - major, minor, or dominant. He covers everything very quickly and then goes to the examples, which he gives plenty of. However, if you're hoping for some chord melody tips or counterpoint examples you'll be disappointed with this video - it covers exactly what the title says: Jazz LINES. He does speak a little bit in the beginning about how he views chords but he doesn't go beyond that.\nFor anyone looking to learn about playing jazz lines, improvising, or about Joe's lead style in general, this is a fantastic buy. If you can't read music but are interested in Joe's style and can learn visually without too much grief, I would recommend the video, but the ability to read will certainly help you to get as much from the material presented as possible.\nJoe Pass is one of the most influential and respected jazz guitarists in the world. He is know equally for his incredible single-line improvising as well as brilliant chordal playing.\n\nEnjoy!\nSeed.\n\n_Recyclebin32_","torrent":{"xt":"urn:btih:25113ed553898e0b965851efb99493a01aa4c63f","amp;dn":"REH+Video+-+Jazz+Lines+%28Joe+Pass%29+%28Recyclebin32%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"25113ed553898e0b965851efb99493a01aa4c63f","infoHashBuffer":{"type":"Buffer","data":[37,17,62,213,83,137,142,11,150,88,81,239,185,148,147,160,26,164,198,63]},"announce":[],"urlList":[]}}