{"title":"Blowfly discography","uid":5364600,"size":610712566,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:26e8f20002fd81f02509e365fd3e49b6c782ad16&amp;dn=Blowfly+discography&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"david630","files":108,"time":1266225569,"description":"Reid started off writing songs for artists including Betty Wright, Sam &amp; Dave, Gwen McCrae, and KC &amp; the Sunshine Band. He also recorded a few hits of his own in the '60s including &quot;Nobody But You Babe&quot; under his real name and a Blowfly song called &quot;Rap Dirty&quot; in 1965.[citation needed] Many hip hop fans consider &quot;Rap Dirty&quot; as the first rap song because in it he talks in rhyme, and it has rap (slang for talk) in the title.\n\nReid would write sexually explicit versions of hit songs for fun but only performed them for his friends at parties or in the studio. In 1971 he along with a band of studio musicians recorded a whole album of &quot;dirty&quot; songs under the name &quot;Blowfly&quot;. Back then, no record label would release profane material so he distributed the records himself on his own independent record label, Weird World.\n\nThe album, The Weird World of Blowfly, features Reid dressed as a low-rent supervillain on its cover. Reid created this alter ego to protect his career as a songwriter. Reid continued to perform in increasingly bizarre costumes as his Blowfly character. The albums were widely popular as &quot;party records&quot; in the '70s.\n\nMany of Blowfly's songs featured his style of talking in rhyme which can be considered a primitive form of rapping. After rap music hit the mainstream with Sugarhill Gang's &quot;Rapper's Delight&quot;, Reid recorded a profane version of &quot;Rap Dirty&quot; titled &quot;Blowfly's Rapp [sic]&quot;. The song was a hit and helped the album, Blowfly's Party, reach #26 on Billboard magazine's Black Albums chart and #82 on the Billboard Top 200 in 1980.[citation needed] &quot;Rapp Dirty&quot; was sampled by The Avalanches on the song &quot;Electricity&quot; from their 2000 album Since I Left You, and is among Blowfly's songs to have been sampled in numerous hip hop and electronic songs.\n\nBlowfly's profane style earned Reid legal trouble. He was sued by songwriter Stanley Adams, who was ASCAP president at the time, for spoofing &quot;What a Diff'rence a Day Makes&quot; as &quot;What a Difference a Lay Makes&quot;.","torrent":{"xt":"urn:btih:26e8f20002fd81f02509e365fd3e49b6c782ad16","amp;dn":"Blowfly+discography","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"26e8f20002fd81f02509e365fd3e49b6c782ad16","infoHashBuffer":{"type":"Buffer","data":[38,232,242,0,2,253,129,240,37,9,227,101,253,62,73,182,199,130,173,22]},"announce":[],"urlList":[]}}