{"title":"Uhl&amp;Ensign-GI Guinea Pigs(Pentagon experiments on US soldiers)(1","uid":4739452,"size":6432873,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:275d5e22f74d58238a65bbddb50cd58ee74c10c3&amp;dn=Uhl%26Ensign-GI+Guinea+Pigs%28Pentagon+experiments+on+US+soldiers%29%281&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":"red_gonzo","files":1,"time":1235482493,"description":"This is Michael Uhl's and Tod Ensign's shocking book GI Guinea Pigs - How the Pentagon Exposed Our Troops to Dangers More Deadly Than War - Agent Orange and Atomic Radiation (1980) which paints a shocking picture of how the U.S. military exposed thousands of its own men to toxic levels of radiation and herbicides. Two products of Pentagon research - atomic radiation and Agent Orange - have each claimed a generation of soldier guinea pigs. The atmospheric testing of nuclear devices went on from 1945 to 1961. During that period, U.S. soldiers were moved like pawns in and out of contaminated areas, ranging from the exotic Bikini Islands to the Nevada desert. Unfortunately, because radiation poisoning often takes years to manifest itself, the toll on GIs has only begun to be tallied. Unlike their counterparts from earlier wars, it has taken only a few years for the Vietnam veteran to tell the story of Agent Orange. When America entered the Vietnam war, atomic weapons weren't feasible. Instead, large areas of countryside - potential enemy hiding places - were devastated with powerful defoliants. From 1962 to 1971, five million acres were repeatedly doused with twenty million gallons of highly toxic herbicides, the most pervasive of which was nicknamed Agent Orange. Called patriots when they went to war, hundreds of thousands of American veterans have come home as the cancer fodder of the 1980s. From Los Alamos to Indochina, they have become toxic time bombs - neglected and maligned by the same authorities who sent them off to fight for humanity. U.S. servicemen who survived the terrors of war have come home only to die of radiation and chemically induced diseases. Their children have inherited crushing deformities and everybody is urgently seeking benefits for their families and financial aid to pay for astronomical medical bills. Theirs is a shocking and shameful story, revealed here for the first time in all its horrifying dimensions. GI Guinea Pigs will build a bridge between veterans of military destruction abroad and opponents of environmental destruction at home. 280 pages, many pictures. A must read for everyone.\n","torrent":{"xt":"urn:btih:275d5e22f74d58238a65bbddb50cd58ee74c10c3","amp;dn":"Uhl%26Ensign-GI+Guinea+Pigs%28Pentagon+experiments+on+US+soldiers%29%281","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"275d5e22f74d58238a65bbddb50cd58ee74c10c3","infoHashBuffer":{"type":"Buffer","data":[39,93,94,34,247,77,88,35,138,101,187,221,181,12,213,142,231,76,16,195]},"announce":[],"urlList":[]}}