{"title":"The Timbers - Lawless [2014][EAC/FLAC]","uid":10560893,"size":276692475,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:27bc6c7a24b0c90ea8d2e32e1550794cc8f526a3&amp;dn=The+Timbers+-+Lawless+%5B2014%5D%5BEAC%2FFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"dickspic","files":-1,"time":1405453585,"description":"FLAC / Lossless / Log 100%/ Cue\nLabel/Cat#: Feelgood Folk\nCountry: AUS\nYear: May 1 2014\nGenre: folk/rock\nFormat: CD,Album\n\n\n\n\n\nRock the Boat\nGallantry\nMean Streak\nWrong Company\nSailing My Way\nInvincible\nThings to Come\nDance\nNeed a Change\nSomething to Do\nFind Me in the Shallows\nShepherd of the Seas\n\n\n\nThe Timbers Have Always Been a hard working band. It Seems that every time you look at a gig guide, they're playing a show here, a festival there, starting an interstate tour and so on. The promotional side of things've Always Been well organized, too. Since Their first recording in 2011, so far the music has undergone a few changes, mainly necessitated by variations in line-up and instrumentation. What Has not altered, however it, is Their fondness for melody, memorable songs and energetic performances, and the mainly acoustic nature of Their music.However, the many admirers of The Timbers had no idea what Comparatively slim pickings when it comes to Recorded Music, Particularly in the current 'brassy' line-up. A few singles and EPs had no idea what to suffice until 2014 When finally, the full-length album 'Lawless' has-been unleashed. Maybe it's a little strange for a debut to Take This long, but if the band needed to wait until the planets aligned to make an impressive Correctly and professional recording, Then They have been more than vindicated With This release.So many aspects to consider. The first to mention though (and it's Stating the obvious to Those familiar with the band) Is that while the music would fit under the category of folk and acoustic, it is mostly loud, raucous and energetic! That's probably what defines The Timbers' sound to a large degree nowadays - and I think it's fair to say They do have sound Their Own. The energetic rhythms of songs like 'Rock The Boat', 'Need A Change' and 'Something To Do' are similarly distinctive but very much as songs, and the strong 4-way harmonies are an essential component of Also Most tracks.Having to collective of vocalists and songwriters in the form of Simon Basey, Ben Roberts, Joe Murphy and Kyle Vause Helps to diversify the sound, but the aforementioned commonalities of enthusiasm and a talent for melody keeps it all cohesive and highly entertaining. There is plenty of great interplay Between instruments, and the brass Certainly adds a whole different timbre (sorry) to the sound. In fact, I find the trumpet riffs on songs such as 'Gallantry' to be Among the Most persistent earworms of the album.In other examples of diversity, 'Mean Streak' has an arrangement That reminds me somewhat of a style in many places jugband , but with modern touches and definite originality, while 'Sailing My Way' is positively epic in terms of the intensity of its production and overall feel. The Addition of percussion and keyboards on various tracks Helps to fill out an Already full sound, as well. 'Shepherd Of The Seas' is listed as a bonus track Recorded separately as it was from the album per se, but it earns its place with its dramatic and somewhat rockier arrangement, and obviously important message.The studio does seem cramped To Have Their style to any noticeable degree. It has however it Given them the chance to use high production subtle tricks with regard to voice and instrument placement and the like, but always in the service of the music itself. The packaging Also has a distinctive design, and thankfully includes all the lyrics. Collectively, The Timbers have produced an album that Does not just withstand Repeated listenings, it insists on Practically them.\n","torrent":{"xt":"urn:btih:27bc6c7a24b0c90ea8d2e32e1550794cc8f526a3","amp;dn":"The+Timbers+-+Lawless+%5B2014%5D%5BEAC%2FFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"27bc6c7a24b0c90ea8d2e32e1550794cc8f526a3","infoHashBuffer":{"type":"Buffer","data":[39,188,108,122,36,176,201,14,168,210,227,46,21,80,121,76,200,245,38,163]},"announce":[],"urlList":[]}}