{"title":"Bill &amp; Gloria Gaither Christmas A Time For Joy 320cbr","uid":9387897,"size":175300473,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:280b8c9f48b5de04ce16cf76514ae6014e7930fc&amp;dn=Bill+%26amp%3B+Gloria+Gaither+Christmas+A+Time+For+Joy+320cbr&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"Big-Papi","files":-1,"time":1387830344,"description":"Source:  2001 CD\n \nBill &amp; Gloria Gaither and their Homecoming Friends - Christmas A Time For Joy 320cbr (Big Papi) 2001\n\nBy Richard R. Blake VINE VOICE\nWe don't usually listen to Christmas music in July; however, we are in the process of building a library of the Gaither Gospel series of Homecoming Concerts. &quot;Christmas - A Time for Joy&quot; arrived in today's mail. Once we looked over the songs included and the featured artists we decided to view the program this evening.\n\nFrom the very first strains of &quot;It's A Time For Joy&quot; featuring Karen Peck and New River we knew we were in for a memorable evening. The whole concert is packed with great music, lots of laughs, and words of inspiration. Impressive Christmas sets and family centered action shots add another dimension to the celebratory feeling to this seasonal concert.\n\nThe program features several popular groups including: The Martins, The Talley Trio, The Hoppers, The Easters, The Florida Boys, and the Bishops. My favorite group numbers were The Legacy Five singing &quot;Holy Is the Name&quot; and The Hayes Family singing &quot;Angels We Have Heard on High.&quot; A careful balance of Christian favorites and familiar secular seasonal songs insure this concert will be a family favorite for years to come.\n\nI especially enjoyed &quot;Mary Did You Know&quot; featuring Mark Lowry, Steven Hill's arrangement of &quot;Five Little Fingers&quot; for the younger children, and The Vocal Band's singing &quot;The King is Coming&quot; in tribute to the passing of Rex Nelon. &quot;Ordinary Baby&quot; sung by Amy Rouse was touching as well as watching and listening to Allison Duran Speer featured in a song she wrote as she directed the words to her husband in the first row of the audience.\n\nI'm sure &quot;Christmas is a Time for Joy&quot; will be incorporated into our family tradion.","torrent":{"xt":"urn:btih:280b8c9f48b5de04ce16cf76514ae6014e7930fc","amp;dn":"Bill+%26amp%3B+Gloria+Gaither+Christmas+A+Time+For+Joy+320cbr","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"280b8c9f48b5de04ce16cf76514ae6014e7930fc","infoHashBuffer":{"type":"Buffer","data":[40,11,140,159,72,181,222,4,206,22,207,118,81,74,230,1,78,121,48,252]},"announce":[],"urlList":[]}}