{"title":"Coast to Coast AM July 03, 2013 - FDA &amp; GMOs Triangular UFOs","uid":8672897,"size":56226014,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:28eaf579f52d6a1d43e71fd3fd1528db176b7068&amp;dn=Coast+to+Coast+AM+July+03%2C+2013+-+FDA+%26amp%3B+GMOs+Triangular+UFOs&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pyramid91","files":5,"time":1373531314,"description":"MP3 version wins!\nCourtesy of Coast to Coast Am's wonderful  &quot;Coast Insider&quot; service!\nShow description:\n\nDate:\n07-03-13\nHost:\nGeorge Noory\nGuests:\nJonathan  Emord,                   David  Marler\nIn the first half, attorney Jonathan Emord offered updates on FDA issues, Monsanto &amp; GMOs, and various controversies involving the Obama administration. In May, Senator Dick Durbin tried to amend the Food and Drug Administration Safety and Innovation Act to include sweeping new powers for the FDA to regulate supplement companies, and potentially reduce consumers' access to supplements. At least for the short term, opposition appears to be strong for Durbin's proposal, Emord reported. The Senator has been an advocate for regulation across the board, &quot;except when it comes to hammering the drug industry for its undue influence over the FDA,&quot; he noted, adding that pharmaceutical companies likely feel threatened by the supplement industry. At the same time, the FDA continues to approve drugs that may be unsafe such as Brisdelle, a menopause treatment, he remarked. \nEmord drafted the first GMO labeling bill to become law in the US, in the state of Connecticut. While he's pleased with this breakthrough, an amendment to the law pushes back the start of the food labeling, until at least four other states pass a similar bill. Monsanto is fighting against such efforts, calling it a first amendment violation. He also discussed the politicization of the IRS in targeting conservative groups, NSA surveillance, and the poor record of President Obama in fulfilling transparency and honesty in government. Emord announced he'll be hosting a new radio show on the Genesis Communication Network starting July 22nd. \n----------------------------------------------------\nIn the second half, independent UFO researcher David Marler talked about the phenomenon of triangular UFOs, dating as far back as the 1882, when &quot;two triangular appearances&quot; were spotted on the moon. One of the best of the more recent cases was a January 5th, 2000 sighting by various police officers in southern Illinois. One officer saw a silent elongated triangular object with large white lights make a flat turn, and disappear in a matter of seconds, and the craft was then observed by another officer in a different location. Some suggested that the craft was military as the sightings were near Scott AFB, but there were no reports of it taking off or landing there. Interestingly, a triangular aerial object seen in Alaska in 1936, was also suspected of being military in origin by witnesses, Marler noted.  \nIn Denmark, there was a wave of triangular UFO sightings reported in local newspapers during 1957-8, and in one sighting by multiple witnesses, objects were seen emerging from the craft. A well documented incident took place on January 6th, 1995 outside of Manchester Airport, when a wedge-shaped object just missed the right wing of a 737 jet that was coming in for a landing. Though the pilots both filed reports, the investigation never reached any conclusions, Marler detailed. The Tinley Park sightings were also noteworthy, where hundreds of eyewitnesses leaving a concert saw lights in a triangular arrangement. \nNews segment guests: Ryan Mauro, Dr. Peter Breggin\nWebsite(s):\n emord.com\nBook(s):\n Global Censorship of Health Information\n The Rise of Tyranny\n Triangular UFOs\n","torrent":{"xt":"urn:btih:28eaf579f52d6a1d43e71fd3fd1528db176b7068","amp;dn":"Coast+to+Coast+AM+July+03%2C+2013+-+FDA+%26amp%3B+GMOs+Triangular+UFOs","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"28eaf579f52d6a1d43e71fd3fd1528db176b7068","infoHashBuffer":{"type":"Buffer","data":[40,234,245,121,245,45,106,29,67,231,31,211,253,21,40,219,23,107,112,104]},"announce":[],"urlList":[]}}