{"title":"PixelPerfect video URLs in txt files - QG","uid":4933758,"size":16847,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:29d8a84ec10ee4a8e3775f9ffaf92225ac3b6d4d&amp;dn=PixelPerfect+video+URLs+in+txt+files+-+QG&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"QuietGeek","files":-1,"time":1244153342,"description":"Here are 2 plain text files containing URLs listed one per line for video files of the web-based show PixelPerfect:\npixelperfecthd.txt covers episodes 1-107\nPixelPerfect 2009 - Photoshop CS4.txt covers episodes 108-128\n\nPixelPerfect is a weekly series of half-hour web shows at Revision3.com on Adobe Photoshop/Illustrator techniques. It is hosted by the well-known digital graphic artist and teacher Bert Monroy. After being cancelled last year with 107 episodes under its belt, it found new sponsors at the end of 2008 and started up again with episode 108, just in time for the release of Adobe's CS4 version of the software. The most recent episode (128) came out May 31, 2009, and a new episode is planned for every Sunday or Monday for the foreseeable future.\n\nThere's nothing fancy about the show's production values but the visuals are solid. The neat thing about it is that you're in the hands of a Photoshop master - he knows and shares a lot of practical solutions to problems that artists face every day in the real world, from beginner to advanced level. The show's homepage is at\nhttp://revision3.com/pixelperfect\n\nAll episodes can be streamed at Revision3 (duh!) but they can also be downloaded directly from the Revision3 site (they redirect to very fast bitgravity servers) at various resolutions and video formats such as:\nQuicktime mov or mp4 HD/Large/Small\nWMV Large/small\nXvid Large/small\n\nFor those who still prefer the slower P2P route, one huge public torrent (17.7 GB) exists for the first 107 episodes [Thanks to RuudschMaHinda for the original up at &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/4501899&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/4501899&lt;/a&gt;\nEpisodes 108 onwards (will) have individual torrents. [For any of these, just search with keyword &quot;PixelPerfect&quot;, minus the quotes]\n\nThe files in the public torrents are of the highest quality Revision3 offers (Quicktime HD) - it's worthwhile considering the subject matter relies heavily on visuals. Of course, it is _much_ faster to download the video files directly and it's even easier if you have a great download manager like GetRight and a list of episode URLs.\n\nThis torrent was created for just such a purpose: it contains 2 text files that list all the URLs for direct dlds of episodes 001-107 and 108-128 of PixelPerfect. Just change the extension from txt to urls, drag-and-drop them to GetRight, and you're off to the races, i.e. downloading at high speed.\n\nBetter yet, if you dld some or all of the mov/mp4 files and would like to give back a little then it's easy to seed for those using torrents! Just place the video files in your usual torrent content download folder (do not rename or modify the files in any way) - for eps 1-107 use a sub-folder named PixelPerfect - and dld the torrent file. Your torrent client app will check the files (force a re-check if it doesn't) and see that they're complete, and next thing you know... you're seeding for all those poor bastards sucking at torrent mother's teet. Now you can be sure good karma is headed your way.\n\nFor more info on the show's host, check out:\nhttp://revision3.com/host/bert-monroy\nhttp://www.bertmonroy.com/\n\nPlease enjoy the show!\n- QuietGeek\n\nP.S. The 3rd text file contains the text you're reading here.\n","torrent":{"xt":"urn:btih:29d8a84ec10ee4a8e3775f9ffaf92225ac3b6d4d","amp;dn":"PixelPerfect+video+URLs+in+txt+files+-+QG","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"29d8a84ec10ee4a8e3775f9ffaf92225ac3b6d4d","infoHashBuffer":{"type":"Buffer","data":[41,216,168,78,193,14,228,168,227,119,95,159,250,249,34,37,172,59,109,77]},"announce":[],"urlList":[]}}