{"title":"(Re)Inventing the Internet - Critical Case Studies - PDF","uid":9677689,"size":796812,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2a30485094ecc4f0471568cefca14069068347c8&amp;dn=%28Re%29Inventing+the+Internet+-+Critical+Case+Studies+-+PDF&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"AtomTPB","files":1,"time":1393594947,"description":"Pages: 146 pages\nPublished: December 16, 2011\nLanguage: English\nISBN-10: 9460917321\nISBN-13: 978-9460917325\nFormat: PDF\n\nAlthough it has been in existence for over three decades, the Internet remains a contested technology. Its governance and role in civic life, education, and entertainment are all still openly disputed and debated. The issues include censorship and network control, privacy and surveillance, the political impact of activist blogging, peer to peer file sharing, the effects of video games on children, and many others. Media conglomerates, governments and users all contribute to shaping the forms and functions of the Internet as the limits and potentialities of the technologies are tested and extended. What is most surprising about the Internet is the proliferation of controversies and conflicts in which the creativity of ordinary users plays a central role. The title, (Re)Inventing the Internet, refers to this extraordinary flowering of agency in a society that tends to reduce its members to passive spectators. This collection presents a series of critical case studies that examine specific sites of change and contestation. These cover a range of phenomena including computer gaming cultures, online education, surveillance, and the mutual shaping of digital technologies and civic life.","torrent":{"xt":"urn:btih:2a30485094ecc4f0471568cefca14069068347c8","amp;dn":"%28Re%29Inventing+the+Internet+-+Critical+Case+Studies+-+PDF","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2a30485094ecc4f0471568cefca14069068347c8","infoHashBuffer":{"type":"Buffer","data":[42,48,72,80,148,236,196,240,71,21,104,206,252,161,64,105,6,131,71,200]},"announce":[],"urlList":[]}}