{"title":"Multiphase Polymer-Based Materials","uid":15446400,"size":53432180,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2a7b247a8fa841428c829b80a3b6ad25c18118b5&amp;dn=Multiphase+Polymer-Based+Materials&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1469890806,"description":"Multiphase Polymer-Based Materials - An Atlas of Phase Morphology at the Nano and Micro Scale - Charef Harrats (CRC, 2009).pdf\r\n\r\nDuring the past 10 years a large variety of new multiphase polymer-based materials have been studied from a morphological point of view. Simultaneously, huge progress has been achieved in microscopy. These circumstances underline the need for a reference that delineates the differences of various types of nanostructures in multiphase polymer-based materials. Multiphase Polymer-Based Materials: An Atlas of Phase Morphology at the Nano and Micro Scale presents up-to-date coverage of developments in this field in a practical and easy to use format.\r\n\r\nIllustrates Microscopic Tools for Phase Morphology Investigation\r\n\r\nThe author sifted through an encyclopedic amount of information to provide a selection of more than 550 microscopy pictures resulting from the observation of multiphase polymer-based materials. These illustrations include micro and nanopolymer blends, micro and nanocomposites, micro and nano phases in copolymers, thermosets, and thermoplastic blends that were intensively developed over the past decade. Each picture includes a detailed explanation of how to attain these materials, how the samples were prepared, and how the observations were conducted.\r\n\r\nA Practical Straightforward Approach to Microscopic Observation\r\n\r\nThe book examines the various microscopic tools employed for the investigation of the phase morphology, highlighting the advantages and disadvantages of each. It provides a practical, straightforward approach for dealing with the microscopic observation of phase morphology in multicomponent polymer blends and nanocomposites","torrent":{"xt":"urn:btih:2a7b247a8fa841428c829b80a3b6ad25c18118b5","amp;dn":"Multiphase+Polymer-Based+Materials","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2a7b247a8fa841428c829b80a3b6ad25c18118b5","infoHashBuffer":{"type":"Buffer","data":[42,123,36,122,143,168,65,66,140,130,155,128,163,182,173,37,193,129,24,181]},"announce":[],"urlList":[]}}