{"title":"Revolutionary Road","uid":4980604,"size":4636528640,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:2b45356a7c3ae413ce308f3f00c165a688192298&amp;dn=Revolutionary+Road&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"defter81","files":1,"time":1246284452,"description":"Revolutionary Road\n\nDirecciÃƒÂ³n:Sam Mendes\nPaÃƒÂ­s:USA y Reino Unido\nAÃƒÂ±o:2008\nDuraciÃƒÂ³n:119 min.\nGÃƒÂ©nero:Drama\nGuiÃƒÂ³n:Justin Haythe\nProducciÃƒÂ³n:Bobby Cohen. John Hart. Scott Rudin\nMÃƒÂºsica:Thomas Newman\nFotografÃƒÂ­a:Roger Deakins\nMontaje:Tariq Anwar\nVestuario:Albert Wolsky\nFecha Estreno:26-12-2008\nEstreno en EspaÃƒÂ±a:23-01-2009\nSalida en Alquiler:27-05-2009\n\n\nReparto:Leonardo DiCaprio (Frank Wheeler), Kate Winslet (April Wheeler), Michael Shannon (John Givings), Kathryn Hahn, David Harbour, Kathy Bates Helen Givings).\n\n\nSinopsis:\n\n&quot;Revolutionary Road&quot; es un incisivo retrato de un matrimonio norteamericano visto a travÃƒÂ©s de los ojos de Frank (Leonardo DiCaprio) y April Wheeler (Kate Winslet). El relato que hace Richard Yates de la NorteamÃƒÂ©rica de los aÃƒÂ±os 50 plantea una pregunta que ha venido repercutiendo desde entonces sobre las relaciones modernas: Ã‚Â¿pueden dos personas romper con la rutina sin romper entre ellos? Frank y April siempre se han considerado especiales, diferentes, preparados y deseando vivir sus vidas con arreglo a ideales mÃƒÂ¡s elevados. AsÃƒÂ­ que, en cuanto se mudan a su nueva casa en Revolutionary Road, declaran altivamente su independencia respecto de la inercia suburbana que les rodea y deciden no dejarse atrapar nunca por las restricciones sociales de su ÃƒÂ©poca. Sin embargo, pese a su encanto, belleza e irreverencia, los Wheeler descubren que se estÃƒÂ¡n convirtiendo exactamente en aquello que no esperaban: un buen hombre con un trabajo sin sentido que ha perdido el valor, un ama de casa infeliz que anhela un poco de satisfacciÃƒÂ³n y pasiÃƒÂ³n, una familia americana con sueÃƒÂ±os irrealizados, como otra cualquiera. Decidida a cambiar sus destinos, April trama un audaz plan para empezar de nuevo, para dejar atrÃƒÂ¡s las comodidades de Connecticut y lanzarse a la inmensidad de lo desconocido en ParÃƒÂ­s. Pero cuando el plan empieza a llevarse a cabo, los dos cÃƒÂ³nyuges son presionados al lÃƒÂ­mite: uno para escapar a toda costa, y el otro para salvar todo cuanto tienen, sin importar las consecuencias.\n","torrent":{"xt":"urn:btih:2b45356a7c3ae413ce308f3f00c165a688192298","amp;dn":"Revolutionary+Road","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2b45356a7c3ae413ce308f3f00c165a688192298","infoHashBuffer":{"type":"Buffer","data":[43,69,53,106,124,58,228,19,206,48,143,63,0,193,101,166,136,25,34,152]},"announce":[],"urlList":[]}}