{"title":"Deacon Blue - Homesick - (2002)[EAC-MP3@320KBPS]","uid":4179584,"size":110395896,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:2b572dda0bd8273cf41afa1b8111f2b13de5072b&amp;dn=Deacon+Blue+-+Homesick+-+%282002%29%5BEAC-MP3%40320KBPS%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"seanprince","files":21,"time":1210330674,"description":"Deacon Blue - Homesick - (2002)[EAC-MP3@320KBPS]\n\nTrack list\n\nDeaconblue - Homesick\n\n01.\tRae\t\t\t\t\t04:46\n02.\tOut There\t\t\t\t03:46\n03.\tThis Train Will Take You Anywhere\t04:48\n04.\tEverytime You Sleep\t\t\t04:06\n05.\tNow That You&amp;#039;re Here\t\t\t04:00\n06.\tSilverlake\t\t\t\t04:36\n07.\tA Is For Astronaut\t\t\t03:03\n08.\tBeautifully Still\t\t\t04:12\n09.\tHomesick\t\t\t\t04:14\n10.\tEven Higher Ground\t\t\t03:52\n11.\tI Am Born\t\t\t\t04:22\n\nBiography\n\nTaking their name from a Steely Dan song, Deacon Blue is one of the best unknown bands in Scotland. With the vocals of singer-songwriter Ricky Ross backed by jazz and soul-inspired melodies, the group recorded several British hits in the late-1980s. Their success, however, failed to carry over to American audiences. Frustrated by their inability to secure international popularity, the group disbanded in the summer of 1994. Although he launched a solo career, Ross had no greater success than he had as frontman for Deacon Blue. In May 1999, the group agreed to reunite for a series of concerts in Great Britain and Europe. Their first new album in five years, Walking Back Home, was released shortly afterwards. Formed in 1985, Deacon Blue performed their first concert as the opening act for The Waterboys&amp;#039; first show in England. The group continued to go through personnel changes with only Reed and drummer Dougie Vipond remaining from the original band. As of November 1999, Deacon Blue was rounded out by bassist Ewen Vernal, guitarist Graeme Kelling, keyboardist Jamis Prime and second vocalist Lorraine McIntosh.\n\nReview Amazon.co.uk \n\nNewly re-emerged (with the band&amp;#039;s original line-up intact) from a lengthy bout of self-imposed exile and with Ricky Ross&amp;#039; still ongoing solo career failing to grip the public&amp;#039;s imagination, Homesick is just the kind of record which Deacon Blue ought to have made in 1993--if only they&amp;#039;d had it in them at the time. The occasional chorus is a mite overplayed (the sunny Carl Wilson disposition of &quot;A Is For Astronaut&quot; fails to build on a promising start), but this is a record benefiting from sensible, well-conceived arrangements and the unshakeable belief that every album track ought to good enough to be a single. This aspiration is frequently realised--the lush, loungey &quot;Rae&quot; (imagine a quality Prefab Sprout / Burt Bacharach collaboration), the expression of faith in God on the gospel &quot;Out There&quot; and the soft-pop ballad &quot;Everytime You Sleep&quot; meriting special attention. They&amp;#039;ve left it late, but clearly it&amp;#039;s us not them who&amp;#039;ve got some catching up to do. --Kevin Maidment\n\nDescription\n\nGlaswegian guitar pop band Deacon Blue return with their first album for Papillon records. Frontman Ricky Ross has written all eleven tracks, including the single &amp;#039;Everytime You Sleep&amp;#039;.\n\nEnjoy.","torrent":{"xt":"urn:btih:2b572dda0bd8273cf41afa1b8111f2b13de5072b","amp;dn":"Deacon+Blue+-+Homesick+-+%282002%29%5BEAC-MP3%40320KBPS%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2b572dda0bd8273cf41afa1b8111f2b13de5072b","infoHashBuffer":{"type":"Buffer","data":[43,87,45,218,11,216,39,60,244,26,250,27,129,17,242,177,61,229,7,43]},"announce":[],"urlList":[]}}