{"title":"Conjunto Primavera - Miles de Voces (En Vivo) - Complete CD MP3","uid":4439425,"size":95382003,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:2c20b576beb5a4fbcc0bd176705bea001919fee2&amp;dn=Conjunto+Primavera+-+Miles+de+Voces+%28En+Vivo%29+-+Complete+CD+MP3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"TheLabMan","files":22,"time":1223741273,"description":"- PRIMAVERA -\n\n\n\n                          Miles de Voces (En Vivo)\n\n\n\n\n                                  Review\n\nRegrettably, many regional Mexican artists will go their entire careers without recording a live album. They know that radio stations are mainly interested in studio recordings, and their labels fear that only the artist's most hardcore fans will purchase a live album. But thankfully, the lack of a live album isn't a problem for Conjunto Primavera; Miles de Voces en Vivo documents their appearance at a Mexican Independence Day concert in Chihuahua, Mexico, on September 16, 2004. Primavera's set isn't strictly a play-the-hits show. The norteÃƒÆ’Ã‚Â±o/grupero/Latin pop outfit does perform some of its major hits, including &quot;Ave Cautiva,&quot; &quot;AdiÃƒÆ’Ã‚Â³s, AdiÃƒÆ’Ã‚Â³s Amor,&quot; and &quot;Hazme Olvidarla.&quot; But because Primavera's set was part of a Mexican Independence Day celebration, this CD is really about more than Conjunto Primavera -- it becomes a celebration of Mexican culture in general, and performances of Mexican standards like Gilberto Parra Paz's &quot;Que Dios Te Perdone&quot; and JosÃƒÆ’Ã‚Â© Alfredo JimÃƒÆ’Ã‚Â©nez's &quot;Ella&quot; are an excellent way for Primavera to enjoy September 16 (a day that celebrates Mexico's independence from Spanish rule just as July 4 celebrates U.S. independence from British rule). Some fans will be disappointed to learn that the ballad &quot;Perdoname Mi Amor&quot; -- a major hit for Primavera in 2002 -- isn't performed. As many hits as Primavera has had over the years, one doesn't expect Miles de Voces en Vivo to be all-inclusive -- but did &quot;Perdoname Mi Amor&quot; have to be omitted? Another complaint: the concert's date and location aren't listed in the credits; one has to dig around on the Internet to find that information. But all things considered, Miles de Voces en Vivo is a rewarding document of Primavera on-stage -- one that isn't recommended to casual listeners but will definitely please Primavera's sizable group of hardcore fans. ~ Alex Henderson, All Music Guide \n\n\n1.\tIntroduccion\n\n2.\tTe Quedaste Sola\n\n3.\tEl Pocker de Ases\n\n4.\tRenunciacion\n\n5.\tHazme Olvidarla\n\n6.\tNo le Ruegues\n\n7.\tAqui Borracho\n\n8.\tQue Dios Te Perdone\n\n9.\tAdios, Adios Amor\n\n10.\tSi Te Vuelvo a Ver\n\n11.\tTe Quiero con la Vida\n\n12.\tUna Vez Mas\n\n13.\tCumbia Francesa\n\n14.\tPa' que Son Pasiones\n\n15.\tVas a Dejarme\n\n16.\tAve Cautiva\n\n17.\tNo Prendas la Vela\n\n18.\tMe Nortie\n\n19.\tElla\n\n20.\tDonde Caigo\n\n21.\tNo Hay Nada Completo","torrent":{"xt":"urn:btih:2c20b576beb5a4fbcc0bd176705bea001919fee2","amp;dn":"Conjunto+Primavera+-+Miles+de+Voces+%28En+Vivo%29+-+Complete+CD+MP3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2c20b576beb5a4fbcc0bd176705bea001919fee2","infoHashBuffer":{"type":"Buffer","data":[44,32,181,118,190,181,164,251,204,11,209,118,112,91,234,0,25,25,254,226]},"announce":[],"urlList":[]}}