{"title":"Combat.Vietnam.4of6.Tank.Attack.XviD.MP3.avi","uid":4787066,"size":366690304,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:2c23095084f913bb8cc5ec2de3802678817283d1&amp;dn=Combat.Vietnam.4of6.Tank.Attack.XviD.MP3.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"d_jooser","files":1,"time":1237585374,"description":"Information\n------------------------------\n\nThis documentary is exceedingly good value for money. Although the picture and sound quality are varied (I'm sure some episodes were taken from magnetic masters), the content was surprisingly refreshing in a Vietnam documentary sense. That is, this documentary seemed to have been coupled together from Military newsreel archives from the actual Vietnam conflict (pre 69, I think), and was deviod of the usual retrospective look at the war. Listening to the voice-overs, the war was already won - by the US. Some fill-in sections (to keep each episode to the 30 minute mark) was in some cases filled with un-narrated segments, but rather than adding sound effects, they had someone on a synthesizer making a pretty corn-ball &quot;score&quot; (for lack of a more accurate term describing the embarassing sounds that accompanied the images in this case). Fortunately, these segments were pretty far between. From a military equipment perspective, I actually learnt a few things from it. For starters, they showed the Marines amphibous APC, one which had a brief shot in Coppola's &quot;Apocalypse Now&quot;, which I had previously thought was not hardware used in Vietnam. Definitely a worthy purchase for Vietnam era miliraty buffs.\n\n1) The Chopper War\nActual under fire footage from the first chopper war, a weapon for swift ground support firepower, a workhorse for supply wounded evacuation and much more.\n\n2) Air Power at the Khe Sanh\nMarines in battle, 6000 hold theior ground surrounded and under merciless non-stop enemy fire.\n\n3) Rivers, Sea and Air\nThe navy at war including river boat forces, seabees, big guns off-shore fire support and fighter aircraft carrier ops.\n\n4) Tank Attack\nHeroic story of the armored and their valiant role in a country of rugged terrain and steamy jungle.\n\n5) Jungle Warfare\nA war with no front lines featuring under-fire footage.\n\n6) Death on Dragon Mountain\nBrutal story of the &quot;Ivymen&quot; of The 4th Infantry Division in close-up furious combat, combining tank mobility, helicopters and the terror of artillery.\n","torrent":{"xt":"urn:btih:2c23095084f913bb8cc5ec2de3802678817283d1","amp;dn":"Combat.Vietnam.4of6.Tank.Attack.XviD.MP3.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2c23095084f913bb8cc5ec2de3802678817283d1","infoHashBuffer":{"type":"Buffer","data":[44,35,9,80,132,249,19,187,140,197,236,45,227,128,38,120,129,114,131,209]},"announce":[],"urlList":[]}}