{"title":"Hardtied----Tie My Tits Tight Please  Darling  Matt Williams Hi","uid":10431103,"size":2071979372,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:2d7ebc1d41dd0c7054950fbf8830848c0f3a9750&amp;dn=Hardtied%5C----Tie+My+Tits+Tight+Please++Darling++Matt+Williams+Hi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"merzedes","files":-1,"time":1403801704,"description":"\nTie My Tits Tight Please | Darling | Matt Williams \n\n \n\nJune 25, 2014\n\n \n\nHigh MP4 only.\n\n \n\nThey really don't get any better then Darling. Blessed with blonde hair, booming boobs and an ass flawless enough that religions could be founded on it, Darling is the perfect bondage package. Her spine is like rubber and can be pushed into positions that would break a normal human. She is what bondage wet dreams are made of. And she is all ours. Today we put this rope slut through her paces and give her what she so deeply craves.\n\n \n\nThe bondage starts out easily enough, we can do warmup while we slowly ramp up the pace to its brutal punishing conclusion. A simple wrist to hip tie is all it takes to render her arms completely useless. We have Darling bend over and expose that perfect ass before moving on to the strict breast bondage her tits demand. Rope cuts across those giant boobs and trap her nipples and a tight gag fills her mouth hole, causing her to drool uncontrollably all over herself. We manhandle her like the play toy that she is, bending her bound body into any position that pleases us. Her pussy responds, betraying her and her dark desires. We vibrate her to a series of earth shattering orgasms.\n\n \n\nWhat follows is a never-ending bondage orgy. Darling is shifted from position to position like a big breasted gumby doll. She is nipple clamped, caned and tied into a brutal back arch. An asshook is firmly wedged deep into that flawless butt. Twine pulls her fingers back into helpless claws. A wooden tongue trap keeps her mouth cranked open. We vibrate her again and again, and the relentless orgasms and strict ties send her spiraling deeply into sexual subspace. Darling's eyes glaze over in bliss.\n\n \n\nTime to drive this home. Darling is cranked up into the scorpion, a position most will never come close to but Darling handles with ease. Her freshly caned feet rest almost on her head. The asshook is still in her ass, her perfectly shaved pussy on full display. We rip out one last orgasm out of her and leave her languishing in the strict bondage, gasping and moaning. You are very welcome my dear. Come back anytime...  \n\n \n\nScreens\n &lt;a href=&quot;\nhttp://hardtied.com/hogtied/bondage/2014/06_25darling/Hardtied--Tie-My-Tits-Tight-Please.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://hardtied.com/hogtied/bondage/2014/06_25darling/Hardtied--Tie-My-Tits-Tight-Please.php&lt;/a&gt;\n\n \n\n14 000 down, but how much more to come ?? You decide ;) \n\n \n\nThe more you appreciate it, the more we want to do it. Can we get to 15k ??? \n\n \n\nWell, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)\n\n  \n\nAny Questions ?? Read our FAQ!!\n\n &lt;a href=&quot;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&lt;/a&gt;\n\n \n\nCheers  :-)  \n","torrent":{"xt":"urn:btih:2d7ebc1d41dd0c7054950fbf8830848c0f3a9750","amp;dn":"Hardtied%5C----Tie+My+Tits+Tight+Please++Darling++Matt+Williams+Hi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2d7ebc1d41dd0c7054950fbf8830848c0f3a9750","infoHashBuffer":{"type":"Buffer","data":[45,126,188,29,65,221,12,112,84,149,15,191,136,48,132,140,15,58,151,80]},"announce":[],"urlList":[]}}