{"title":"Flubber(1997)DVDRip.AC3(ENG)-DROCK","uid":6319992,"size":733259357,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:2ed27b8507e302e1fe08177efc924d1c56cc8790&amp;dn=Flubber%281997%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"drock232","files":-1,"time":1302917897,"description":"Although &quot;flub&quot; is defined as &quot;to make a mess of,&quot; the word &quot;flubber&quot; is a contraction from &quot;flying rubber.&quot; In this remake of the 1961 comedy-fantasy The Absent Minded Professor, Robin Williams takes on the role created by Fred MacMurray and later executed by Harry Anderson on television, while the 1961 film's Flubber with anti-gravity properties has now been digitally reincarnated as a translucent green, pulsating, bouncing blob that loves to dance the mambo. Absent-minded college professor Philip Brainard (Williams), employed at a near-bankrupt university, creates the formula for Flubber, yet he can't remember to show up for his own wedding to university-President Sara Jean Reynolds (Marcia Gay Harden). His rival, Wilson Croft (Christopher McDonald), plots to steal Sara and the Flubber from Brainard. Rich, corrupt businessman Chester Hoenicker (Raymond Barry) tries to force Brainard to pass his failing son Bennett (Wil Wheaton), but he soon takes an interest in Flubber after hearing about it from his flunkies (Clancy Brown, Ted Levine). After using Flubber to fly over clouds in his 1963 T-Bird, Brainard realizes Flubber can also improve the performance of the school's pathetic basketball team. Jodi Benson is the voice of Weebo, Brainard's talking, flying household robot, with a video display of Disney clips at odd moments. Many gags are embellishments from the 1961 film, with John Hughes (Home Alone) rewriting the original Bill Walsh screenplay (based on Samuel Taylor's short story, &quot;A Situation of Gravity&quot;). Though Walsh died in 1975, he received posthumous credit for this script. Filming began October 8,1996 in San Francisco.\n\nRipped with Handbrake.\n\nLength: 1 Hour 34 Minutes\n\nFile Type: MP4","torrent":{"xt":"urn:btih:2ed27b8507e302e1fe08177efc924d1c56cc8790","amp;dn":"Flubber%281997%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2ed27b8507e302e1fe08177efc924d1c56cc8790","infoHashBuffer":{"type":"Buffer","data":[46,210,123,133,7,227,2,225,254,8,23,126,252,146,77,28,86,204,135,144]},"announce":[],"urlList":[]}}