{"title":"Storm and Conquest: The Battle for the Indian Ocean, 1809","uid":9206392,"size":32905206,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2ee8f28e1b384832d40fdae8b8ab9a4e691c42c3&amp;dn=Storm+and+Conquest%3A+The+Battle+for+the+Indian+Ocean%2C+1809&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"prabhu_","files":2,"time":1384705179,"description":"Storm and Conquest: The Battle for the Indian Ocean, 1809\nby Stephen Taylor \n &lt;a href=&quot;\nhttp://www.ebook3000.com/upimg/allimg/131106/2017130.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.ebook3000.com/upimg/allimg/131106/2017130.jpg&lt;/a&gt;\n\nHistorians often ignore or underestimate the part played by maritime power in the creation, expansion, and defence of British India. But the British were always crucially depend'ent upon ships dispatched from the imperial metropolis to support and sustain their vulnerable positions on the sub continent. In particular before the dramatic collapse of the East India Company in 1857-58, an annual fleet of ships supplied the lifeblood of empire by conveying people, commodities, information, military stores, and much else between west and east.\n\nSo to lose any of the great 500- or 800-tonne East Indiamen - the super tankers of their day - was always a blow to the company's corporate self-confidence and its profits. Any such calamity was guaranteed to capture public attention, as was witnessed in 1805 when William Wordsworth's brother John went down with the ship he commanded, on the sandbanks of the Shambles off Weymouth.\n\nIn the 18th century, the East India Company's shipping performance was quite respectable by the standards of the time, with only 5% of its vessels failing to return home. But in any graph of annual ship losses there are two eye-catching spikes. Nine Indiamen were lost in 1779-80, and a shattering 15 in 1808-09 when the company's finances were already under severe wartime strain and it faced the prospect of losing its monopoly of trade with India. The negative effects on national morale were considerable.\n\nHaving previously cut his teeth on a study of the wrecking of the Indiaman Grosvenor on the coast of south-east Africa in 1782, Stephen Taylor now reconstructs the events surrounding the interlinked maritime catastrophes of 1808-09 when warfare, accident, and natural disaster combined to wreak havoc upon the East India fleet. Taylor takes us inside the British ships (they were British in every sense of that term, in spite of his anachronistic description of them as &quot;English&quot;) and introduces us to the unfortunate occupants, who, despite great differences of wealth and social status, shared the anxieties and terrors associated with lengthy confinement within the wooden walls of a storm- tossed ocean-going vessel.\n\nThe outcome is a triumph, a brilliant evocation of passages to and from India, built around Taylor's impressive ability to paint vivid pictures of shipboard life complete with intrigues, dramas, romances and tragedies. An extraordinary cast of (mostly doomed) characters float across the pages: Judge Sir Henry Gwillim, the cantankerous Welsh libertarian and upholder of Indian rights and liberties; the adulterous Lady Elizabeth Barlow, wife of the governor of Madras; and Captain Robert Corbet, the capricious and brutal commander of HMS Nereide. There are also the ranks of the unknown who were simply noted in their ship's journal as lost overboard or victims of disease.\n\nBut this is no straightforward voyage narrative. Taylor repeatedly shifts from the global to the local, and from the land to the sea, setting his tales of maritime disaster within a broader analysis of the struggle for maritime mastery being played out at the time between Britain and France. This sets up the second half of the book, which explores the British capture of Isle de France (Mauritius) in 1810. A landmark event, this was originally a debacle born out of naval over-confidence which only very fortuitously was turned into the victory that helped to secure British control of the Indian Ocean.\n\nEncouraged by the research programme of the National Maritime Museum, academic historians are currently exploring the economic, social and cultural interactions that occurred between British imperial and maritime activity, and Taylor's book flows along with this prevailing tide in empire studies. But, thankfully, this is no theory-laden contribution to the historiography of British imperialism. While it does contain some irritating slips of the pen - the consistent misspelling of the name of Britain's leading modern naval historian should have been avoided - on the whole this is that rarest of works: a ripping yarn founded on original research. Taylor's work is marked out by the fact that he has done his time in the archives, where he has discovered the materials that add authority and detail to his narrative. As a result, we can taste the salt, feel the damp, and smell the fear in a book that represents popular maritime history at its very best.\n &lt;a href=&quot;\nhttp://upload.wikimedia.org/wikipedia/commons/c/c6/Grand_Port_mg6971.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://upload.wikimedia.org/wikipedia/commons/c/c6/Grand_Port_mg6971.jpg&lt;/a&gt;\n\n &lt;a href=&quot;\nhttp://upload.wikimedia.org/wikipedia/commons/f/f3/Surrender_of_The_City_of_Madras_1746.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://upload.wikimedia.org/wikipedia/commons/f/f3/Surrender_of_The_City_of_Madras_1746.jpg&lt;/a&gt;\n\n\n`~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~`\n  SEED PLEASE , LET OTHERS GET IT TOO. \n `~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~`\t","torrent":{"xt":"urn:btih:2ee8f28e1b384832d40fdae8b8ab9a4e691c42c3","amp;dn":"Storm+and+Conquest%3A+The+Battle+for+the+Indian+Ocean%2C+1809","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2ee8f28e1b384832d40fdae8b8ab9a4e691c42c3","infoHashBuffer":{"type":"Buffer","data":[46,232,242,142,27,56,72,50,212,15,218,232,184,171,154,78,105,28,66,195]},"announce":[],"urlList":[]}}