{"title":"STAR TREK TOS REMASTERED 1ST PILOT","uid":7322751,"size":760466292,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:2f6fcd46efaede3f54ad2468542604502a10885f&amp;dn=STAR+TREK+TOS+REMASTERED+1ST+PILOT&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"reppirg","files":-1,"time":1338667417,"description":"Star Trek's pilot episode, &quot;The Cage,&quot; was completed between November 1964 and January 1965, and starred Jeffrey Hunter as Captain Christopher Pike, Majel Barrett as Number One, and Leonard Nimoy as Spock. After the pilot was rejected by NBC as being &quot;too cerebral&quot; (among other complaints), Jeffrey Hunter chose to withdraw from the role of Pike when creator Gene Roddenberry was asked to produce a second pilot episode (&quot;Where No Man Has Gone Before&quot;) of which an edited version of the same name aired in 1966.\n\n&quot;The Cage&quot; never aired during Star Trek's original run on NBC. It was presented by Roddenberry as a black-and-white workprint at various science fiction conventions over the years after Star Trek's cancellation but was not released on home video until 1986 when Paramount Home Video produced a &quot;restored&quot; release of &quot;The Cage&quot; (a combination of the original black-and-white footage and color portions of the Season 1 episode &quot;The Menagerie&quot;) complete with an introduction by Gene Roddenberry.\n\nThis is the 2009 remastered edition.\n\nPilot 1\t&quot;The Cage&quot;\tOctober 1988\tMay 2, 2009\n\t\nThe crew of the Enterprise follow a distress signal to the planet Talos IV, where Captain Pike is taken captive by a group of telepathic aliens. The events of this episode are revisited in the Season 1 episodes &quot;The Menagerie, Parts I and II.","torrent":{"xt":"urn:btih:2f6fcd46efaede3f54ad2468542604502a10885f","amp;dn":"STAR+TREK+TOS+REMASTERED+1ST+PILOT","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2f6fcd46efaede3f54ad2468542604502a10885f","infoHashBuffer":{"type":"Buffer","data":[47,111,205,70,239,174,222,63,84,173,36,104,84,38,4,80,42,16,136,95]},"announce":[],"urlList":[]}}