{"title":"Marnie Stern - The Chronicles of Marnia (2013) [FLAC]","uid":8283769,"size":232954292,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:2f75446cc3978d837027a5d5c9cc53841b8f21d2&amp;dn=Marnie+Stern+-+The+Chronicles+of+Marnia+%282013%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"politux","files":-1,"time":1363897784,"description":"\n  Marnie Stern - The Chronicles of Marnia (2013) [FLAC]\n\n  Released: 2013\n  Duration: 32:51\n  Genre: Pop/Rock\n  Style: Indie, Noise Rock\n  Source: WEB\n  Codec: FLAC\n  Bit Rate: ~ 950 kbps\n  Bits Per Sample: 16\n  Sample Rate: 44,100 Hz\n\n  01 Year of the Glad \n  02 You Don't Turn Down \n  03 Noonan \n  04 Nothing Is Easy \n  05 Immortals \n  06 The Chronicles of Marnia \n  07 Still Moving \n  08 East Side Glory \n  09 Proof of Life \n  10 Hell Yes\n\n  Having established herself as one of indie rock's premier shredders, Marnie Stern returns with an emphasis on songcraft on her rhapsodic fourth album, The Chronicles of Marnia. While Stern still delights in plenty of the lightning-fast guitar heroics with which she's made a name for herself, the album feels like a more open and exploratory affair. Part of this can be attributed to a change in personnel, with Hella and Death Grips drummer Zach Hill being replaced by Oneida's Kid Millions, providing a looser, more fluid contrast to Hill's technical wizardry. With this less tightly wound rhythm section behind her, the songs here seem to open up into rousing rock &amp; roll mini-celebrations rather than musical endurance tests. This shift gives The Chronicles of Marnia a new dimension of accessibility without sacrificing too much of its complexity. Rather than feeling like Stern isn't putting in the effort, though, it's more fair to say that at this point she's not as concerned with trying so hard to impress us, instead floating from song to song with a breezy effortlessness that showcases a confident songwriter who isn't afraid to let the hooks do some of the heavy lifting this time around. That said, anyone expecting this to be yet another twisting sonic puzzle might be a little disappointed by the more direct approach here, but like Stern's other albums, The Chronicles of Marnia is an album that demands multiple journeys through the wardrobe, only this time it's to fully take in the album's melodic depths rather than to make sense of its technical achievements.","torrent":{"xt":"urn:btih:2f75446cc3978d837027a5d5c9cc53841b8f21d2","amp;dn":"Marnie+Stern+-+The+Chronicles+of+Marnia+%282013%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2f75446cc3978d837027a5d5c9cc53841b8f21d2","infoHashBuffer":{"type":"Buffer","data":[47,117,68,108,195,151,141,131,112,39,165,213,201,204,83,132,27,143,33,210]},"announce":[],"urlList":[]}}