{"title":"The Complete Aliens Omnibus - Volume 1","uid":13445240,"size":3965149,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2fac7d61d90e8f86885945f8b441252710e7c006&amp;dn=The+Complete+Aliens+Omnibus+-+Volume+1&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1454741390,"description":"Classic original fiction set in the Alien world, featuring Earth Hive by Steve Perry, Nightmare Asylum by Steve Perry and The Female War by Steve Perry and Stephani Perry.\r\n\r\nEarth Hive: \r\n\r\nWilks was a space marine with a near-fatal flaw:  he had a heart.  Billie was a child, the only survivor of a far-flung colony outpost.  Thrown together in the last hellish night of an alien invasion, Billie and Wilks helped each other get out alive.  Thirteen years later Wilks is in prison, and Billie lives in a mental institution, the nightmare memories of the massacre at Rim seared into her mind.  Now the government has tapped Wilks to lead an expedition to the aliens' home planet to bring back a live alien.  But the competition on Earth to develop the aliens as a new weapons system is brutal.  When Wilks's team departs on their mission, a trained assassin trails them.  And what follows is no less than guerrilla warfare on the aliens' planet--and alien conquest on Earth!\r\n\r\nNightmare Asylum:\r\n\r\nWilks, Billie, and Bueller were the last survivors of a devastating assault on the aliens' home planet.  But once their retum to the solar system made them refugees once more, fleeing Earth and its alien infestation in a desperate attempt to stay alive.  Now, in an otherwise unmanned military transport, they hurtle through space.  Destination: unknown.\r\n\r\nLittle do they know that the cargo they carry with them is a legacy of death that they will ultimately have to face. Nor do they know that they head toward a remote colony and military outpost.  This pocket of humanity at the very edges of space is at the mercy of a general names Spears with an agenda all his own.  Now Billie, Wilks, and Bueller face a new nightmare, and it is nothing they could ever have imagined: a gift of madness from an alien world, unbalanced mind, and the experiences of a mysterious pilot named Lieutenant Ellen Ripley.\r\n\r\nThe Female War:\r\n\r\nLieutenant Ellen Ripley awoke from her long journey in space with a hole in her memory and an overwhelming drive to survive.  When she meets Wilks and Billie, two battered veterans in the war against the alienss she realizes she's found two comrades in arms--and she's ready to take up the fight.  Only then does she discover the devastating secret that lurks behind her long sleep.  When she, Wilks, and Billie prepare to meet the aliens head-on to turn a powerful alien queen against her spawn in a battle intended to save Earth, that secret becomes her greatest weapon--and her greatest liability.  As the fate of Earth hangs in the balance, Ripley and Billie must come to terms with what it means to be an alien . . . and what it means to be human","torrent":{"xt":"urn:btih:2fac7d61d90e8f86885945f8b441252710e7c006","amp;dn":"The+Complete+Aliens+Omnibus+-+Volume+1","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2fac7d61d90e8f86885945f8b441252710e7c006","infoHashBuffer":{"type":"Buffer","data":[47,172,125,97,217,14,143,134,136,89,69,248,180,65,37,39,16,231,192,6]},"announce":[],"urlList":[]}}