{"title":"Anal Retentive 3 (Axel Braun Digital Sin) 2004","uid":14619265,"size":732497920,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:3001adac1832d187a89d5c4b47532e665567e1bb&amp;dn=Anal+Retentive+3+%28Axel+Braun+Digital+Sin%29+2004&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"distinc","files":1,"time":1463247891,"description":"...::ScreenShots::...\r\n \nhttp://imagedisco.net/?v=9310167091\r\n \nhttp://imagedisco.net/?g=5229041097\r\n\r\n\r\nPlot:\r\n\r\nThree is a charm! And what's even more charming is the butt-drilling bonanza of Axel Braun's third foray into the magical world of anal! Watch as a cast of five super-hot exotic sluts spread their ass-cheeks for some major sphincter intrusion. They're beautiful, they're horny, and they love it up the ass! What more can you ask for?\r\n\r\nThis release is the third installment in upcoming director Alex Braun's Anal Retentive series. Like many other series with the word anal in the title, its primary intent is to provide steamy anal sex. Fans looking to see some rather well dressed hotties remove their clothes and stick their asses out for violation should be very interested. There are a few good scenes and some decent ones. I found that I enjoyed the title, but not the technical aspects of the feature.\r\n\r\nSimilar to Anal Retentive #2, I felt that there were some pretty good scenes. In fact, I think that this title was a little better. However, like the previous installment, the technical aspects aren't very good. I was pretty disappointed with this, simply because it should have been better. Well, the title did have some really good content, but it's far my favorite. There's some decent action that should appease fans of anal sex.\r\n\r\nLucy Lee, Gia Jordan, Jayna Oso, Reina Leone, Jada Fire, Mr. Pete, Tony T, Ben English, Claudio Meloni","torrent":{"xt":"urn:btih:3001adac1832d187a89d5c4b47532e665567e1bb","amp;dn":"Anal+Retentive+3+%28Axel+Braun+Digital+Sin%29+2004","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3001adac1832d187a89d5c4b47532e665567e1bb","infoHashBuffer":{"type":"Buffer","data":[48,1,173,172,24,50,209,135,168,157,92,75,71,83,46,102,85,103,225,187]},"announce":[],"urlList":[]}}