{"title":"The Anthony Cumia Show 2015-05-19 Mike Ward MP4 MP3","uid":11950205,"size":298047875,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:30148e2fcebfb48d5059f88bceb81d7e650a35aa&amp;dn=The+Anthony+Cumia+Show+2015-05-19+Mike+Ward+MP4+MP3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mothergoose58","files":2,"time":1432144725,"description":"*** CAUTION: 100% UNCENSORED CONTENT!!! ***\n\n-NOT FOR VIEWING BY CHILDREN OR THE FAINT OF HEART-\n\nFresh off his &quot;separation&quot; from SiriusXM, Anthony Cumia, formerly of The Opie and Anthony Show launches his live, uncensored HD video webcast at AnthonyCumia.com Monday-Thursday 4pm-6pm EST. Current events, politics, news and anything can and will be discussed with celebrity guests and comedians stopping by as well. This show is not for those who are inclined to be &quot;politically correct&quot; and will contain boundary-pushing language and topics. Proceed with caution...\n\nGuest: Mike Ward\n\nEpisode 165 - Tuesday kicks off with sickly Anthony showing us a video of him singing with Band Geek on RiotCast, he tells us about the Mexicans in his yard, craziness when on-line life becomes reality, popularity breeding hate, and Taylor Swift makes a cameo. We take a look at Obama's new Twitter, discuss Periscope, see part of a terrible African video, talk about the upcoming Jacuzzi episode, the making of Michelle Knight's 'survivor song', see inner city school discipline, reminisce about the old days of school discipline, the dangers of DayQuil, and watch a dumb bitch get tasered. Ant moves to the poker table with Mike Ward to talk about Louis CK's SNL monologue, bootlegging, a special needs kid getting 86'd from their yearbook, the guys swap special needs kid stories, we see some #TBT pics of Ant, and they talk about the differences in schools between here and Canada. We hear about Brother Joe's first pot bust, Mike talks about pussy pops, they chat about old school porn, commonalities with old folks and kids, Dawnie the saint, taking care of old people, Ben Affleck's slavery past, cock pics in the 1800's, we watch a trailer for &quot;Laugh Killer Laugh&quot;, they talk about actors doing stand-up in movies, and wrap up pointing out cruelty by kids.\n\nIncludes an MP4 video file and an MP3 audio file; download both or only what you need and please seed!\n\nNew ups at: http://thepiratebay.se/user/mothergoose58/\n\nSubscribe at AnthonyCumia.com!!!","torrent":{"xt":"urn:btih:30148e2fcebfb48d5059f88bceb81d7e650a35aa","amp;dn":"The+Anthony+Cumia+Show+2015-05-19+Mike+Ward+MP4+MP3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"30148e2fcebfb48d5059f88bceb81d7e650a35aa","infoHashBuffer":{"type":"Buffer","data":[48,20,142,47,206,191,180,141,80,89,248,139,206,184,29,126,101,10,53,170]},"announce":[],"urlList":[]}}