{"title":"[Blues] Bobby Rush - Live at Ground Zero Blues Club - 2003 [DVD]","uid":11187066,"size":4214255146,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:302ff91ddf4916c89e8625e94da6b33302dd42d9&amp;dn=%5BBlues%5D+Bobby+Rush+-+Live+at+Ground+Zero+Blues+Club+-+2003+%5BDVD%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"altrahomine","files":-1,"time":1412939980,"description":"Bobby Rush - Live at Ground Zero Blues Club - 2003\n--------------------------------------------------\n\nBobby Rush, a fifty-year veteran of the blues &quot;chitlin' circuit&quot; performs a set at the Ground Zero Blues Club in Clarksdale, Mississippi. \n\n If you saw the &quot;Road To Memphis&quot; episode of the PBS &quot;Martin Scorsese Presents The Blues&quot; series you will most definitely remember the name Bobby Rush. His was the story of a guy who has been travelin' the &quot;Chitlin' Circuit&quot; of bars and blues clubs for many years. When this - his first ever - DVD was taped in 2003 at the Ground Zero Blues Club (co-owned by actor Morgan Freeman, who shows up in the last few minutes of the show) in Clarksdale, Mississippi, Rush was already past 65 years of age and had been performing for over 50 years! You'd never know he was that old when you watch is moves and watch him work the room. This guy is a Showman with a capital &quot;S&quot;!\n\nThe 74-minute show features Rush on vocals (except for one instrumental with Rush on harmonica) backed by a six-piece band. As is his trademark - which you'll remember from the PBS Blues show - he's also accompanied by four female &quot;dancers&quot; whose sole job is to shake their buns in a most rhythmic manner. Most songs actually give each woman a &quot;buns solo&quot;! The songs are of the &quot;soul blues&quot; variety and nearly all have a sexual connotation. But Rush does it with a sense of bawdy humor.\n\nThe camera work is top notch and the close-ups are sharp. The sound is fabulous too. Rush must rank up there with the late James Brown in the &quot;hardest working man in show business&quot; category.","torrent":{"xt":"urn:btih:302ff91ddf4916c89e8625e94da6b33302dd42d9","amp;dn":"%5BBlues%5D+Bobby+Rush+-+Live+at+Ground+Zero+Blues+Club+-+2003+%5BDVD%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"302ff91ddf4916c89e8625e94da6b33302dd42d9","infoHashBuffer":{"type":"Buffer","data":[48,47,249,29,223,73,22,200,158,134,37,233,77,166,179,51,2,221,66,217]},"announce":[],"urlList":[]}}