{"title":"LEGAL PORNO - Lucie Wild - Her First Anal Sex HUGE Titties 720p ","uid":9646715,"size":937161049,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:313eee39bfafdb1c2b02095ff479a8e025262d33&amp;dn=LEGAL+PORNO+-+Lucie+Wild+-+Her+First+Anal+Sex+HUGE+Titties+720p+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"beta2008x","files":1,"time":1393013007,"description":"\n &lt;a href=&quot;\nhttp://imgboxxx.com/viewer.php?file=9jpqj_liw.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgboxxx.com/viewer.php?file=9jpqj_liw.jpg&lt;/a&gt;\n  &lt;a href=&quot;\nhttp://imgboxxx.com/viewer.php?file=26gnx_lp_lucie_wild_720_s.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgboxxx.com/viewer.php?file=26gnx_lp_lucie_wild_720_s.jpg&lt;/a&gt;\n\n\n\nAs requested, Lucie Wild's first hardcore scene, from Legal Porno. Also note she should have a hardcore scene coming out soon with DDFBusty.\nA more detailed description:\nStarts off solo, with Lucie (seriously? Lucie?) stripping out of her tight little outfit, and leaving her tits hanging in the air like the smog in China. They're just about as thick, too. She moves onto oiling those tits up like she's about to throw them on the skillet, but quickly drops her panties and moves to some light titplay with a vibrator, followed by some self-fucking. After a brief break, we see her with a new glass toy, obviously meant for dat ass, and with the aid of some more lube, she's able to get it in. By this point, you should be accustomed to her half-hearted moaning, but that's solved by muting. She doesn't really put the toy in all the way, it's just a little loosening up. Great shot of her pussy, though, and she's definitely an innie.\nEnter &quot;Mark A.&quot;, who is apparently her boyfriend. He starts working the assplay for her. I'm assuming most of you have skipped ahead to this point of the video anyway, so here's where the hardcore action begins. After a blowjob that fails to inspire, they move directly to some reverse cowgirl, followed by more awkward moaning from both people involved. Seriously, I muted. Combined with the almost-queafs and lackluster performances, it was starting to kill my boner. Blowjob interlude, follwed by some traditional cowgirl. No close-ups, just a lot of side-view. Cue more blowjobbing, albeit from the side angle.\nAnd now for the part most people came to see: ANAL! WOO--....aww, shit, are you kidding me? It's just the tip. Sorry, ladies and gentlepervs, it really is. From here on out, it's a ton of just-the-tip anal, a few &quot;was that even in?&quot; moments, and a cumshot that has less volume than a broken hearing aid.\n\nOn the bright side, tits and some hardcore. On the downside, still seems a letdown, given the buildup to this.","torrent":{"xt":"urn:btih:313eee39bfafdb1c2b02095ff479a8e025262d33","amp;dn":"LEGAL+PORNO+-+Lucie+Wild+-+Her+First+Anal+Sex+HUGE+Titties+720p+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"313eee39bfafdb1c2b02095ff479a8e025262d33","infoHashBuffer":{"type":"Buffer","data":[49,62,238,57,191,175,219,28,43,2,9,95,244,121,168,224,37,38,45,51]},"announce":[],"urlList":[]}}