{"title":"Stories of John Cheeve","uid":9135736,"size":1341194073,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:31a30f84c71c4594b03ad9f47821cff17ec042bd&amp;dn=Stories+of+John+Cheeve&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Arazbr","files":30,"time":1383411121,"description":"Winner of the 1979 Pulitzer Prize for Fiction.\nTHE STORIES OF JOHN CHEEVER live in the community of emotions and dreams. The men and women are creatures of beauty, tragedy and restless privilege. And always they soar from the sadness of life to the older and more elegant realms of light, desire, memory, and love....\n\nWhen The Stories of John Cheever was originally published, it became an immediate national bestseller and won the Pulitzer Prize. In the years since, it has become a classic. Vintage Books is proud to reintroduce this magnificent collection.\n\nHere are sixty-one stories that chronicle the lives of what has been called &quot;the greatest generation.&quot; From the early wonder and disillusionment of city life in &quot;The Enormous Radio&quot; to the surprising discoveries and common mysteries of suburbia in &quot;The Housebreaker of Shady Hill&quot; and &quot;The Swimmer,&quot; Cheever tells us everything we need to know about &quot;the pain and sweetness of life.&quot;\n\nThink of John Cheever's fiction, and a whole world springs to mind--a world of leafy suburbs, summer houses, commuter trains, boarding schools, and inevitably, his own chosen territory, the cocktail hour among WASPs. But it's a mistake to approach Cheever as if he were merely some sort of anthropologist documenting the customs of an obscure and vanishing tribe. Nostalgia and class issues aside, his true subject is the darkness hidden beneath the surface of postwar American life. A case in point is his famous story &quot;The Swimmer,&quot; in which an ebullient Neddy Merrill decides to swim home across the backyard pools of his neighbors. In the course of his journey, however, summer gives way to autumn, his neighbors turn against him, there are troubling intimations of disgrace and financial ruin, and he arrives to find his house both locked and empty.\nThough these stories deal with bright, prosperous, ostensibly happy people, a cold wind blows through them. Age, illness, financial embarrassment, sex, alcohol, death--all of these threaten his suburban Eden. (Is it himself Cheever is mocking in his ironic &quot;The Worm in the Apple&quot;? &quot;Everyone in the community with wandering hands had given them both a try but they had been put off. What was the source of this constancy? Were they frightened? Were they prudish? Were they monogamous? What was at the bottom of this appearance of happiness?&quot;) Inanimate objects carry the residue of their past owners' unhappiness and cruelty (&quot;Seaside Houses,&quot; &quot;The Lowboy&quot;); expatriates long for but cannot quite find their way home (&quot;The Woman Without A Country,&quot; &quot;Boy in Rome&quot;); children vanish or turn out badly (too many stories to count).\n\nAll of this is conveyed in prose both graceful and tender. No one is better than Cheever at describing a character's appearance: &quot;He was a cheerful, heavy man with a round face that looked exactly like a pudding. Everyone was glad to see him, as one is glad to see, at the end of a meal, the appearance of a bland, fragrant, and nourishing dish made of fresh eggs, nutmeg, and country cream.&quot; Given his uncanny eye (and ear) for realistic description, it's easy to forget how experimental Cheever could be. His later stories pioneered authorial intrusions in the best postmodern style, and from the beginning, he wrote what would much later be called magical realism. (Think of the sinister broadcasts in &quot;The Enormous Radio,&quot; or the phantom love interest in &quot;The Chimera.&quot;) A literary event at its publication and winner of the Pulitzer Prize in 1979, The Stories of John Cheever remains a stunning and enormously influential book.","torrent":{"xt":"urn:btih:31a30f84c71c4594b03ad9f47821cff17ec042bd","amp;dn":"Stories+of+John+Cheeve","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"31a30f84c71c4594b03ad9f47821cff17ec042bd","infoHashBuffer":{"type":"Buffer","data":[49,163,15,132,199,28,69,148,176,58,217,244,120,33,207,241,126,192,66,189]},"announce":[],"urlList":[]}}