{"title":"Euro 2012 Highlights Match of the Day 19th June 2012","uid":7368056,"size":481800879,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:31f93f3c4fcdd1a1f65b231e5799fc61b1fbfccd&amp;dn=Euro+2012+Highlights+Match+of+the+Day+19th+June+2012&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"footy","files":2,"time":1340156828,"description":"Euro 2012 Highlights Match of the Day 19th June 2012\n\n\nGary Lineker introduces highlights from the day's two Euro 2012 games, which see England play Ukraine and Sweden meet France in the final round of Group D matches. Expert analysis comes from Alan Hansen, Alan Shearer and Lee Dixon.\n\nAfter sitting out the opening two matches through suspension, Wayne Rooney should be available to return for England in Donetsk. Roy Hodgson's side will have to be at their best against the tournament co-hosts, who beat the Three Lions towards the end of qualifying for the 2010 World Cup. England have never won the European Championship, while Ukraine are taking part in the tournament for the first time.\n\nThe day's other game sees the Swedes take on France in Kiev. Two-time European champions, the French last lifted the trophy in 2000. They endured a disappointing World Cup campaign in 2010, crashing out in the group stage. With talents such as Karim Benzema, Samir Nasri and Franck Ribery at their disposal, they will be expected to at least reach the quarter-finals this summer. However, Laurent Blanc's side will have to keep a close eye on Swedish danger man Zlatan Ibrahimovic, who struck 35 goals for AC Milan this season.","torrent":{"xt":"urn:btih:31f93f3c4fcdd1a1f65b231e5799fc61b1fbfccd","amp;dn":"Euro+2012+Highlights+Match+of+the+Day+19th+June+2012","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"31f93f3c4fcdd1a1f65b231e5799fc61b1fbfccd","infoHashBuffer":{"type":"Buffer","data":[49,249,63,60,79,205,209,161,246,91,35,30,87,153,252,97,177,251,252,205]},"announce":[],"urlList":[]}}