{"title":"Black Swan {2010} DVDrip - [Brittle]","uid":7222137,"size":394949260,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:33f63954f21041bb6b1f78d476155f9f7c602dff&amp;dn=Black+Swan+%7B2010%7D+DVDrip+-+%5BBrittle%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"xBrittle","files":-1,"time":1335555297,"description":"TITLE:     Black Swan\nYEAR:      2010\nGENRE:     Drama | Mystery | Thriller      \nRUNTiME:   1:48:06\niMDB RATE: Rating: 8.2/10 - 236,033 votes\niMDB URL: &lt;a href=&quot; http://www.imdb.com/title/tt0947798/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.imdb.com/title/tt0947798/&lt;/a&gt;\n\nFORMAT:    MKV\nLANGUAGE:  English       \nSUBS:      English\nSiZE:      376 MB\n\n\nRELEASE DATE: 27/04/2012\n\nABOUT:\nNina (Portman) is a ballerina in a New York City ballet company whose life, like all those in her profession, is completely consumed with dance. She lives with her obsessive former ballerina mother Erica (Hershey) who exerts a suffocating control over her. When artistic director Thomas Leroy (Cassel) decides to replace prima ballerina Beth MacIntyre (Ryder) for the opening production of their new season, Swan Lake, Nina is his first choice. But Nina has competition: a new dancer, Lily (Kunis), who impresses Leroy as well. Swan Lake requires a dancer who can play both the White Swan with innocence and grace, and the Black Swan, who represents guile and sensuality. Nina fits the White Swan role perfectly but Lily is the personification of the Black Swan. As the two young dancers expand their rivalry into a twisted friendship, Nina begins to get more in touch with her dark side - a recklessness that threatens to destroy her. Written by Fox Searchlight Pictures\n\nThomas Leroy, the artistic director of a New York City ballet company, is mounting Swan Lake as the company's next production. Many of the ballerinas in the company aspire for the lead, which would have previously gone to the company's former principle dancer Beth Macintyre before her forced retirement. No one wants the the role more than Nina Sayers, who lives to dance, so much so that she wants to be exactly like Beth in every aspect. Nina lives with her overbearing mother, Erica Sayers, a former ballerina who now lives vicariously through her daughter as she never made it as a ballerina herself. Nina is a technically proficient and hard working dancer who can easily capture the essence of the innocent white swan, but Thomas doesn't believe she has the dark passion required to portray the black swan. An unexpected move by Nina convinces Thomas that Nina may have what it takes, and he gives her the lead. Thomas will do anything to get that passion out of her. Nina feels that her new place in the company is threatened by Lily, a ballerina newly arrived into the company from San Francisco. Lily, who is looser in every aspect of her life than Nina, encompasses the essence of the black swan more so than Nina. But as Nina believes Lily is to her what she herself was to Beth, Nina, in doing whatever it takes to be perfect as both the white swan and the black swan, descends into madness. \n\nENJOY!!\nAND DO LET ME KNOW ANY OTHER DEMANDS!","torrent":{"xt":"urn:btih:33f63954f21041bb6b1f78d476155f9f7c602dff","amp;dn":"Black+Swan+%7B2010%7D+DVDrip+-+%5BBrittle%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"33f63954f21041bb6b1f78d476155f9f7c602dff","infoHashBuffer":{"type":"Buffer","data":[51,246,57,84,242,16,65,187,107,31,120,212,118,21,95,159,124,96,45,255]},"announce":[],"urlList":[]}}