{"title":"The Anthony Cumia Show 2015-03-23 MP4 MP3 combo","uid":11774337,"size":338406707,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:354c24d1f8c76f318eb88916606b263fb7f07d58&amp;dn=The+Anthony+Cumia+Show+2015-03-23+MP4+MP3+combo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"mothergoose58","files":2,"time":1427213164,"description":"[*] Note: More sound / encoding issues with the source vid. After encoding a file with pass-through audio (that was 320MB!) I decided to use just the right channel (the left drops out 1/3rd of the way through for some reason with AAC encoders) only and pan it to both L and R. Sounds fine to me and keeps the file size much lower.[*] \n\n*** CAUTION: 100% UNCENSORED CONTENT!!! ***\n\n-NOT FOR VIEWING BY CHILDREN OR THE FAINT OF HEART-\n\nFresh off his &quot;separation&quot; from SiriusXM, Anthony Cumia, formerly of The Opie and Anthony Show launches his live, uncensored HD video webcast at AnthonyCumia.com Monday-Thursday 4pm-6pm EST. Current events, politics, news and anything can and will be discussed with celebrity guests and comedians stopping by as well. This show is not for those who are inclined to be &quot;politically correct&quot; and will contain boundary-pushing language and topics. Proceed with caution...\n\nEpisode 132: &quot;The Rice Man Cometh&quot;. This TACS week starts by talking about the shenanigans that went down at the No Limits Tattoo Show and watching some video from the event, a vindicated Ant replays an old clip with Lewis Black from Opie and Anthony, we see a Funny or Die video called &quot;CrimAdvisor&quot;, and stay of the topic of guns by hearing from some callers. KtC turns us on to a questionable video of a home invasion, Ant discusses Starbucks big ol' fail with &quot;race together&quot;, talks about his friends of a different race, revisits his Twitter rumble with Azealia Banks, and goes through Monday's mail with a slight interruption. We learn about a fire at the Yakov Smirnoff Theatre in Branson, Ted Cruz's presidential bid, hear retired neurosurgeon Ben Carson's thoughts on gays, see an old beat down video, one of an old man standing up to a robber, find out from Geraldo that Scott Petersen is living a &quot;privileged&quot; life on death row, and Ant leaves us with a delicious news story he heard about a woman cutting a baby out of another woman's stomach.\n\n\nIncludes an MP4 video file and an MP3 audio file; download both or only what you need and please seed!\n\nNew ups at: http://thepiratebay.se/user/mothergoose58/\n\nSubscribe at AnthonyCumia.com!!!","torrent":{"xt":"urn:btih:354c24d1f8c76f318eb88916606b263fb7f07d58","amp;dn":"The+Anthony+Cumia+Show+2015-03-23+MP4+MP3+combo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"354c24d1f8c76f318eb88916606b263fb7f07d58","infoHashBuffer":{"type":"Buffer","data":[53,76,36,209,248,199,111,49,142,184,137,22,96,107,38,63,183,240,125,88]},"announce":[],"urlList":[]}}