{"title":"Savages episode 3 - Christians - Thank you Johnny Cash - Truth w","uid":4244606,"size":1731348480,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:359986ed7a09eadd0fa543bf0d8159db021f6407&amp;dn=Savages+episode+3+-+Christians+-+Thank+you+Johnny+Cash+-+Truth+w&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"raytras","files":1,"time":1213726413,"description":"These movies are not the best but it is a very extensive project, spanning many issues that are connected. So please give it some time and thought these are just the first cuts.\n\n\nThis is the third episode in our &quot;Savages the quest foor hegemony&quot; compilation of truths.\n\n\nThis is a companion piece to the &quot;Israel why do they hate us?&quot; epsiode, and the &quot;israel - AIPAC, women and other tales episode.\n\n\nAbout the christians that scare me. As christians we try to show how hypocritical the west really is and especially evangelical rightwingers and rightwing ........ sorry need to censor myself. \n\n\n\nChapters include:\n\n\n1 God fearing people\n\n2 Kids\n\n3 Racism\n\n4 Christian genocides (against others)\n\n5 Christian rightwing cinema\n\n6 Corporations (well one corporation as an introduction to our next episode)\n\n7 The christian killing machine ( short answers to the dutch racist movie Fitna)\n\nAgain peace and prayers from the Netherlands these christians are &quot;we thank god for that&quot; a minority but a powerfull minority that needs to be confronted.\n\n\nPlease help us to spread this series of compilations these are just the first cuts. \n\nThis compilatrion may contain copyrighted material. Such material is made available for educational purposes, to advance understanding of human rights, democracy, scientific, moral, ethical, and social justice issues, etc. This constitutes a fair use of any such copyrighted material as provided for in Title 17 U.S.C. section 107 of the US Copyright Law. This material is distributed without profit.","torrent":{"xt":"urn:btih:359986ed7a09eadd0fa543bf0d8159db021f6407","amp;dn":"Savages+episode+3+-+Christians+-+Thank+you+Johnny+Cash+-+Truth+w","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"359986ed7a09eadd0fa543bf0d8159db021f6407","infoHashBuffer":{"type":"Buffer","data":[53,153,134,237,122,9,234,221,15,165,67,191,13,129,89,219,2,31,100,7]},"announce":[],"urlList":[]}}