{"title":"The.Great.British.Bake.Off-S06E08-Patisserie-360p","uid":12480896,"size":353468409,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:35ae667b6ae3ea2ea598ee5ccea9af269e4c7b0e&amp;dn=The.Great.British.Bake.Off-S06E08-Patisserie-360p&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"uggauga","files":2,"time":1443047286,"description":"With subtitles - enjoy !!\r\n______________________________________\r\n\r\n\r\nPatisserie\r\nThe Great British Bake Off, Series 6 Episode 8 of 11\r\n\r\nNo series of Bake Off would be complete without testing the bakers on patisserie, and what better time to do it than the quarter finals? The five remaining bakers must work their way through childhood favourites and delicate french fancies to a mountainous choux pastry masterpiece.\r\n\r\nThey start with a brief to create 24 creams horns for the signature challenge. Creating two different flavoured cream horns isn't enough for one ambitious baker who also makes two different types of pastry, while another hopes to appeal to Paul's inner child by making a banana and custard filling.\r\n\r\nMary sets mokatines as the technical challenge, delicate squares of light genoise sponge filled with coffee buttercream and then decorated with two types of icing. It's a fiddly challenge, and Mary and Paul want perfection, but which of our bakers can create cakes worthy of their praise?\r\n\r\nIf ever there was a challenge to define the word show-stopper, then this episode's brief to create a religieuse a l'ancienne is it. Three tiers of choux pastry eclairs filled with creme patissiere, beautifully iced and decorated with buttercream, the religieuse is a marvel to behold, yet leaves the bakers in fear. Time and gravity are against them as they to try create something that looks and tastes amazing and, crucially, stays standing","torrent":{"xt":"urn:btih:35ae667b6ae3ea2ea598ee5ccea9af269e4c7b0e","amp;dn":"The.Great.British.Bake.Off-S06E08-Patisserie-360p","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"35ae667b6ae3ea2ea598ee5ccea9af269e4c7b0e","infoHashBuffer":{"type":"Buffer","data":[53,174,102,123,106,227,234,46,165,152,238,92,206,169,175,38,158,76,123,14]},"announce":[],"urlList":[]}}