{"title":"Addressing Racism: Facilitating Cultural Competence in Mental He","uid":8770687,"size":2270385,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:37369574af6315a4ecf4f9de95fe2f029dd5335a&amp;dn=Addressing+Racism%3A+Facilitating+Cultural+Competence+in+Mental+He&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"blackatk","files":-1,"time":1375404616,"description":"[img]http://image.bayimg.com/b056bcddc8ae7b33d9e747b6bd81c56c389a65b6.jpg[/img]\n\n\nPublication Date: April 14, 2006 | ISBN-10: 0471779970 | ISBN-13: 978-0471779971 | Edition: 1 | With A special thanks to &quot;wetworx12&quot; - The bitter, race-baiting troll who inspired this upload | filetype: pdf |\n\n[b]Learn to identify and combat unintentional and overt racism[/b]\n\nThis provocative book identifies and addresses racism in mental health and educational settings, providing proven strategies for overcoming this stubborn barrier to culturally competent practice. While addressing overt forms of racism, the book also explores and sensitizes practitioners to covert and unintentional forms of racism that may be equally detrimental in denying persons of color access to unbiased, high-quality education and mental health care.\n\nDespite the dismantling of overt racist policies, such as segregated schooling, and the implementation of policies aimed at remedying racial inequities, such as affirmative action, racism continues to persist in American society. Drs. Madonna Constantine and Derald Wing Sue, two of the leading researchers and advocates for multicultural competence, have collected sixteen thought-provoking and challenging chapters on the many ways that racism can affect a practitioner's interactions in mental health and school settings. These contributions collectively bring to the forefront highly charged issues that need to be discussed, but are too often hidden away.\n\nThe book is divided into four parts:\n\n What Do We Know about Racism?\n Racism in Mental Health Contexts\n Racism in Educational Settings\n Eradicating Racism: Future Directions\n\nFaced with the responsibility of understanding multiple oppressions and the intersections of racism with sexism, classism, and heterosexism, mental health practitioners and educators must be vigilant of their personal role in perpetuating racism. This collected work will help you identify forms of racism, both within yourself and the systems you work in, and then implement strategies to eliminate them.\n\n\n\nPaperback: 320 pages\nPublisher: Wiley; 1 edition (April 14, 2006)\nLanguage: English\nISBN-10: 0471779970\nISBN-13: 978-0471779971\n\n &lt;a href=&quot;\nhttp://www.amazon.com/Addressing-Racism-Facilitating-Competence-Educational/dp/0471779970/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Addressing-Racism-Facilitating-Competence-Educational/dp/0471779970/&lt;/a&gt;\n\n\n\n\nTags: race, racism, discrimination, black, african american, latin, latino, hispanic, usa, america, europe, minority, majority, mental, health, psychology, psychiatry, APA, medicine, hospital, care, quality of care, psychologist, psychiatrist, doctor, clinic, education, school, university, double standard, bias, medical testing, slavery, servitude, indentured servitude, bondage, diet, health, african, afro-american, african-american, AA, african american studies, health, medicine, medical , diaspora, disease, predisposition, predisposed, sick, wealth, education, institutional racism, \t","torrent":{"xt":"urn:btih:37369574af6315a4ecf4f9de95fe2f029dd5335a","amp;dn":"Addressing+Racism%3A+Facilitating+Cultural+Competence+in+Mental+He","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"37369574af6315a4ecf4f9de95fe2f029dd5335a","infoHashBuffer":{"type":"Buffer","data":[55,54,149,116,175,99,21,164,236,244,249,222,149,254,47,2,157,213,51,90]},"announce":[],"urlList":[]}}