{"title":"Particulate Composites - Fundamentals and Applications","uid":15407481,"size":14752449,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:392094d28e59ce5f8f9a7636ae18595965297ade&amp;dn=Particulate+Composites+-+Fundamentals+and+Applications&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1469523088,"description":"Particulate Composites - Fundamentals and Applications - Randall M. German (Springer, 2016).pdf\r\n\r\nThis book is focused on composites involving powders as the starting materials. It provides relevant information for questions related to the selection of constituent phases, most economic fabrication routes, proper testing procedures, and product optimization. The field is sufficiently advanced that predictive models guide many decisions. Applications are illustrated over a broad range of material and property combinations. This title includes:\r\n\r\n•Selection of phases with consideration of intersolubility &amp; interface\r\n\r\n•Microstructure, especially the role of phase connectivity\r\n\r\n•Fabrication approaches, especially net-shape consolidation\r\n\r\n•Assessment of typical properties, testing techniques &amp; industry standards\r\n\r\n•Design &amp; trade-off decisions involved in optimization, including cost\r\n\r\n•Applications, both those that have matured and some emerging prospects.\r\n\r\nThe reader may have little appreciation for how particulate composites are literally everywhere. Examples include new wear resistant consumer products(Apple watch), longer lasting automotive tires with reduced rolling resistance(Yokohama tires), and new diamond heat sinks for computers(Element Six substrates). Particulate composites also form critical components in applications such as magnets, dental fillings, brakes, darts, bio-implants, &amp; cutting tools. Particulate composites are a multi-billion dollar industry, and can be a cost-effective solution ripe for innovation and continued rapid growth. For the engineer, the wide range of particulate composite formulation and property combinations offers the ability to design for a variety of application and provides ample opportunity for innovation.\r\n\r\nParticulate Composites: Fundamentals &amp; Applications is ideal for use in a one-semester eng. course at the senior UG/graduate level, and is also suitable as a practical reference for materials scientists in academia and industry","torrent":{"xt":"urn:btih:392094d28e59ce5f8f9a7636ae18595965297ade","amp;dn":"Particulate+Composites+-+Fundamentals+and+Applications","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"392094d28e59ce5f8f9a7636ae18595965297ade","infoHashBuffer":{"type":"Buffer","data":[57,32,148,210,142,89,206,95,143,154,118,54,174,24,89,89,101,41,122,222]},"announce":[],"urlList":[]}}