{"title":"Constrained Clustering: Advances in Algorithms, Theory, and Appl","uid":4729725,"size":10900690,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:395854862360bbb15bfb5f3de954425cf5dff0d8&amp;dn=Constrained+Clustering%3A+Advances+in+Algorithms%2C+Theory%2C+and+Appl&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"VasiaZozulia","files":1,"time":1234952773,"description":"Since the initial work on constrained clustering, there have been numerous advances in methods, applications, and our understanding of the theoretical properties of constraints and constrained clustering algorithms. Bringing these developments together, Constrained Clustering: Advances in Algorithms, Theory, and Applications presents an extensive collection of the latest innovations in clustering data analysis methods that use background knowledge encoded as constraints.\n\nAlgorithms\n\nThe first five chapters of this volume investigate advances in the use of instance-level, pairwise constraints for partitional and hierarchical clustering. The book then explores other types of constraints for clustering, including cluster size balancing, minimum cluster size,and cluster-level relational constraints.\n\nTheory\n\nIt also describes variations of the traditional clustering under constraints problem as well as approximation algorithms with helpful performance guarantees.\n\nApplications\n\nThe book ends by applying clustering with constraints to relational data, privacy-preserving data publishing, and video surveillance data. It discusses an interactive visual clustering approach, a distance metric learning approach, existential constraints, and automatically generated constraints.\n\nWith contributions from industrial researchers and leading academic experts who pioneered the field, this volume delivers thorough coverage of the capabilities and limitations of constrained clustering methods as well as introduces new types of constraints and clustering algorithms.","torrent":{"xt":"urn:btih:395854862360bbb15bfb5f3de954425cf5dff0d8","amp;dn":"Constrained+Clustering%3A+Advances+in+Algorithms%2C+Theory%2C+and+Appl","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"395854862360bbb15bfb5f3de954425cf5dff0d8","infoHashBuffer":{"type":"Buffer","data":[57,88,84,134,35,96,187,177,91,251,95,61,233,84,66,92,245,223,240,216]},"announce":[],"urlList":[]}}