{"title":"The Lady in the Tower: The Fall of Anne Boleyn - Alison Weir","uid":6111871,"size":486699435,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:395f3185a752dd2f47e4a372802830b62775309f&amp;dn=The+Lady+in+the+Tower%3A+The+Fall+of+Anne+Boleyn+-+Alison+Weir&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":95,"time":1295384496,"description":"\nThe Lady in the Tower - The Fall of Anne Boleyn (Unabridged)\nAlison Weir\nRead by Judith Boyd\n15 Cds - Approx 16 hrs and 50 mins\n\nOne of Weir's hallmarks is her use of &quot;mini-biographies,&quot; diverging from her main storyline to give lifelines and personality traits of the characters. Rather like &quot;Windows&quot; on a computer: a Window is opened into another life, as it becomes relevant. There are judicious snapshots of the five men accused of adultery with Anne. George Boleyn (her own brother, Viscounnt Rochford), Sir Henry Norris, Sir Francis Weston, Sir William Brereton, Mark Smeaton. After filling in their background, Weir indicates how each was involved in some sort of illegality, or corruption, or had managed to arouse the jealousy of Thomas Cromwell, Henry's secretary, who orchestrated the trial against Anne.\n\nThroughout the book, Weir masterfully uncovers motivations, starting at the top with Henry VIII, Cromwell, and the leading contemporary churchmen. She identifies Henry's affair with Jane Seymour as a pivotal element used by Anne's enemies to topple her. Then she also investigates the ready disloyalty of Anne's own ladies-in-waiting.\n\nAs with all Anne Boleyn biographies we get the fineries of the trials, though mercifully the bloody details are kept to a minimum as this book is focusing on Anne. However Weir does adduce medical evidence to show, with terrible pathos, that a person may feel pain for several moments after execution.\n\nSome of the most riveting material follows Anne's beheading. In the last third of the book we learn the fates of such participants as Thomas Cromwell (executed a mere four years later), Thomas Wyatt, and Anne's sister-in-law Jane Boleyn (Lady Rochford), who provided damning testimony. Weir deals with the disposition of the estates of the executed men. The preparations for Henry's marriage to Jane Seymour and the erasing of Anne's name and initials on buildings, etc., are recounted. Even more fascinating are the longterm effects of her mother's execution on Queen Elizabeth I. She adopted Anne's motto (Semper Eadem - &quot;always the same&quot;) and falcon badge, and showed favour to the Boleyn relatives - notably the Careys, who became the Lords Hunsdon (later patrons of Shakespeare's company, The Lord Chamberlain's Men).\n\nFinal chapters chart the exhumation of Anne's headless body in Victorian times, its reburial, and the growth of Anne's reputation over the succeeding centuries. Similarly, the reputation of Henry vis-a-vis Anne is also examined. In her interesting Appendix, &quot;Legends,&quot; while refusing to be drawn on the subject of various ghostly hauntings, Weir asserts that Anne &quot;has become a figure of romantic mythology and a symbol of national folk-lore.&quot; Every year since the 1960s, for example, on the &quot;instructions of an undisclosed firm of Trustees,&quot; a bunch of red roses has been sent anonymously to the Tower and left till withered on her memorial.\n\nThis is a superb book in a very overcrowded field. You might think there is nothing new to say on this subject, but Weir forces you to think again. Skilfully done and a must for all fans of the Tudors.\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:395f3185a752dd2f47e4a372802830b62775309f","amp;dn":"The+Lady+in+the+Tower%3A+The+Fall+of+Anne+Boleyn+-+Alison+Weir","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"395f3185a752dd2f47e4a372802830b62775309f","infoHashBuffer":{"type":"Buffer","data":[57,95,49,133,167,82,221,47,71,228,163,114,128,40,48,182,39,117,48,159]},"announce":[],"urlList":[]}}