{"title":"[KSnF] Juuni Senshi Bakuretsu ETO Rangers - DVD-RIP - RAWS","uid":8653953,"size":7565029528,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:39b32ae9684de2d89e5390b7ca012936a8779bf2&amp;dn=%5BKSnF%5D+Juuni+Senshi+Bakuretsu+ETO+Rangers+-+DVD-RIP+-+RAWS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"4u9qspjrl","files":-1,"time":1373171249,"description":"All episodes from this anime from 1995 (1-39) DVD-RIP Quality/AVI 640x480\n\nSynopsis:\n\nThe Eto Rangers ride in Space-Time Transmitting Machine Kirinda to repair the Novel Worlds of Mugen. The Eto Rangers are anthropomorphic animals, each representing one of the 12 Chinese zodiac animals (and The Twelve Branches in Buddhism). In Japan they are known as the Eto animals. The Novel Worlds are stories created by the human imagination, such as old folk tales as well as newer books. These living worlds play out repeatedly, and are necessary for the good of humanity. Princess Aura rules Mugen, which is an island continent hanging over an ocean from the skybound Novel Pole. The Great God Goal gives her power, but she may never leave the small palace island area. Their nemesis is the forgotten Spirit of Cats, Nyanma, who was excluded from the choice of 12 protectors by being disqualified from the race (in actual legend there are many versions of this story). She seeks her revenge by distorting Novel Worlds with Jarei Monsters.\n\nWhen a Jarei Monster goes to a Novel World they alter the story, turning it into a different version, sometimes a parody of itself. Bakumaru, the Spirit of Mice, must use the Genmakyou mirror to reveal (&quot;Jarei Shouran!&quot;) the evil spirit once enough clues lead to its identity. Often the Eto Rangers must play out some of the story to find out who or what it is, sometimes even taking on the role of one of the characters in the tale. After defeating the creature, Kirinda is called when Bakumaru holds up his hand with one of Aura's 12 gems on it and calls out &quot;Daikourin Kirinda!&quot; Kirinda descends from a dimensional slit and purifies the evil spirit with a beam weapon, calling out &quot;Jouka!&quot; (Purification).\n\nMost of the episodes involve up to 5 Eto Rangers, chosen by the computer's roulette member selection, going into Novel Worlds to repair them, but there is another story going on as well. The Jarei Monsters are commanded by Jarei O Nyanma, the Queen of Evil-Spirited Monsters, sitting in her throne in the giant shell fortress in the seafloor ravine. Throughout the series she is watching the progress of the Eto Rangers that foil her plans. She has a grudge toward Aura for a perceived slight years ago. She sends out 4 cat warriors created from herself as well. It is not until later in the series that the overall story, and the past, begins to be revealed in more detail.\n\nAnime type: Fantasy, Adventures, Kemono (Furry)","torrent":{"xt":"urn:btih:39b32ae9684de2d89e5390b7ca012936a8779bf2","amp;dn":"%5BKSnF%5D+Juuni+Senshi+Bakuretsu+ETO+Rangers+-+DVD-RIP+-+RAWS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"39b32ae9684de2d89e5390b7ca012936a8779bf2","infoHashBuffer":{"type":"Buffer","data":[57,179,42,233,104,77,226,216,158,83,144,183,202,1,41,54,168,119,155,242]},"announce":[],"urlList":[]}}