{"title":"The Wind {silent era} [1928]  .avi","uid":5261433,"size":734246912,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:39f5bd1a309e16031f5b9e68c3fa818fc9554c48&amp;dn=The+Wind+%7Bsilent+era%7D+%5B1928%5D++.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"alien99","files":1,"time":1262745692,"description":"just thought i would share this one since i had it, i also think its a very good silent era film\nand the music is extremely good compared to most.\nwould appricate any comments on this even tho i have a limited library of\nthese on if i upload anymore of them.\n\nUser Rating:    8.4/10 \n\nRelease Date:   23 November 1928 (USA) \n\nGenre:   Drama | Western \n\nIMDB Tag:   tt0019585\n\n\tLillian Gish\t... \tLetty\n\tLars Hanson\t... \tLige\n\tMontagu Love\t... \tRoddy\n\tDorothy Cumming\t... \tCora\n\tEdward Earle\t... \tBeverly\n\nAuthor: Prof_Lostiswitz from Cyberia\n\n    I've watched The Wind several times, and I am convinced that it is one of the greatest movies ever. It is certainly the best silent western, and Lillian Gish has never been so profound as she is here.\n\n    What lifts it to the rank of a masterpiece is the passion of the direction and camerawork, and it certainly shows the advantage in having a mature artist like director Victor SjÃƒÂ¶strÃƒÂ¶m. The central character is, as promised, the wind, and the raw power of nature supersedes the melodrama. You become engulfed in the tempests and hurricanes, and it is only to easy to understand that they might drive the young lady mad.\n\n     Lillian Gish also does a magnificent job; her usual overacting is actually appropriate for this role, as the powerful cinematic images have established the likeliness that she is falling to pieces. This surely has to be her greatest performance. Dorothy Cumming is also equally powerful as the embittered &quot;other woman&quot;, one of the most evil characters to be found in a western. The other actors are adequate and satisfying without rising to the level of genius. Their acting is natural and unforced, unlike most silents.\n\n     It definitely gains from being a silent movie, all that dialogue would become a distraction if we had to listen to it. It helps that Thames Silents Orchestra has composed a beautiful and moving soundtrack, one that would sound good on a CD recording.\n\n\n\n\n\n\n\n","torrent":{"xt":"urn:btih:39f5bd1a309e16031f5b9e68c3fa818fc9554c48","amp;dn":"The+Wind+%7Bsilent+era%7D+%5B1928%5D++.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"39f5bd1a309e16031f5b9e68c3fa818fc9554c48","infoHashBuffer":{"type":"Buffer","data":[57,245,189,26,48,158,22,3,31,91,158,104,195,250,129,143,201,85,76,72]},"announce":[],"urlList":[]}}