{"title":"Ski Safari v1.1.1 Final By bobiras2009","uid":7501437,"size":25650652,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:3aced486d9a26e7fd6cba1071cd709f2c53911f1&amp;dn=Ski+Safari+v1.1.1+Final+By+bobiras2009&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bobiras2009","files":-1,"time":1344032725,"description":"Ski Safari is where Animals, Avalanches and Action come together to create a new casual gameplay experience.\nOur deep sleeping hero has to stay ahead of a relentless avalanche that threatens the local mountainsides. Sven, as we like to call him, can use animals to aid his escape from an icey end. \n\nEach of the hillside animals have different attributes to make a speedier escape. Penguins glide further, Yetis are tougher, Eagles soar to great heights, each of these can provide useful advantage for Sven. Sometimes on the slopes Sven can find fast Snowmobiles which can ferry multiple animals a maintain a very high top speed.\n\nStaying ahead of the avalanche has its advantages and perks. Completing objectives can 'level up' Sven and increase his score multiplier. Riding animals, performing backflips add to the score and with an increased score multiplier Sven will rocketing up the highscore table with ease.\n\n\nWhat's in this version: (Updated : Aug 1, 2012)\n\n    Welcome to Howling Hills, a new slope for Ski Safari.\n    Howling Hills is the home to a new animal... the Wolf!\n    Ever wondered what those scattered gold coins were for... its for the new shop.\n    You can use those coins to buy gizmos and powerups to help Sven escape the avalanche.\n    If you are more fashion conscious we have added a set of costumes you can grab from the shop.\n    Some small bug fixes were added in 1.1.1. No yetis were harmed in the making of this update. All penguins signed waivers.\n\nRequired Android O/S : 2.3+\n","torrent":{"xt":"urn:btih:3aced486d9a26e7fd6cba1071cd709f2c53911f1","amp;dn":"Ski+Safari+v1.1.1+Final+By+bobiras2009","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3aced486d9a26e7fd6cba1071cd709f2c53911f1","infoHashBuffer":{"type":"Buffer","data":[58,206,212,134,217,162,110,127,214,203,161,7,28,215,9,242,197,57,17,241]},"announce":[],"urlList":[]}}