{"title":"Quest to Aztlan v1.0.1 full [apkpita]","uid":15111552,"size":37478927,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:3b6cf112dcbde719427d6e14462e189af9dcb3d6&amp;dn=Quest+to+Aztlan+v1.0.1+full+%5Bapkpita%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"tiropitaki","files":1,"time":1467008432,"description":"Quest to Aztlan is a RPG, adventure and strategy game in which you'll lead your heroes to the lost city of Aztlan.\r\nFace powerful creatures who protect this city in incredible real time RPG battles.\r\nAre you prepared to discover the secrets of Aztlan and lead your heroes to victory?\r\n\r\nLIVE AN EPIC JOURNEY\r\n- Choose your heroes according to the strategy you want to follow into battle.\r\n- Each hero has unique stats and skills.\r\n- The strategy is the key! Each hero has offensive and defensive skills. Will you attack your enemy or support an ally?\r\n- Every time you win a battle you get coins that you can spend on new weapons and items.\r\n\r\nMASTER THE GAME\r\n- Real-time battles that will constantly test your strategy!\r\n- RPG battles where you have to make quick decisions and decide what orders you will give to your heroes.\r\n- Use consumables (bombs, potions, poisons, etc.) to help your heroes in battle.\r\n- Master the different skills and stats of your heroes. It is crucial for the victory!\r\n\r\nSTART YOUR JOURNEY TOWARDS AZTLAN\r\n- 40 challenging levels full of action and enemies that will try to prevent you achieving victory.\r\n- 4 different locations (jungle, caves, ancient ruins and the Great Temple of Aztlan). Can you overcome each of them?\r\n- Challenging and full of action as no other game.\r\n- Wide variety of items: weapons and equippable items for each character that offer a multitude of different combinations, dozens of consumables for battle (bombs, potions, poisons) and mysterious magical objects.\r\n\r\nEVERY BATTLE IS DIFFERENT\r\n- Hundreds of combinations of enemies that will try to block your progress through the different locations.\r\n- Each enemy has unique skills that will test your strategy and leadership ability.\r\n- Use wisely the special skills of each character. It will be decisive for the outcome of the battle!\r\n- Enemies will become more powerful and smart as you advance, offering you new and greater challenges. Could you beat them?\r\n\r\nKnow Aztlan history through the expedition diary, where curiosities, details and most important events will be narrated plus sketches and drawings to discover in depth the culture of this mythical city. You can unlock this content throughout the journey.\r\n\r\nThe adventure begins recruiting your own group of adventurers. These brave heroes come from different parts of the world and have very different histories and skills. Every team must have a leader and three companions, leading to lots of different combinations, each with different battle strategies.\r\n\r\nDefeat your enemies to get coins and spend them in the Merchant's store, a curious character who appears at the end of each day of travel. Inside the store you will find items for your expedition: weapons, clothing, supplies and magic items. Manage your resources by investing in weapons or supplies for battle or spending part of your coins to save your progress. The statistics of these objects are randomly generated depending on the level. Quest to Aztlan is a strategy role-playing game that will test your skills!\r\n\r\nDo not miss this great RPG adventure!\r\n\r\nDo you have any questions or suggestions with this RPG and adventure game? Contact us!\r\nTW: @QuestToAztlan\r\nFB: http://www. fb .com/abonfireofsouls/\r\nEmail:\n\r\nThank you for playing! ;)\r\n\r\nRequirements: Android OS 2.3 and up","torrent":{"xt":"urn:btih:3b6cf112dcbde719427d6e14462e189af9dcb3d6","amp;dn":"Quest+to+Aztlan+v1.0.1+full+%5Bapkpita%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3b6cf112dcbde719427d6e14462e189af9dcb3d6","infoHashBuffer":{"type":"Buffer","data":[59,108,241,18,220,189,231,25,66,125,110,20,70,46,24,154,249,220,179,214]},"announce":[],"urlList":[]}}