{"title":"EXPLOITED COLLEGE GIRLS - Natasha - Petite Teen Sex Fiend HD 720","uid":9030264,"size":1816219962,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:3bdbc879bd34acd9da5a41344633c109f0604026&amp;dn=EXPLOITED+COLLEGE+GIRLS+-+Natasha+-+Petite+Teen+Sex+Fiend+HD+720&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"beta2008x","files":1,"time":1381442110,"description":" &lt;a href=&quot;http://imgboxxx.com/viewer.php?file=4z071_nst.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://imgboxxx.com/viewer.php?file=4z071_nst.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://imgboxxx.com/viewer.php?file=0wo7x_exploitedcollegegirl.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgboxxx.com/viewer.php?file=0wo7x_exploitedcollegegirl.jpg&lt;/a&gt;\n\nMeet Natasha, a 5'1&quot; fun size bombshell who looks like a (tiny) supermodel and fucks like a (regular sized) pornstar. From her hip grinding enthusiasm to her two handed blowjob technique, this girl is a total sex fiend. We get started as usual chatting in the bathroom while Natasha puts on her make up but things escalate quickly when she starts explaining how hard she likes to get fucked, how much she likes to get slapped around and how much dick slapping turns her on. From there, there's just no use talking, this girl needs to get my cock inside her ASA and P. I have her drop to the floor and start sucking and I am blown (no pun intended) away. This girl claims to be half black and half white, but I'm pretty sure she's actually 75% sex goddess. While she's on her knees sucking me off I can see that she's rubbing her clit through her panties. To this observer that's a sure sign of a girl who needs to get fucked, so I bend her over the sink and pound her to her first orgasm in no time. Eventually we move to the bed and get back to a little more interview, but after playing with Natasha's fine little pussy, I'd much rather be doing that than getting to know about her high school years so I have her strip and spread. A little lube and a pocket vibrator and Natasha's having orgasm after orgasm. She's really into it, and so am I. Her giggly enthusiasm makes me want to get her off over and over. When she finally needs a rest, I have her give me more of that amazing head. This is probably one of the best BJ scenes I've ever filmed. From her two handed technique, to her sexy wet mouth, to her greedy deep throat technique, it's amazing. I can barely stop myself from busting a nut in her mouth. She's so turned on by it that her pussy is dripping wet. I throw her on the bed and fuck her as hard as I can manage, making her cum time after time. It's never really fair to compare the girls I shoot with one another. There are a lot of different circumstances that go into a shoot. That said, Natasha (or Natasha White, as she calls herself at the end - probably due to that big white jizz covered smile) is probably one of the sexiest girls I've shot in months. She's beyond enthusiastic, she's sexy as hell, she sucks dick like she invented the blowjob and she's having a great time every second of the shoot. ","torrent":{"xt":"urn:btih:3bdbc879bd34acd9da5a41344633c109f0604026","amp;dn":"EXPLOITED+COLLEGE+GIRLS+-+Natasha+-+Petite+Teen+Sex+Fiend+HD+720","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3bdbc879bd34acd9da5a41344633c109f0604026","infoHashBuffer":{"type":"Buffer","data":[59,219,200,121,189,52,172,217,218,90,65,52,70,51,193,9,240,96,64,38]},"announce":[],"urlList":[]}}