{"title":"Head First iPhone and iPad Development","uid":6511233,"size":33198014,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3c0e9c5d5224892afeef33c73bcfea101db86743&amp;dn=Head+First+iPhone+and+iPad+Development&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"_F1_","files":-1,"time":1309630802,"description":"Head First iPhone and iPad Development: A Learner's Guide to Creating Objective-C Applications for the iPhone and iPad By Dan Pilone, Tracey Pilone\n Publisher: O'Re..illy Me..dia; Second edition 2011 | 672 Pages | ISBN: 1449387829 | PDF | 31.6 MB\n\n\n\n Let's say you have a killer app idea for iPhone and iPad. Where do you begin? Head First iPhone and iPad Development will help you get your first application up and running in no time. You'll not only learn how to design for Apple's devices, you'll also master the iPhone SDK tools -- including Interface Builder, Xcode, and Objective-C programming principles -- to make your app stand out. \n Whether you're a seasoned Mac developer who wants to jump into the App store, or someone with strong object-oriented programming skills but no Mac experience, this book is a complete learning experience for creating eye-catching, top-selling iPhone and iPad applications. \nInstall the iPhone OS SDK and get started using Interface Builder and XCode \nPut Objective-C core concepts to work, including message passing, protocols, properties, and memory management \nTake advantage of iPhone OS patterns such as datasources and delegates \nPreview your applications in the Simulator \nBuild more complicated interactions that utilize multiple views, data entry/editing, and rotation \nWork with the iPhone's camera, GPS, and accelerometer \nOptimize, test, and distribute your application \nWe think your time is too valuable to waste struggling with new concepts. Using the latest research in cognitive science and learning theory to craft a multi-sensory learning experience, Head First iPhone and iPad Development has a visually rich format designed for the way your brain works, not a text-heavy approach that puts you to sleep.","torrent":{"xt":"urn:btih:3c0e9c5d5224892afeef33c73bcfea101db86743","amp;dn":"Head+First+iPhone+and+iPad+Development","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3c0e9c5d5224892afeef33c73bcfea101db86743","infoHashBuffer":{"type":"Buffer","data":[60,14,156,93,82,36,137,42,254,239,51,199,59,207,234,16,29,184,103,67]},"announce":[],"urlList":[]}}