{"title":"Earn to Die 2  V 1.0.20 For IPhone IPad IOS.ipa","uid":11739768,"size":101445923,"categoryP":"games","categoryS":"ios_(ipad_iphone)","magnet":"?xt=urn:btih:3d2d758ef99ac1df874b3ec8930104dd2d44a7db&amp;dn=Earn+to+Die+2++V+1.0.20+For+IPhone+IPad+IOS.ipa&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"zxfghfg","files":1,"time":1425738205,"description":"50% off for a limited time as part of the App Store's Amazing Indie Games promotion!\n\nDrive your car through a zombie apocalypse in this massive follow-up to the chart-topping hit Earn to Die!\n\nAn evacuation ship is waiting on the other side of the country. The only thing that stands in your way: city after city overrun by zombies . With only a run-down car and a small amount of cash you face a familiar situation... to drive through hordes of zombies in order to survive!\n\nBRAND NEW STORY MODE\nEarn to Die 2 introduces a massive new Story Mode, five times longer than its predecessor. The game departs its familiar desert setting and delves into the depths of cities infested by zombies. \n\nMULTI-TIERED LEVELS:\nLevels are now multi-tiered! Drive across decayed highway overpasses, via underground tunnels, or smash through epic zombie filled factories. Whichever path you choose to take, you won't be able to escape the zombie hordes - your only choice is to smash through them!\n\nBUILD A ZOMBIE-SLAUGHTERING MACHINE\nUnlock and upgrade 10 different vehicles, including a sports car, a fire truck, and even an ice-cream van. Each vehicle can be equipped with a range of upgrades, such as armored frames, roof-mounted guns, boosters and more. Those zombies will stand no chance.\n\nDESTRUCTIBLE VEHICLES\nVehicles are now fully destructible. Hang on for your life as your vehicle gets smashed to smithereens if you aren't too careful.\n\nMORE ZOMBIES. MORE DESTRUCTION. MORE MAYHEM.\nWhat are you waiting for? That rescue ship isn't going to wait forever! Prepare yourself for a wild ride - and seriously, there is nothing like smashing through zombie-filled factories!\n\nFor those brave enough to survive the apocalypse, a brand new Missions Mode is also coming soon.\n\nWHAT'S NEW\n\nFixed a bug where some users couldn't access free ride mode after beating the game","torrent":{"xt":"urn:btih:3d2d758ef99ac1df874b3ec8930104dd2d44a7db","amp;dn":"Earn+to+Die+2++V+1.0.20+For+IPhone+IPad+IOS.ipa","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3d2d758ef99ac1df874b3ec8930104dd2d44a7db","infoHashBuffer":{"type":"Buffer","data":[61,45,117,142,249,154,193,223,135,75,62,200,147,1,4,221,45,68,167,219]},"announce":[],"urlList":[]}}