{"title":"Mickey Newbury - Lulled By the Moonlight [2000][EAC/FLAC]","uid":10677119,"size":422152980,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:3d55b7715fe1d5ddc4ad6b208e39e4cab1a962b6&amp;dn=Mickey+Newbury+-+Lulled+By+the+Moonlight+%5B2000%5D%5BEAC%2FFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"dickspic","files":-1,"time":1406977189,"description":"FLAC / Lossless / Log (100%) / Cue \nLabel/Cat#:Mountain Retreat #8653\nCountry: USA\nYear: November 2, 1999\nGenre: folk,country\nFormat:CD,Album\n\n\n\n\n\n\n01 Three Bells for Stephen\n02 East Kentucky\n03 Captured in Blue\n04 Just Another Lovely Day\n05 Blue Sky Shining/Down the Tracks (Interlude)\n06 Freight Train Howlin'/Into the Sky (Interlude)\n07 Shades of '63\n08 Amen for Old Friends\n09 Genevieve\n10 Sailor Sailor\n11 What Will I Do\n12 Ramblin' Blues\n13 Workin' Man\n14 The Future's Is Not What It Used to Be\n15 Time Was\n16 Silver Moon\n17 Safe Harbour\n\n\n\nIn 1994, Mickey Newbury gave his patient fans hope by releasing the live album Nights When I Am Sane, his first recording of any kind in six years and his first to contain any new material in 13 years. Two years later, he answered their prayers with Lulled By the Moonlight, his first new studio album consisting primarily of new material since 1981's After All These Years. Put out on his own record label, it was a typically eccentric effort. Always fond of recycling his own work, Newbury borrowed the track &quot;Blue Sky Shining&quot; from his 1979 album The Sailor as well as musical interludes from LPs dating back to 1969's Looks Like Rain; re-recorded &quot;The Future Is Not What It Used to Be,&quot; which had first appeared on his 1971 album 'Frisco Mabel Joy; and included studio recordings of three of the four new songs that had appeared on Nights When I Am Sane. He also turned over one entire track on the album to Toni Jolene Clay, who co-wrote (with J. Weatherly), sang, played piano on, and produced &quot;Silver Moon&quot; with no apparent input from him. All those digressions, however, still left room on a 73-minute CD for 11 new (or at least previously unrecorded) Newbury compositions. The songwriter dedicated the album to Stephen Foster, with whom he must identify. Foster was the first man to become well-known as a songwriter, and he came up with material that has been absorbed into American popular music. Newbury, who has always shown a fondness for 19th century song styles, began this comeback collection with &quot;Three Bells for Stephen,&quot; asking, &quot;Do you remember me, dear hearts and gentle people?&quot; His new songs were full of backward glances over a long life and were tinged with regret, which was a typical stance for him. But he could also be surprising. &quot;Captured in Blue&quot; was a doo wop love song on which his voice was reminiscent of fellow East Texan Don Henley, for example, while &quot;Just Another Lovely Day&quot; was a light, jazzy number, and &quot;Freight Train Howlin'&quot; a rocker. More characteristic were songs, like &quot;Shades of '63&quot; and &quot;Time Was,&quot; that reflected philosophically on the past. Lulled By the Moonlight was not a masterpiece, which necessarily made it a disappointment given the high standard of the artist's best work, but it demonstrated that he continued to ply his craft a decade and a half after he had given up on a full-time performing career, and that was encouraging.","torrent":{"xt":"urn:btih:3d55b7715fe1d5ddc4ad6b208e39e4cab1a962b6","amp;dn":"Mickey+Newbury+-+Lulled+By+the+Moonlight+%5B2000%5D%5BEAC%2FFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3d55b7715fe1d5ddc4ad6b208e39e4cab1a962b6","infoHashBuffer":{"type":"Buffer","data":[61,85,183,113,95,225,213,221,196,173,107,32,142,57,228,202,177,169,98,182]},"announce":[],"urlList":[]}}