{"title":"The House of the Vampire by George Sylvester Viereck","uid":8331387,"size":433170,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3da40cd2df374dfc59bdaad75458d11f79e28686&amp;dn=The+House+of+the+Vampire+by+George+Sylvester+Viereck&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"imarion","files":-1,"time":1364899087,"description":"The House of the Vampire is one of the first psychic vampire novels of its time where the vampire feeds off of more than just blood. The House of the Vampire is an early classic in its genre infused with a relish for the supernatural, especially the trappings of the dark.\n\nThe House of the Vampire delivers a horror which we know does not - but none the less conceivably might - exist and threaten ourselves. Blurring the lines between fact and fiction, The House of the Vampire is considered a classic among Victorian Gothic stories. He felt the presence of the hand of Reginald Clarke - unmistakably - groping in his brain as if searching for something that had still escaped him. He tried to move, to cry out, but his limbs were paralysed. When, by a superhuman effort, he at last succeeded in shaking off the numbness that held him enchained, he awoke just in time to see a figure, that of a man, disappearing in the wall that separated Reginald's apartments from his room.... George Sylvester Viereck (1884 - 1962), remembered today chiefly for his contributions to fantasy literature, was born in Germany and emigrated to the United States with his family at age 11. He was editor of the magazine The Fatherland, and author of Confessions of a Barbarian and Glimpses of the Great. ","torrent":{"xt":"urn:btih:3da40cd2df374dfc59bdaad75458d11f79e28686","amp;dn":"The+House+of+the+Vampire+by+George+Sylvester+Viereck","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3da40cd2df374dfc59bdaad75458d11f79e28686","infoHashBuffer":{"type":"Buffer","data":[61,164,12,210,223,55,77,252,89,189,170,215,84,88,209,31,121,226,134,134]},"announce":[],"urlList":[]}}