{"title":"God Is Dead 001 (2013) (10 Covers) (Digital) (Darkness-Empire).c","uid":9032832,"size":52349438,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:3e1d64a3b8d52829c16159fd62459ae6c64d9a91&amp;dn=God+Is+Dead+001+%282013%29+%2810+Covers%29+%28Digital%29+%28Darkness-Empire%29.c&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"nemesis43","files":1,"time":1381456360,"description":"Like a thunderbolt from heaven, the epic launch issue of GOD IS DEAD is here! East of West and Fantastic Four author JONATHAN HICKMAN launches a fierce new series that stomps where others fear to tread. Mankind has argued over the existence of gods since the dawn of time. In modern eras it's been fashionable to mock religious believers with taunts of scientific testimony and fact. But when the gods of old begin to reappear on earth and claim the domain of man for their own, the world is thrown into a state of utter anarchy. Now Horus walks the streets of Egypt, Zeus has taken over the Sistine Chapel, and Odin is coordinating the dissection of the earth among the returned deities. Mankind held sway over the world for thousands of years and their hubris over that time has made them powerful but when faced with the divine, can mortal weapons put an end to the second coming of the gods?\n\nAvailable with a Regular cover by Jonathan Hickman, End of Days cover by super-star Jacen Burrows, a premium Iconic cover by Burrows that features a card stock cover and is limited to just 5000 copies, and a Pantheon Order Incentive cover by series artist Di Amorim.","torrent":{"xt":"urn:btih:3e1d64a3b8d52829c16159fd62459ae6c64d9a91","amp;dn":"God+Is+Dead+001+%282013%29+%2810+Covers%29+%28Digital%29+%28Darkness-Empire%29.c","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3e1d64a3b8d52829c16159fd62459ae6c64d9a91","infoHashBuffer":{"type":"Buffer","data":[62,29,100,163,184,213,40,41,193,97,89,253,98,69,154,230,198,77,154,145]},"announce":[],"urlList":[]}}