{"title":"Allok Video Splitter","uid":6600314,"size":11845056,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:3e2eb3e4aa2b6266ffeacdab888c155dd7ba3a73&amp;dn=Allok+Video+Splitter&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"slurpy97","files":2,"time":1313177926,"description":"Allok Video Splitter a powerful tool to split, cut or trim large AVI, DivX, Xvid, MPEG, WMV, ASF, RM, MOV, FLV, 3GP or MP4 files into smaller clips in various format. The included video player and different splitting mode let you split or cut a movie file to smaller clips easily.You can even use it to convert a single file. Output format include AVI, MPEG I/II, VCD, SVCD, DVD, WMV, FLV, 3GP, MP4. All encoders/codec are built-in and any supported conversion can be done once you downloading the software . The program does not require any technical experience and is very easy to use. Key Features of Allok Video Splitter: Split,cut or trim large video files into smaller clips in various format. Supports direct stream cut, without re-encode. Supports AVI, Divx, XviD, MPEG, WMV, ASF, RM, MOV, 3GP, MP4 and VCD SVCD bin/cue image. Split supported files to AVI, DivX, Xvid. Split supported files to MPEG1, MPEG2. Split supported files to VCD,SVCD,DVD compatible MPEG formats. Split supported files to WMV, ASF. Split supported files to FLV, 3GP, MP4. All encoders/codec are built-in and any supported conversion can be done once you downloading the software. NTSC/PAL setting options for DVD, VCD, SVCD exporting. Support &quot;Drag and Drop&quot; from Windows Explorer. Custom define the output audio volume. Add letterbox to keep the original aspect ratio. Support large video file, even large then 2GB. Fast conversion speeds and high quality. Simple GUI and very EASY to use.\n\n\nTesting Bittorrent instead of Utorrent. I have some probs with upload with Utorrent.\n\nGreetings Realuploads\n\n","torrent":{"xt":"urn:btih:3e2eb3e4aa2b6266ffeacdab888c155dd7ba3a73","amp;dn":"Allok+Video+Splitter","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3e2eb3e4aa2b6266ffeacdab888c155dd7ba3a73","infoHashBuffer":{"type":"Buffer","data":[62,46,179,228,170,43,98,102,255,234,205,171,136,140,21,93,215,186,58,115]},"announce":[],"urlList":[]}}