{"title":"Advanced Digital Optical Communications, 2nd Edition [2015] [PDF","uid":12071042,"size":45799818,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3fed8b358eafaec388495f1acd2614d0b8635f1e&amp;dn=Advanced+Digital+Optical+Communications%2C+2nd+Edition+%5B2015%5D+%5BPDF&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":"NoctDeath","files":3,"time":1435515415,"description":"Title: Advanced Digital Optical Communications \nSeries: Optics and Photonics \nAuthor: Le Nguyen Binh \nFormat: PDF \nHardcover: 937 pages \nPublisher: CRC Press; 2 edition (February 12, 2015) \nLanguage: English \nISBN: 978-1482226522 \n\n\nThis second edition of Digital Optical Communications provides a comprehensive treatment of the modern aspects of coherent homodyne and self-coherent reception techniques using algorithms incorporated in digital signal processing (DSP) systems and DSP-based transmitters to overcome several linear and nonlinear transmission impairments and frequency mismatching between the local oscillator and the carrier, as well as clock recovery and cycle slips. These modern transmission systems have emerged as the core technology for Tera-bits per second (bps) and Peta-bps optical Internet for the near future.\n\nFeaturing extensive updates to all existing chapters, Advanced Digital Optical Communications, Second Edition:\n\n- Contains new chapters on optical fiber structures and propagation, optical coherent receivers, DSP equalizer algorithms, and high-order spectral DSP receivers\n- Examines theoretical foundations, practical case studies, and MATLABÂ® and SimulinkÂ® models for simulation transmissions\n- Includes new end-of-chapter practice problems and useful appendices to supplement technical information\n- Downloadable content available with qualifying course adoption\n\nAdvanced Digital Optical Communications, Second Edition supplies a fundamental understanding of digital communication applications in optical communication technologies, emphasizing operation principles versus heavy mathematical analysis. It is an ideal text for aspiring engineers and a valuable professional reference for those involved in optics, telecommunications, electronics, photonics, and digital signal processing","torrent":{"xt":"urn:btih:3fed8b358eafaec388495f1acd2614d0b8635f1e","amp;dn":"Advanced+Digital+Optical+Communications%2C+2nd+Edition+%5B2015%5D+%5BPDF","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3fed8b358eafaec388495f1acd2614d0b8635f1e","infoHashBuffer":{"type":"Buffer","data":[63,237,139,53,142,175,174,195,136,73,95,26,205,38,20,208,184,99,95,30]},"announce":[],"urlList":[]}}