{"title":"Treatise on Process Metallurgy Vol. 1 - Process Fundamentals","uid":12714873,"size":38977538,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:402f44802ec900949f111efd1b16a1728cb98ec1&amp;dn=Treatise+on+Process+Metallurgy+Vol.+1+-+Process+Fundamentals&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1446920221,"description":"Treatise on Process Metallurgy Vol. 1 - Process Fundamentals (Elsevier, 2014).pdf\r\n\r\nISBN 9780080969862\r\n\r\nProcess metallurgy provides academics with the fundamentals of the manufacturing of metallic materials, from raw materials into finished parts or products.\r\n\r\nCoverage is divided into three volumes, entitled Process Fundamentals, encompassing process fundamentals, extractive and refining processes, and metallurgical process phenomena; Processing Phenomena, encompassing ferrous processing; non-ferrous processing; and refractory, reactive and aqueous processing of metals; and Industrial Processes, encompassing process modeling and computational tools, energy optimization, environmental aspects and industrial design.\r\n\r\nThe work distils 400+ years combined academic experience from the principal editor and multidisciplinary 14-member editorial advisory board, providing the 2,608-page work with a seal of quality.\r\n\r\nThe volumes will function as the process counterpart to Robert Cahn and Peter Haasen’s famous reference family, Physical Metallurgy (1996)--which excluded process metallurgy from consideration and which is currently undergoing a major revision under the editorship of David Laughlin and Kazuhiro Hono (publishing 2014). Nevertheless, process and extractive metallurgy are fields within their own right, and this work will be of interest to libraries supporting courses in the process area.\r\n\r\nSynthesizes the most pertinent contemporary developments within process metallurgy so scientists have authoritative information at their fingertips\r\nReplaces existing articles and monographs with a single complete solution, saving time for busy scientists\r\nHelps metallurgists to predict changes and consequences and create or modify whatever process is deployed","torrent":{"xt":"urn:btih:402f44802ec900949f111efd1b16a1728cb98ec1","amp;dn":"Treatise+on+Process+Metallurgy+Vol.+1+-+Process+Fundamentals","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"402f44802ec900949f111efd1b16a1728cb98ec1","infoHashBuffer":{"type":"Buffer","data":[64,47,68,128,46,201,0,148,159,17,30,253,27,22,161,114,140,185,142,193]},"announce":[],"urlList":[]}}