{"title":"Rzewski Plays Rzewski. Piano Works, 1975-1999","uid":5321599,"size":760831150,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:40bcc39b7ab0bc453d594df35c80ca319a95956f&amp;dn=Rzewski+Plays+Rzewski.+Piano+Works%2C+1975-1999&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"maksus","files":-1,"time":1264876769,"description":"This is the set that every Rzewski fan had been waiting for. Though he had released numerous albums prior to this, they had often been on labels that received scanty distribution and/or went out of print fairly quickly. At age 64, a major label not only decided to release his work, but did it with a bang: a seven-disc set covering his entire solo piano output for a quarter century. Listeners familiar with his earlier rendition on hat ART may be somewhat disconcerted at the version of &quot;Four North American Ballads&quot; that opens this album. They are played at substantially slower tempi with a far more ruminative quality. One naturally asks whether the years, perhaps, had taken a toll on Rzewski's incredibly fiery, bravado piano technique. Subsequent tracks, however, quickly put this notion to bed and one realizes that the composer simply feels free to reinterpret these pieces in a relaxed fashion, re-examining them from a quieter, less-forthright angle. Several wonderful, rarely heard works are included, such as &quot;The Housewife's Lament,&quot; &quot;Fantasia,&quot; and his &quot;Sonata,&quot; all of which partake of his long penchant for borrowing from folk and protest songs (including &quot;Give Peace a Chance&quot; on more than one occasion). Two discs are taken up by his ongoing composition &quot;The Road,&quot; a proposed eight-part composition of which listeners hear the first four. These are short studies, relatively abstract, sometimes making use of extra-pianistic techniques such as slapping the piano, drumming on its cover, whistling, and more. While all of this is wonderful enough, the true highlights are on the final two discs. First is a performance of his masterwork &quot;36 Variations on 'The People United Will Never Be Defeated!'.&quot; This has been recorded several times since its first reading by Ursala Oppens in 1975, but Rzewski's own prior rendition from 1986 on hat ART had been the finest and was long out of print. Amazingly, he actually outdoes that performance here with a spectacularly passionate display of imagination, wringing every last bit of drama from the piece and (as in several other works here) improvising with beauty and intelligence. Even more astoundingly, he comes close to topping that set in the closing piece, &quot;De Profundis,&quot; a setting of Oscar Wilde's letters from Reading Gaol. Rzewski's textual reading is so moving, the music matched so perfectly, that only the stoniest listener will avoid tears. Rzewski Plays Rzewski: Piano Works 1975-1999 represents this superb composer at the pinnacle of his creativity, making a strong case for him as one of the very premiere composers of the 20th century. An awe-inspiring album.\n\n\n\nMore on Rzewski here: &lt;a href=&quot;\nhttp://jazztimes.com/articles/13527-rzewski-plays-rzewski-piano-works-1975-1999-frederic-rzewski&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://jazztimes.com/articles/13527-rzewski-plays-rzewski-piano-works-1975-1999-frederic-rzewski&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:40bcc39b7ab0bc453d594df35c80ca319a95956f","amp;dn":"Rzewski+Plays+Rzewski.+Piano+Works%2C+1975-1999","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"40bcc39b7ab0bc453d594df35c80ca319a95956f","infoHashBuffer":{"type":"Buffer","data":[64,188,195,155,122,176,188,69,61,89,77,243,92,128,202,49,154,149,149,111]},"announce":[],"urlList":[]}}