{"title":"Norma Waterson - The Very Thought of You (1999) [Folk][mp3 320][","uid":4734589,"size":120843628,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:40d13208c11cec24a94381450326f1082a6b44be&amp;dn=Norma+Waterson+-+The+Very+Thought+of+You+%281999%29+%5BFolk%5D%5Bmp3+320%5D%5B&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"schon55","files":19,"time":1235176911,"description":"Norma Waterson - The Very Thought of You\nReleased in 1999\nLabel: Hannibal\nGenre: Blues, Folk \nBitrate: 320 kbps\n\nI must say that my first reaction to this second solo CD from Norma Waterson was that she had made an album of some of her favourite popular songs, however after a few listenings it became obvious that this was a much deeper and far more satisfying concept. \n\nShe has paired songs of a similar theme, giving each part of the pair a much stronger life by creating a social comment; hence we have 'Love of My Life' (Freddie Mercury) with Lal Waterson's 'Reply to Joe Haines' ( who made some very offensive statements about Mercury when he made his AIDS infection known to the public ). \n\nThe songs are not all angry statements, many are affectionate tributes to past influences: Judy Garland, Al Bowlly, Fred Astaire and Joseph Locke. To hear Norma, Martin Carthy and Eliza singing that ever-optimistic song 'Over the Rainbow' is a strange experience and yet it is so right that the family join in ( it happens in my own family with popular songs ). Here we have a delightful performance of John Martyn's 'Solid Air'; period versions of 'The Very Thought of You' and 'Change Partners' evocative of the BBC Light Programme of the fifties.\n\nThe accompaniment is of the highest standard; once again she calls on the skills of Richard Thompson, Danny Thompson, Martin Carthy and Eliza Carthy. The instruments and additional vocals never intrude but add tones and textures to the songs lifting Norma's central vocals to greater heights.\n\nThe whole CD is very reflective and is tinged with a sadness that touches the heart; the album seems to be summed up by Eliza Carthy's beautiful song 'Fallen Leaves'. Some people have been dismissive of this CD saying that she is being self-indulgent, but I feel they are guilty of not listening. This is one of the most thoughtful records I've heard in a long time; each time I play it I find a new pleasure, I think this is going to become a favourite record.  ~ Nick Caffrey\n\nWith two exceptions the songs are in pairs, and each has a story attached.  Those stories range from childhood memories evoked by Fred Astaire of twice a week visits to the cinema with what seems like my entire family set alongside the fantasies indulged by an ordinary man to mask the drudgery of his daily life, to the regret of Al Bowlly's in Heaven for his premature death in an air raid contrasting to the pain of returning from war to the disappointment of peace.  They include the feelings of disappointment for the unfulfilled promise of Nick Drake - that most careless ( with himself ) and most English of writers whose influences came from far and wide but who always makes my Martin think of Ivor Novello.  They range from the extraordinary story which is attached to the writing of the song Josef Locke - the naughtiest and most optimistic of Irishmen - a song which comes out of an encounter between the man himself ( was it or wasn't it? ) and Fairport Convention in a pub in Covent Garden late one night to the white knuckle fury of my sister Lal's Reply to Joe Haines ( originally called An Open Letter to Joe Haines ) which is just that.  A reply to the iniquitous article written by that man on the subject of Freddie Mercury's disclosure that he was HIV positive ( indeed that he had full blown AIDS ) and which the Daily Mirror saw fit to print. \n\nThe exceptions are Dreaming by the great US songwriter Loudon Wainwright III which he let me have in 1997 when I asked if he had any songs going (!) and Fallen Leaves, written for me by Eliza.  It's a song triggered by many events, not least the life of Marilyn Monroe, the death of Princess Diana and society's ( men's! ) notions of what constitutes beauty in women.  \n\nThis album is lovingly dedicated to the memory of my sister Lal. ~ Norma Waterson\n\nPersonnel:\nNorma Waterson (Vocals) \nRichard Thompson (Acoustic Guitar, Electric Guitar, Hurdy-Gurdy and Mandolin) - 1,3-13 \nMartin Carthy (Acoustic Guitar and Backing Vocals) - 1,3-12 \nTeddy Borowiecki (Piano, Hammond Organ and Accordion) - 1-5,7-11 \nEliza Carthy (Backing Vocals and Viola) - 1-5,7,9,11-13\nDanny Thompson (Double Bass and Backing Vocals) - 2-5,7-9,13 \nJohn McColgan (Drums) - 1,3-6,8,10-12 \nPat Donaldson (Bass Guitar) - 1,6,9-12\nChris Parkinson (Accordion) - 5-7,11 \nJoel Pescin (Tenor Saxophone) - 8 \n\nNorma Waterson - The Very Thought of You Tracks:\n01 Love Of My Life (Freddie Mercury) 2:22 \n02 Reply To Joe Haines (Lal Waterson) 2:42 \n03 Blaze Away (Abe Holzman/Jimmy Kennedy) 2:41 \n04 Josef Locke (Richard Thompson) 3:03 \n05 Over The Rainbow (Harold Arlen/Edgar Yip Harburg) 3:15 \n06 Bluebird (John B. Spencer) 4:01 \n07 Dreamin' (Loudon Wainwright III) 3:29 \n08 Al Bowlly's In Heaven/The Very Thought Of You (Richard Thompson/Ray Noble) 7:37 \n09 River Man (Nick Drake) 3:55 \n10 Solid Air (John Martyn) 4:24 \n11 Change Partners And Dance (Stephen L. Graziano) 3:04 \n12 On Fridays He's Fred Astaire (Clive Gregson) 4:18 \n13 Fallen Leaves (Eliza Carthy) 5:04 \n","torrent":{"xt":"urn:btih:40d13208c11cec24a94381450326f1082a6b44be","amp;dn":"Norma+Waterson+-+The+Very+Thought+of+You+%281999%29+%5BFolk%5D%5Bmp3+320%5D%5B","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"40d13208c11cec24a94381450326f1082a6b44be","infoHashBuffer":{"type":"Buffer","data":[64,209,50,8,193,28,236,36,169,67,129,69,3,38,241,8,42,107,68,190]},"announce":[],"urlList":[]}}