{"title":"Michael Jackson - Will You Be There","uid":4982656,"size":124487684,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:40e0ab0a851ea2178e910706abee5040dc56ec65&amp;dn=Michael+Jackson+-+Will+You+Be+There&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1246420558,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\n&quot;Will You Be There&quot; is a song by Michael Jackson which was released as a single in 1993. The single was taken from the 1991 album Dangerous and also appeared on the soundtrack to Free Willy.\n\nJackson was sued for this song by Italian artist Al Bano, that considered it to be a plagiarism of his &quot;I cigni di Balaka&quot;. Italian judges stated that the two songs, both being very similar, are inspired by a traditional Indian song.\n\nThe song was one of the bigger hits from Dangerous, staying in the top 40 for over six weeks in the UK. The single achieved even greater success in the U.S., where it sold over 500,000 copies and stayed in the top 10 for six weeks, peaking at number 7 and later being certified Gold. In Europe, the single reached number one in the MTV Eurochart, though it missed the top 10 in many of the other European charts, including Germany and France. The single has sold 1,050,000 copies worldwide.\n\nThe video was a mix of footage from Free Willy, the Dangerous World Tour and Jackson's performance of the song at MTV's 10th anniversary show in 1991. Audio is dubbed from the soundtrack.\n\n&quot;Will You Be There&quot; won the MTV Movie Award for &quot;Best Song in a Movie&quot; in 1994. It was also included in the album All Time Greatest Movie Songs, released by Sony in 1999.\n\nDangerous is the eighth album by Michael Jackson, released on November 26, 1991. It became his second to debut at #1 on the Billboard 200 album chart, where it spent the next four consecutive weeks. In the space of 17 years, the record has sold over 32 million copies worldwide, with 7 million shipments in the United States alone, making it a better selling album than his previous record Bad. The album won one Grammy for Best Engineered Album - and is the most successful new jack swing album of all time.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:40e0ab0a851ea2178e910706abee5040dc56ec65","amp;dn":"Michael+Jackson+-+Will+You+Be+There","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"40e0ab0a851ea2178e910706abee5040dc56ec65","infoHashBuffer":{"type":"Buffer","data":[64,224,171,10,133,30,162,23,142,145,7,6,171,238,80,64,220,86,236,101]},"announce":[],"urlList":[]}}