{"title":"AutoFX DreamSuite Ultimate 1.36 Portable","uid":7177856,"size":95954908,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:4171d5108c68e42482d6fa5f3fc81d53b7eef33c&amp;dn=AutoFX+DreamSuite+Ultimate+1.36+Portable&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mdusanjay","files":1,"time":1334170195,"description":"DreamSuite Ultimate is a suite of powerful visual effects that allow anyone, professionals or novices alike, to create beautiful images and artwork. DreamSuite lets you achieve visual results that are difficult or impossible to attain using any other software. Now we have added 12 new effects to the already well established product base to the DreamSuite Series. In DreamSuite Ultimate you not only get these brand new artistic effects, you also get all the content formerly in the 3 products known as DreamSuite Bundle. This includes an upgraded version of DreamSuite One, DreamSuite Two, and DreamSuite Gel.\nWe have added several presets for each product of the past as well as the new artistic content. This is the perfect blend of artistic effects for those wating to enhance their digital images like the Masters of Old, as well as the perfect tools for Graphic Artists and Web Designers. Create amazing results with all of your digital images and see what magical expressions you can create with simple, easy to use tools applied to your digital canvas. The DreamSuite series of effects work as a stand-alone application and as an Adobe Photoshop plug-in for Mac and Windows users.\n\nEasy to Use Interface\n\nThe DreamSuite interface is built around ease-of-use. Intuitive controls and tools help guide you as you create the effect. Each control has built in aparagraph length tool-tip for ease of use.\n\nDreamSuite Ultimate\n\nDreamSuite works on  Windows and includes both a stand-alone application as well as an Adobe Photoshop plug-in that works with CS, CS2, CS3, CS4, and CS5\n &lt;a href=&quot;\nhttp://www.autofx.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.autofx.com/&lt;/a&gt;","torrent":{"xt":"urn:btih:4171d5108c68e42482d6fa5f3fc81d53b7eef33c","amp;dn":"AutoFX+DreamSuite+Ultimate+1.36+Portable","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4171d5108c68e42482d6fa5f3fc81d53b7eef33c","infoHashBuffer":{"type":"Buffer","data":[65,113,213,16,140,104,228,36,130,214,250,95,63,200,29,83,183,238,243,60]},"announce":[],"urlList":[]}}