{"title":"Marah - Angels Of Destruction! [2008][EAC,log,cue. FLAC]","uid":8416895,"size":348758838,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:42567ed4961e99f532901e0fdc14cf3cd2da67ad&amp;dn=Marah+-+Angels+Of+Destruction%21+%5B2008%5D%5BEAC%2Clog%2Ccue.+FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dickspic","files":15,"time":1367024059,"description":"Artist: Marah\nRelease: Angels Of Destruction!\nDiscogs: 2965821\nReleased: 2008\nLabel: Munich Records\nCatalog#: MRCD 287\nFormat: FLAC / Lossless / Log (100%) / Cue / CD\nCountry: Netherlands\nStyle: Rock, Alternative Rock\n\n\n\n01. Coughing Up Blood (4:20)\n02. Old Time Tickin' Away (2:39)\n03. Angels On A Passing Train (4:07)\n04. Wild West Love Song (3:26)\n05. Blue But Cool (4:21)\n06. Jesus In The Temple (3:19)\n07. Santos De Madera (4:01)\n08. Songbirdz (3:06)\n09. Angels Of Destruction! (3:16)\n10. Can't Take It With You... (4:08)\n11. Wilderness (5:40)\n\nPhilly rockers Marah have weathered more than their fair share of E-Street band comparisons, but let this be said about their sixth album, Angels of Destruction: Bruce's band never threw a party anything like this. Bursting at the seams with zany ideas and far-flung creativity, Angels is exhilarating and visionary and joyfully bloated like only the best classic rock albums are, and Marah takes their music down roads the E-Streeters never dreamed of.\n\nSo is it a masterpiece? Well, a masterpiece of imagination, perhaps. Truly, it's one of the most creative and adventurous rock albums in recent memory, exploding with enough ideas for three or four albums. The men and women of Marah are completely smitten with their own big-hearted, noisey brand of rock and roll, and their attention span seems way too short to keep them in the same place for too long. And so they enthusiastically flesh out the E-Street blueprint with Stonesy riffs, Tin Pan Alley pop, jazz, Vaudeville, Led Zep-style blues, horns, loud guitars, lots of piano, a lead singer who sounds uncannily like a young Elvis Costello, a tendency toward theatricality, and a ten-minute closing number that takes choruses and verses from the rest of the album and splices them together as a &quot;Day in the Life&quot;-style suite... with a bagpipe solo in the middle.\n\nIt's nothing if not audacious. And it just has to be heard to be believed.\n\nBut even as it amazes with its sheer exhuberance and its astonishing musical breadth, it's equally likely to frustrate-- not to the extent of it being a bad or even a mediocre album, but it's hard to shake the feeling that the band's ambitions stretch beyond their songcraft at this point, that they still have some refining to do, that they're likely to make an even better album-- a true masterpiece-- a few years down the road.\n\nThere are two things that keep Angels from being the stone-classic this band seems capable of. The first is that they're so obviously in love with rock and roll-- so totally smitten with music itself-- that they try to cram the last 80 years of pop music into a 45-minute album. To their credit, they largely succeed-- the sheer expanse of their sound really is impressive-- but they've dumped so much stuff into their blender that, over the course of the album, it tends to become a bit numbing. It's creativity on overload, and while there are tons of great ideas here, most of them aren't given the space needed to stand out.\n\nThe second problem comes in the lyrics. If Marah is often compared to the E-Street Band, songwriters David and Serge Bielanko might have more in common with Springsteen devotee Craig Finn. Like Finn, they spin tales of sin and redemption that are rife with religious language, but where Finn's songs are pure street poetry-- provocative and profound in a way that even Springsteen seldom attains-- the Bielankos toss around such clunky spiritual imagery that they sometimes toe the line of Meat Loaf-style parody. Comparing a jealous, angry lover to &quot;Jesus in the Temple&quot; might suggest a certain level of boldness, but it doesn't take long before &quot;red hot Hell&quot; ceases to become a potent metaphor for despair, and an imagined battle between the angels of destruction and angels of redemption seems ham-fisted.\n\nWhat this all means is that, often, Angels of Destruction is one of those albums that impresses you because of what obviously good taste the band members have; it's just hard not to like a song that channels Led Zeppelin through Howl-era Black Rebel Motorcycle Club, as &quot;Jesus in the Temple&quot; does, or couple jazzy piano lines with guitar boogie on the fluid &quot;Wild West Love Song.&quot; But Marah is a band capable of being much more than just the sum of their record collection-- something that the most transcendent songs here drive home-- and so one hopes that Angels of Destruction will be remembered not just as a bizarre sonic collage, but as a stepping stone to truly remarkable music from one of America's most fascinating and frustrating rock bands.","torrent":{"xt":"urn:btih:42567ed4961e99f532901e0fdc14cf3cd2da67ad","amp;dn":"Marah+-+Angels+Of+Destruction%21+%5B2008%5D%5BEAC%2Clog%2Ccue.+FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"42567ed4961e99f532901e0fdc14cf3cd2da67ad","infoHashBuffer":{"type":"Buffer","data":[66,86,126,212,150,30,153,245,50,144,30,15,220,20,207,60,210,218,103,173]},"announce":[],"urlList":[]}}