{"title":"Engleby - Sebastian Faulks  (Unabridged)","uid":6838137,"size":313763486,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:42964745df49b5bf45c1faaa5f0cdad69fd16b19&amp;dn=Engleby+-+Sebastian+Faulks++%28Unabridged%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"rosie1966","files":17,"time":1322076700,"description":"About The Book\nMike Engleby says things that others dare not even think. When the novel opens in the 1970s, he is a university student, having survived a 'traditional' school. A man devoid of scruple or self-pity, Engleby provides a disarmingly frank account of English education.\n\nYet beneath the disturbing surface of his observations lies an unfolding mystery of gripping power. One of his contemporaries unaccountably disappears, and as we follow Engleby's career, which brings us up to the present day, we are led to ask: is Engleby capable of telling the whole truth?\n\n\nAbout The Author\nSebastian Faulks was born in Donnington in Berkshire on April 20, 1953. He became a full-time writer in 1991, he worked as a journalist. His French trilogy - The Girl at the Lion d'Or, Birdsong and Charlotte Gray (1989-1997) - established him in the front rank of British novelists. UK sales of Birdsong exceed 2,500,000 copies, and for this novel he was named &quot;Author of the Year&quot; by the British Book Awards in 1995. It is regularly voted one of the nation's favourite books. Charlotte Gray has also sold over a million copies and was filmed with Cate Blanchett in the main part. Sebastian Faulks lives with his wife in London and was awarded the CBE in 2002.\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:42964745df49b5bf45c1faaa5f0cdad69fd16b19","amp;dn":"Engleby+-+Sebastian+Faulks++%28Unabridged%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"42964745df49b5bf45c1faaa5f0cdad69fd16b19","infoHashBuffer":{"type":"Buffer","data":[66,150,71,69,223,73,181,191,69,193,250,170,95,12,218,214,159,209,107,25]},"announce":[],"urlList":[]}}