{"title":"poker run 08 Lake Cumberland","uid":4392576,"size":249086821,"categoryP":"other","categoryS":"pictures","magnet":"?xt=urn:btih:42c5b1fcb76a79c9d47fb5fe5db8677d8bf6fe82&amp;dn=poker+run+08+Lake+Cumberland&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"jeffwilson23","files":182,"time":1221257207,"description":"It was another great year at the Lake Cumberland poker run this year with fast boats and parting topless women. It did turn tragic at the start with A CRASH THAT KILLED and cancel led the poker run but the party went on...\n\nA 2003 Skater 36 catamaran based in Greenwood IN flipped on a boat wake while traveling at a speed of around 150 miles per hour. The pilot and passenger were pulled from the water by bystanders and water patrol, and rushed to the ramp at Jamestown Marina. Kevin Sellers of the Indianapolis area, died from his injuries.\n\nWitnesses say the crash occurred when Sellers hit a wave/wake while trying to turn a corner as he chased a fast boat in front of him. Sellers was attempting to pass the boat in the lead. The Skater came down &amp;#039;wrong&amp;#039; on the starboard rear and began to chine walk. The starboard bow dug in to the water, which broke the hole through the hull you see. That water forced through the starboard sponson like a cannon and blew out the transom. The weight and drag caused the boat to flip over, throw the occupants out and take on water. It partially sank, leaving only 12 feet of the bow above the water.&quot;The boat then glides through the air with a slightly nose high attitude for what must have been a hundred or more feet based on the length of the boat. At first the glide appears to be level port to starboard, but slightly nose high instead of flat as the instructor told me it should be. Mid-way through the glide the boat starts going waaaay nose high from the aerodynamic forces as it starts descending back to the surface of the water. It also begins to pitch slightly to port during the glide. This pitch and attitude causes the rear of the port sponson to impact first, with a bow high attitude of what must be close to 40 degrees. Landing at this angle and attitude at between 130-140 mph causes the port side of the stern to leave the water again and at the same time the dynamics of the impact forces the tilt of the boat to go to extreme starboard while still bow high. This causes the starboard side rear sponson to impact the water next as the boat is now rolled hard to starboard with the bow waaaaay high. The rear of the starboard sponson is the only thing in the water (except the props which are still producing forward thrust at this point) as it skims across the surface another boat length or so as it rolls even harder to starboard. Finally the full length of the boat re-enters the water rolled hard to starboard and digs in hard which causes the boat to veer violently to port and begin barrel rolling. It&amp;#039;s at that point that you can see both men being ejected. Kevin, (sitting on the now high port side) appears to leave the boat first, with Craig, sitting on the low starboard side, leaving a tiny fraction of a second later. The boat was powered by twin Sterling 1150 HP engines and reportedly capable of speeds up to 150 mph.The incident happened in the vicinity of Difficulty Creek. This is around the bend east-bound and uplake from State Dock and Wolf Creek. It is the first larger creek section of the lake on the south shore just as the lake turns left to head east. The next lake section from that point is Harmon Creek.\n\nWarning: this torrent does contain brief topless nudity.\nThere is NO full frontal or XXX rated material \n","torrent":{"xt":"urn:btih:42c5b1fcb76a79c9d47fb5fe5db8677d8bf6fe82","amp;dn":"poker+run+08+Lake+Cumberland","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"42c5b1fcb76a79c9d47fb5fe5db8677d8bf6fe82","infoHashBuffer":{"type":"Buffer","data":[66,197,177,252,183,106,121,201,212,127,181,254,93,184,103,125,139,246,254,130]},"announce":[],"urlList":[]}}