{"title":"Al Qaeda, the Islamic State, and the Global Jihadist Movement","uid":13037433,"size":2018601,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:43146b36efb84c3a4b7bd272c1fe3aadae0f60a3&amp;dn=Al+Qaeda%2C+the+Islamic+State%2C+and+the+Global+Jihadist+Movement&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bookzilla","files":1,"time":1450492072,"description":"Al Qaeda, the Islamic State, and the Global Jihadist Movement: What Everyone Needs to Know\r\n\r\n2015 pdf\r\nOn the morning of September 11, 2001, the entire world was introduced to Al Qaeda and its enigmatic leader, Osama bin Laden. But the organization that changed the face of terrorism forever and unleashed a whirlwind of counterterrorism activity and two major wars had been on the scene long before that eventful morning. In Al Qaeda, the Islamic State, and the Global Jihadist Movement: What Everyone Needs to Know, Daniel L. Byman, an eminent scholar of Middle East terrorism and international security who served on the 9/11 Commission, provides a sharp and concise overview of Al Qaeda, from its humble origins in the mountains of Afghanistan to the present, explaining its perseverance and adaptation since 9/11 and the limits of U.S. and allied counterterrorism efforts. \r\n\r\n The organization that would come to be known as Al Qaeda traces its roots to the anti-Soviet jihad in Afghanistan in the 1980s. Founded as the Soviets withdrew from Afghanistan, Al Qaeda achieved a degree of international notoriety with a series of spectacular attacks in the 1990s; however, it was the dramatic assaults on the World Trade Center and the Pentagon on 9/11 that truly launched Al Qaeda onto the global stage. The attacks endowed the organization with world-historical importance and provoked an overwhelming counterattack by the United States and other western countries. Within a year of 9/11, the core of Al Qaeda had been chased out of Afghanistan and into a variety of refuges across the Muslim world. Splinter groups and franchised offshoots were active in the 2000s in countries like Pakistan, Iraq, and Yemen, but by early 2011, after more than a decade of relentless counterterrorism efforts by the United States and other Western military and intelligence services, most felt that Al Qaeda's moment had passed. With the death of Osama bin Laden in May of that year, many predicted that Al Qaeda was in its death throes. Shockingly, Al Qaeda has staged a remarkable comeback in the last few years. In almost every conflict in the Muslim world, from portions of the Xanjing region in northwest China to the African subcontinent, Al Qaeda franchises or like-minded groups have played a role. Al Qaeda's extreme Salafist ideology continues to appeal to radicalized Sunni Muslims throughout the world, and it has successfully altered its organizational structure so that it can both weather America's enduring full-spectrum assault and tailor its message to specific audiences. \r\n\r\n Authoritative and highly readable, Byman's account offers readers insightful and penetrating answers to the fundamental questions about Al Qaeda: who they are, where they came from, where they're going-and, perhaps most critically-what we can do about it","torrent":{"xt":"urn:btih:43146b36efb84c3a4b7bd272c1fe3aadae0f60a3","amp;dn":"Al+Qaeda%2C+the+Islamic+State%2C+and+the+Global+Jihadist+Movement","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"43146b36efb84c3a4b7bd272c1fe3aadae0f60a3","infoHashBuffer":{"type":"Buffer","data":[67,20,107,54,239,184,76,58,75,123,210,114,193,254,58,173,174,15,96,163]},"announce":[],"urlList":[]}}