{"title":"Naruto Episode 3 (480p)","uid":10732669,"size":36885870,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:431a4870c444da9c63fa86c5b77388c4c4d7dd12&amp;dn=Naruto+Episode+3+%28480p%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"shareregi","files":2,"time":1407646094,"description":"Once graduated from the Ninja Academy, having drank some milk before meeting up with his former classmates, Naruto is to be assigned to be a member of a three-person squad before under going a test to obtain the rank of Genin. Naruto's team mates happen to be Sakura Haruno, whom he had a crush on, and his long-time rival Sasuke Uchiha, who Sakura has feelings for. Knowing of Sakura's feelings for Sasuke, Naruto formulated a scheme to dispose of his rival and pose as Sasuke to get close to Sakura. But at the last second, Naruto is forced to go to the bathroom while the real Sasuke somehow escapes and runs into Sakura while searching for Naruto. After expressing disgust toward Sakura when she blames the youth's stupidity on not having parents, Sasuke finds Naruto after he was forced to ditch a guilt-driven Sakura to go to the bathroom again with their confrontation short-lived. Meanwhile, Naruto's stomach pains revealed to be result of him having drank long-expired milk, Hiruzen briefs an instructor on Naruto and his team mates.","torrent":{"xt":"urn:btih:431a4870c444da9c63fa86c5b77388c4c4d7dd12","amp;dn":"Naruto+Episode+3+%28480p%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"431a4870c444da9c63fa86c5b77388c4c4d7dd12","infoHashBuffer":{"type":"Buffer","data":[67,26,72,112,196,68,218,156,99,250,134,197,183,115,136,196,196,215,221,18]},"announce":[],"urlList":[]}}