{"title":"SpeedFan 4.38","uid":4868989,"size":1867968,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:4339da721398bc449cf0880bcd6250c3b4f4be95&amp;dn=SpeedFan+4.38&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"olofolleola4","files":-1,"time":1240688143,"description":"Copied from SpeedFan Homepage:\n\n\nWhat is SpeedFan\n\nSpeedFan is a program that monitors voltages, fan speeds and temperatures in computers with hardware monitor chips. SpeedFan can even access S.M.A.R.T. info and show hard disk temperatures. SpeedFan supports SCSI disks too. \nSpeedFan can even change the FSB on some hardware (but this should be considered a bonus feature). SpeedFan can access digital temperature sensors and can change fan speeds accordingly, thus reducing noise. SpeedFan can find almost any hardware monitor chip connected to the 2-wire SMBus (System Management Bus (trademark belonging to SMIF, Inc.), a subset of the I2C protocol) and works fine with Windows 9x, ME, NT, 2000, 2003, XP and Windows Vista.\nIt works with Windows 64 bit too.\n\n\nSpeedFan can access the temperature sensors available on your motherboard and on your nVidia video card. The most widely available temperatures are from the chipset, the CPU, the ambient and from the power circuitry.\n\nModern CPUs can report their own internal temperature.\nMulti-core CPUs are often able to report temperatures from each single core. SpeedFan can access those readings and report changes.\n\nMore powerful hardware (motherboards, CPUs, video cards and hard disks) often requires more power. More power leads to more heat to dissipate.\nA proper airflow inside the computer cabinet helps to keep temperatures low.\nInside computers there are fans that create such an airflow.\nSpeedFan can report the speeds of each fan and it can even change their speed based on current temperatures. This lowers noise and improves computer experience.\n\nSpeedFan can access the voltages reported by the hardware. This can help to identify odd issues with computers resetting under stress, for example. Please, note that SpeedFan reports the voltages according to the official documentation. Sometimes hardware manufacturers use custom circuitry. In the FAQ you can find further info on this topic.\n\nAlmost every hard disk can report a set of data about its own health and status. This is called S.M.A.R.T.. Based on reported data, a hard disk failure can often be early detected. Hard disk temperature can be read too and it is useful to identify overheating components that could reduce your valuable data reliability.\nSpeedFan offers a unique feature (called &quot;In-depth online analysis&quot;) that compares your hard disk SMART data to a model derived from millions of reports.\nThis helps to better identify when a specific hard disk is outside &quot;normal&quot; values.\n\n\nSpeedFan can report health data and statistical values returned by SCSI hard disks. Such data contains the hard disk temperature too.\nHard disk temperatures are positively correlated to hard disk failures.\nThis is the reason why these information are so important.\n\nSMART data from hard disks connected to RAID (software or hardware) controllers is more difficult to be read. SpeedFan is improving RAID support and it currently properly supports software RAID (offered by Windows) and ARECA controllers.\nSupport for AMCC 3ware controllers is on its way and will soon be added.\nReliable access to RAID controllers requires support from hardware manufacturers. This is something that is being worked on.\n\n\n\nThis is a very interesting release.\nIt adds full support for a lot of new hardware. AMCC/3WARE users will be happy to see SMART data for all of their EIDE/SATA hard disks.\nFull Intel QST support has been added too (you need to RUN AS ADMIN on some OS). Support for new SMBuses (like nVidia MCP79 and SiS968) is there.\nNew chips (like the ADT7470 and the ADT7462) have been added and support has been improved for some others.\nITE IT8720 identification has been greatly improved.\nDELL support is now tested on more chipsets.\nWindows 7 32 and 64 bit has been added and verified.\nBoth the installer and the executable are now digitally signed.\nA lot of refinements, improvements and bug fixes were applied.\n\n\n\nChangelog:\n\n\nAdded full support for AMCC/3ware SMART readings\n\nAdded full support for Intel QST\n\nAdded full support for ADT7470\n\nAdded full support for ADT7462\n\nAdded full support for nVidia MCP79 SMBus\n\nAdded full support for SiS968 SMBus\n\nAdded full support for Intel i7 internal core temperature reading\n\nImproved ITE IT8720F identification\n\nAdded Fintek F71858 temperature readings\n\nPC87360, PC87362, PC87363, PC87364, PC87366 do hide unavailable readings now\n\nProbeGL5xxSM now checks some more registers to try to avoid false detections\n\nImproved CPU identification routines\n\nImproved FB-DIMM support on some Intel chipsets\n\nThe exotics tab now shows the fitness of the hard disks connected to ARECA RAID controllers too\n\nARECA and AMCC/3WARE connected hard disks are now searched before the standard channels, trying to avoid aliased, merged or fake reported SMART data\n\nAdded identification of Fintek F75125R\n\nRemoved two debug messages related to UGURU3\n\nAdded some debug code to try to support VIA CX700/VX700 SMBus\n\nDELL SUPPORT is now checked on ATI SBx00, Intel 631xESB, ICH8, ICH9 and ICH10 too\n\nDisabled DELL support on 64 bit systems\n\nAdded /NODELLSCAN command line parameter\n\nFixed daylight saving time handling in event emails\n\nAdded full support for Windows 7 32 and 64 bit\n\nFixed a minor bug that caused the main window to be minimized when clicked\n\nCONFIGURATION / SPEEDS SpinBoxes now allow manual edit\n\nAdded some scan exceptions for Asus M2N-E and for Dell 0G841G\n\nINSTALLER: improved OS identification\n\nINSTALLER: fixed the ADMIN identification issue","torrent":{"xt":"urn:btih:4339da721398bc449cf0880bcd6250c3b4f4be95","amp;dn":"SpeedFan+4.38","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4339da721398bc449cf0880bcd6250c3b4f4be95","infoHashBuffer":{"type":"Buffer","data":[67,57,218,114,19,152,188,68,156,240,136,11,205,98,80,195,180,244,190,149]},"announce":[],"urlList":[]}}