{"title":"Animaniacs Comics","uid":5358462,"size":857765109,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:43d5981315d0ff2478ccea60e6d7bb8d861dd7d3&amp;dn=Animaniacs+Comics&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"brodahisou","files":-1,"time":1266022047,"description":"Comic book series based on the animated series, distributed by Warner Bros. and produced by Amblin Entertainment.  The comedy of Animaniacs was a broad mix of old-fashioned wit, slapstick, pop culture references, and cartoon violence and wackiness.  The show featured a number of comedic educational segments that covered subjects such as history, mathematics, geography, astronomy science, and social studies, often in musical form. \n\nAnimaniacs had a large cast of characters, separated into separate segments, with each pair or set of characters acting in its own plot.  The Warners, Yakko, Wakko, and Dot, were three cartoon stars from the 1930s that were locked away in the Warner Bros. water tower until the 1990s, when they escaped.  After their escape, they often interacted with some of the human characters working at the studio including Ralph: the security guard, Dr. Otto Scratchansniff: the studio psychiatrist, and his assistant Hello Nurse: a sexy woman who would always fetch a lustful reaction from Yakko and Wakko who would respond to her entrance with an extended &quot;Hellooooooooo Nurse!&quot;  Pinky and the Brain are two genetically altered laboratory mice that continuously plotted and attempted to take over the world.  Slappy Squirrel is an aged cartoon star that would easily outwit antagonists and educate her nephew, Skippy Squirrel, about cartoon techniques.  Additional principal characters included Rita and Runt, Buttons and Mindy, Chicken Boo, Flavio and Marita (The Hip Hippos), Katie Ka-Boom, a trio of pigeons known as The Goodfeathers, and Minerva Mink.\n\nThe comic book, published by DC Comics, ran from 1995 to 2000 (59 regular monthly issues, plus two specials).  Initially, these featured all the characters except for Pinky and the Brain, who were published in their own comic series, though cameos were possible.  Eventually, the Pinky and the Brain comic was discontinued, and was merged back into the Animaniacs series, which was then titled as Animaniacs! featuring Pinky and the Brain.  The Animaniacs comic series, like the show, parodied TV and comics standards, such as Pulp Fiction and The X-Files, among others.\n\n\nReleased on http://ComicPirates.info","torrent":{"xt":"urn:btih:43d5981315d0ff2478ccea60e6d7bb8d861dd7d3","amp;dn":"Animaniacs+Comics","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"43d5981315d0ff2478ccea60e6d7bb8d861dd7d3","infoHashBuffer":{"type":"Buffer","data":[67,213,152,19,21,208,255,36,120,204,234,96,230,215,187,141,134,29,215,211]},"announce":[],"urlList":[]}}