{"title":"American Arsenal - A Century Of Waging War (2014) By Patrick Cof","uid":9567358,"size":21908382,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:44d1091e60b03924fb9795050880e45c420468ee&amp;dn=American+Arsenal+-+A+Century+Of+Waging+War+%282014%29+By+Patrick+Cof&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GoonerTPB","files":3,"time":1391546262,"description":"Format: mobi/epub/azw3\nLength: 332 pages\nGenre: History/Warfare\nDate: 1 January 2014 \n\nWhen America declared war on Germany in 1917, the United States had only 200,000 men under arms, a twentieth of the German army's strength, and its planes were no match for the German air force. Less than a century later, the United States today has by far the world's largest military budget and provides over 40% of the world's armaments.\n\nIn American Arsenal Patrick Coffey examines America's military transformation from an isolationist state to a world superpower. Focusing on fifteen specific developments, Coffey illustrates the unplanned, often haphazard nature of this transformation, which has been driven by political, military, technological, and commercial interests. \n\nBeginning with Thomas Edison's work on submarine technology, American Arsenal moves from World War I to the present conflicts in the Middle East, covering topics from chemical weapons, strategic bombing, and the nuclear standoff with the Soviet Union, to &quot;smart&quot; bombs, hand-held anti-aircraft missiles, and the Predator and other drone aircrafts. Coffey traces the story of each advance in weaponry from drawing board to battlefield, and includes fascinating portraits of the men who invented and deployed them.\n\nCoffey also examines the increasingly detached nature of modern American warfare - the ultimate goal is to remove soldiers from the battlefield entirely - which limits casualties (211,454 in Vietnam and only 1,231 in the Gulf War) but also lessens the political and psychological costs of going to war.\n\nAuthor:\n\nPatrick Coffey was born in 1945 in Chicago, Illinois and received a Ph.D. in physical chemistry from St. Louis University in 1973. He has founded or co-founded several companies that develop chemical instrumentation and software. &quot;Cathedrals of Science,&quot; his first book, won the 2008 PROSE prize for the best book on chemistry or physics published by a scholarly press. He is at present a visiting scholar at the University of California, Berkeley. ","torrent":{"xt":"urn:btih:44d1091e60b03924fb9795050880e45c420468ee","amp;dn":"American+Arsenal+-+A+Century+Of+Waging+War+%282014%29+By+Patrick+Cof","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"44d1091e60b03924fb9795050880e45c420468ee","infoHashBuffer":{"type":"Buffer","data":[68,209,9,30,96,176,57,36,251,151,149,5,8,128,228,92,66,4,104,238]},"announce":[],"urlList":[]}}