{"title":"Sara Evans - A Little Bit Stronger (Xvid-2nafish) 1080p","uid":5920634,"size":128142212,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:4550bd73495349bef6f3cae65f9654e1cba7d0a0&amp;dn=Sara+Evans+-+A+Little+Bit+Stronger+%28Xvid-2nafish%29+1080p&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1288412542,"description":"File Info:\n\nValid : Yes [AVI]\nDuration : 00:04:38\n\n[Video]\nResolution : 1920x1080\nCodec : XviD MPEG-4 codec\nFPS : 23.98\nBitRate : 3364 Kbps\nQuality Factor : 0.07 b/px\n\n[Audio]\nCodec : MPEG 1 or 2 Audio Layer 3 (MP3)\nNumber of channels : 2\nSample Rate : 48000 Hz\nBitRate : 320 Kbps\n\n\nThis video has no logos or titles.\n\n\n&quot;A Little Bit Stronger&quot; is the title of a song written by Luke Laird, Hillary Lindsey, and Hillary Scott, and recorded by American country artist Sara Evans. It was released in September 2010 and serves as the lead-off single to her sixth studio album, Stronger, which is expected for release in early 2011. The song will also be featured on the soundtrack for the 2010 movie Country Strong.\n\nThe music video, directed by Peter Zavadil, was shot on August 9, 2010 in Nashville, Tennessee, and premiered on CMT's Big New Music Weekend on October 1, 2010. In the video, Evans is shown in various locations within her spacious apartment and sitting behind the wheel of a car in the rain, appearing distraught while she performs the song. Throughout the video, scenes of her recording a video blog are included. As the video progresses, Evans makes note in her video blog that she's been getting stronger with each passing day.\n\n&quot;A Little Bit Stronger&quot; debuted at #56 on the U.S. Billboard Hot Country Songs chart for the week of October 2, 2010.\n\n&quot;A Little Bit Stronger&quot; is a mid-tempo country ballad, backed by mandolin, steel guitar, piano, and percussion. The song's female narrator describes going through her daily routine and being constantly reminded of her former love interest (&quot;I turned on the radio / Stupid song made me think of you&quot;). However, she copes with the pain (&quot;I listened to it for a minute / But then I changed it&quot;), assuring herself that each time she pushes his memory away, she gets &quot;a little bit stronger.&quot;\n\nEvans debuted the new single during her 2010 fanclub party on June 10, 2010. The song was co-written by Hillary Scott of Lady Antebellum, who also performed harmony vocals on the record.\n\nBlake Boldt of The 9513 gave the song a thumbs up, complimenting the song's &quot;flourishes of steel and piano&quot; and the &quot;authentic, organic vocal.&quot; Matt Bjorke of Roughstock gave the song 4 stars out of 5, complimenting the song's lighter production and Evans' vocals, which he felt &quot;wring every bit of emotion out of the lyrics that chronicle a woman's ability to move on after a long relationship ends.&quot; Kevin John Coyne of Country Universe awarded the song a C rating, stating that the song could've been better &quot;with a stronger melody and a more refined concept.&quot; He also compared it unfavorably to her previous singles, &quot;Fool, I'm a Woman,&quot; &quot;Cheatin',&quot; and &quot;Shame About That.&quot;\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:4550bd73495349bef6f3cae65f9654e1cba7d0a0","amp;dn":"Sara+Evans+-+A+Little+Bit+Stronger+%28Xvid-2nafish%29+1080p","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4550bd73495349bef6f3cae65f9654e1cba7d0a0","infoHashBuffer":{"type":"Buffer","data":[69,80,189,115,73,83,73,190,246,243,202,230,95,150,84,225,203,167,208,160]},"announce":[],"urlList":[]}}