{"title":"A Cheerful Gang Turns The Earth (Japan movie, 2006)","uid":3553150,"size":1469032708,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:4559777c4f49a2f5b55aa6693530b88719385859&amp;dn=A+Cheerful+Gang+Turns+The+Earth+%28Japan+movie%2C+2006%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Pemu","files":5,"time":1162916322,"description":"Based on Isaka Kotaro&amp;#039;s bestselling novel, Maeda Tetsu&amp;#039;s A Cheerful Gang Turns the Earth is a barrel of cinematic fun. This all-star heist comedy boasts the talents of Osawa Takao (Crying Out Love, In the Center of the World), Suzuki Kyoka (Blood and Bones), Sato Koichi (The Uchouten Hotel), and newcomer Matsuda Shota, son of the late Matsuda Yusaku. Quirky and colorful, A Cheerful Gang Turns the Earth was an audience favorite in Japan, and it&amp;#039;s sure to turn your world upside down.\n\nEveryone secretly wants to participate in a heist, but such a thought usually stays in the realm of imagination for normal people. One day a criminal robs a bank in Yokohama. His crime inspires four quirky customers at the bank: &quot;If he can do it, so can I!&quot; As everyone knows, any decent heist requires a dream team, so the four cheerful wannabe criminals form a gang. In the hallowed tradition of heist films, each member brings a uniquely useful skill to the table - skilled pickpocketing, precise timetelling, eloquent speech, lie-detection abilities - and together they can pull off the perfect bank robbery. And they&amp;#039;ll have tons of fun in the process. After the caper, the Cheerful Gang disbands and the members go their separate ways. However, when one of the member&amp;#039;s son is kidnapped, the team must unite once more to tackle a much more serious mission. \n\nMy Thoughts: A fun and lighthearted movie comedy movie about 4 gangs attempting a bank heist. Things don&amp;#039;t always go as they planned.\nThe film has some elements borrowed Lupin III movies such as characters, themes and some funny twists and not to mention retro feels.","torrent":{"xt":"urn:btih:4559777c4f49a2f5b55aa6693530b88719385859","amp;dn":"A+Cheerful+Gang+Turns+The+Earth+%28Japan+movie%2C+2006%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4559777c4f49a2f5b55aa6693530b88719385859","infoHashBuffer":{"type":"Buffer","data":[69,89,119,124,79,73,162,245,181,90,166,105,53,48,184,135,25,56,88,89]},"announce":[],"urlList":[]}}