{"title":"Blackguards v1.5.34047s Chapter1-5 &amp; DLC Cracked-3DM","uid":10835073,"size":4328868714,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:45bdbf76f20bf175ade5f2e1869f0c5577531810&amp;dn=Blackguards+v1.5.34047s+Chapter1-5+%26amp%3B+DLC+Cracked-3DM&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Nimbleton","files":-1,"time":1408667680,"description":"Blackguards v1.5.34047s Chapter1-5 &amp; DLC Cracked-3DM\n\nExtract 7zip &amp; play!\n\nAbout the Game\nWhat happens when the only hope of a threatened world lies not with heroes in shining armor, but in the hands of a band of misfits and criminals? Blackguards, a new turn-based strategy RPG, explores this very question. You will discover over 180 unique hex-based battlegrounds within a dark and mature story of crime, drugs, and murder.\n\nPlay as a warrior, mage or hunter and customize your character's skills as you see fit. The challenging campaign delivers a story of doubt, treason and loss. You decide the course of the story at key turning points and determine its outcome.\nKey Features\n\n    More than 180 unique battlemaps provide ever-evolving and novel challenges.\n    Make sure you have plenty of snacks, as this dark fantasy adventure has 40+ hours of exciting play time.\n    Lead up to five characters in your party to glorious victory or devastating defeat.\n    Enjoy enchanting hand drawn backdrops. They're beautiful even when your party members get their asses handed to them.\n    Your choice of spells, skills and abilities determine your battlefield tactics. Aggressive? Defensive? Tactical? It's your call how to tackle each challenging encounter!\n    Use interactive objects like bee hives or barrels to your advantage in combat, or blow yourself up by carrying a torch into flammable swamp gas.\n    Dish out some serious damage with 40 special abilities and more than 90 spells... or find yourself on the other end and get obliterated. ","torrent":{"xt":"urn:btih:45bdbf76f20bf175ade5f2e1869f0c5577531810","amp;dn":"Blackguards+v1.5.34047s+Chapter1-5+%26amp%3B+DLC+Cracked-3DM","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"45bdbf76f20bf175ade5f2e1869f0c5577531810","infoHashBuffer":{"type":"Buffer","data":[69,189,191,118,242,11,241,117,173,229,242,225,134,159,12,85,119,83,24,16]},"announce":[],"urlList":[]}}