{"title":"Emerging Food Packaging Technologies - Principles and Practice","uid":15156608,"size":8040204,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:45d29abe79c955d8d6009d9e9c20fced3f762980&amp;dn=Emerging+Food+Packaging+Technologies+-+Principles+and+Practice&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1467307537,"description":"Emerging Food Packaging Technologies - Principles and Practice - Kit L. Yam, Dong Sun Lee (WP, 2012).pdf\r\n\r\nISBN 978-1-84569-809-6\r\n\r\nThe successful employment of food packaging can greatly improve product safety and quality, making the area a key concern to the food processing industry. Emerging food packaging technologies reviews advances in packaging materials, the design and implementation of smart packaging techniques, and developments in response to growing concerns about packaging sustainability.\r\n\r\nPart one of Emerging food packaging technologies focuses on developments in active packaging, reviewing controlled release packaging, active antimicrobials and nanocomposites in packaging, and edible chitosan coatings. Part two goes on to consider intelligent packaging and how advances in the consumer/packaging interface can improve food safety and quality. Developments in packaging material are analysed in part three, with nanocomposites, emerging coating technologies, light-protective and non-thermal process packaging discussed, alongside a consideration of the safety of plastics as food packaging materials. Finally, part four explores the use of eco-design, life cycle assessment, and the utilisation of bio-based polymers in the production of smarter, environmentally-compatible packaging.\r\n\r\nWith its distinguished editors and international team of expert contributors, Emerging food packaging technologies is an indispensable reference work for all those responsible for the design, production and use of food and beverage packaging, as well as a key source for researchers in this area.\r\n\r\nReviews advances in packaging materials, the design and implementation of smart packaging techniques, and developments in response to growing concerns about packaging sustainability\r\nConsiders intelligent packaging and how advances in the consumer/packaging interface can improve food safety and quality\r\nExamines developments in packaging materials, nanocomposites, emerging coating technologies, light-protective and non-thermal process packaging and the safety of plastics as food packaging materials","torrent":{"xt":"urn:btih:45d29abe79c955d8d6009d9e9c20fced3f762980","amp;dn":"Emerging+Food+Packaging+Technologies+-+Principles+and+Practice","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"45d29abe79c955d8d6009d9e9c20fced3f762980","infoHashBuffer":{"type":"Buffer","data":[69,210,154,190,121,201,85,216,214,0,157,158,156,32,252,237,63,118,41,128]},"announce":[],"urlList":[]}}