{"title":"Jazziz Collections - Volume One TQMP","uid":4773756,"size":455865533,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:463dea8bdb151e74a091c4940aa8dca92689427d&amp;dn=Jazziz+Collections+-+Volume+One+TQMP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"zootallure","files":38,"time":1237138072,"description":"22 years back, working in merchant marine, we berthed in Baltimore, and, as in every port, I visited first...(you can guess 3 times:-) )....bingo!...a music store! My basket was full soon and the owner of the shop gave me this cd as a present. It's a quite  good compilation! Considering all the genres in contemporary jazz and despite the enormous possibilities offered by electronics, acousticity still lends vitality. The tone color of an acousitc guitar, piano, saxophone or naturall precussion instrument remains unparalleled. Though interesting and enduring music continues to support this logic, a workable integration of acoustics and electronic bodes well for the future of jazz. It is this thematic concept that reflects JAZZIZ Collection Volume One.\n\nBrought to you by TQMP. (The Quality Music Project)\n\nIn this project we, fellow pirates share only quality items out of our CD collections in lossless FLAC and include covers, especially for those who like to burn and print and put it in a nice and shiny jewelcase. Well, you all know the drill :)\n\nRipped by Exact Audio Copy V0.99 from 01-23-2008, encoded to FLAC with 1024kb/s\nGet Your Free Copy of the EAC and FLAC suite at:\nhttp://www.exactaudiocopy.de/en/index.php/resources/download/\n\nPlease feel free to join the TQMP project!\nThe &quot;rules&quot; are simple: Rip your CD (no 1980's cassettetapes or vinylrips please!) in lossless format AND include artwork. Include cue- and logfiles for the purists and the TQMP searchtag in your title, so it can easily be found. (Yes, on Google as well..)\n\n\nSay Ã‚Â»thank youÃ‚Â« by seeding... just seed, it is not harmful to your health :-)","torrent":{"xt":"urn:btih:463dea8bdb151e74a091c4940aa8dca92689427d","amp;dn":"Jazziz+Collections+-+Volume+One+TQMP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"463dea8bdb151e74a091c4940aa8dca92689427d","infoHashBuffer":{"type":"Buffer","data":[70,61,234,139,219,21,30,116,160,145,196,148,10,168,220,169,38,137,66,125]},"announce":[],"urlList":[]}}