{"title":"What I Like About Jew - Unorthodox (2006 - comedy) [V2]","uid":8069242,"size":74224571,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:46fa466c3763bea9380f0d90b4d8aa8a5c46b5c6&amp;dn=What+I+Like+About+Jew+-+Unorthodox+%282006+-+comedy%29+%5BV2%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"rambam1776","files":-1,"time":1359235799,"description":" &lt;a href=&quot;http://www.allmusic.com/album/unorthodox-mw0001440780&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.allmusic.com/album/unorthodox-mw0001440780&lt;/a&gt;\n\n---------------------------------------------------------------------\n                       Tracklisting\n---------------------------------------------------------------------\n\n   1. What I Like About Jew - Hot Jewish Chicks               [03:33]\n   2. What I Like About Jew - Intro 1                         [00:19]\n   3. What I Like About Jew - They Tried To Kill Us (We Survived, Let's Eat)[02:59]\n   4. What I Like About Jew - Jews For Jesus                  [04:13]\n   5. What I Like About Jew - Intro 2                         [00:22]\n   6. What I Like About Jew - A Little Off The Top            [02:46]\n   7. What I Like About Jew - Jews Jews Jews                  [03:31]\n   8. What I Like About Jew - JDate                           [03:33]\n   9. What I Like About Jew - Today I Am A Man                [03:56]\n  10. What I Like About Jew - I'm Better Looking (Than The Guy You're Going Out With)[03:48]\n  11. What I Like About Jew - Taller Than Jesus               [04:14]\n  12. What I Like About Jew - Intro 3: Al Goldstein           [00:29]\n  13. What I Like About Jew - The Porno Made Me Do It         [03:44]\n  14. What I Like About Jew - Intro 4                         [00:11]\n  15. What I Like About Jew - Reuben The Hook-Nosed Reindeer  [03:31]\n  16. What I Like About Jew - Hanukah With Monica             [02:33]\n  17. What I Like About Jew - Intro 5                         [00:09]\n  18. What I Like About Jew - (It's Good To Be) A Jew At Christmas[02:03]\n\nPlaying Time.........: 46:02\n\n\n&quot;I will not touch my shvantz in temple,&quot; is the mantra the poor yarmulke-wearing schmuck on the cover of Rob Tannenbaum and Sean Altman's hilarious debut disc, Unorthodox, appears forced to print into perpetuity on a scroll the size of fellow-Jew Madonna's yoga mat. If that's too ribald an image for you, you'll barely get beyond the opening bars of What I Like About Jew's first song without clicking off your CD player in a dither. But oh how you'll miss out. Here's the disc Adam Sandler would have made if he were less concerned about scoring one for the Jews come Christmas time than with cracking people up: &quot;JDate&quot; trolls the online dating site and urges you to sign up and &quot;seal your J-fate&quot; -- &quot;if you have a bad time, you can go home and J-masturbate&quot;; &quot;Today I Am a Man&quot; tackles the newly bar-mitzvahed (&quot;I've got two pubic hairs and a three-piece suit/Today I am a man&quot;); and &quot;Hot Jewish Chicks,&quot; maybe the funniest track on a musical revue that has some real-music moments, surveys a room full of anti-shiksas and observes that one, Sarah, &quot;likes to cook and read the Torah/But watch her dance -- she puts the 'whore' in hora.&quot; A bris gets the treatment (&quot;A Little off the Top&quot;), and even reindeers aren't immune (&quot;Reuben the Hook-Nosed Reindeer&quot;; no stereotype is too contemptible to kick around, no slang term too taboo. Matisyahu these guys are not -- the New York weisenheimers your Jewish mother warned you about is more like it. But if you can take a joke, Unorthodox outdoes decades' worth of priest-rabbi-and-monk punchlines put together. If you find yourself verklempt, here's your antidote.","torrent":{"xt":"urn:btih:46fa466c3763bea9380f0d90b4d8aa8a5c46b5c6","amp;dn":"What+I+Like+About+Jew+-+Unorthodox+%282006+-+comedy%29+%5BV2%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"46fa466c3763bea9380f0d90b4d8aa8a5c46b5c6","infoHashBuffer":{"type":"Buffer","data":[70,250,70,108,55,99,190,169,56,15,13,144,180,216,170,138,92,70,181,198]},"announce":[],"urlList":[]}}