{"title":"Gooische Vrouwen (2011) HQ FullPAL 576p x264 AC3 5.1 Efl","uid":6695808,"size":872566773,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:47e307eac2a93d835b246e9bb296b9a7fc4f8bed&amp;dn=Gooische+Vrouwen+%282011%29+HQ+FullPAL+576p+x264+AC3+5.1+Efl&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bobdevis","files":-1,"time":1316773956,"description":"Video: anamorphic, display resolution 1024x552\nVideo: MPEG4 Video (H264) 720x552 (128:69) 25.00fps [English (Video 1)]\nAudio: Dolby AC3 48000Hz 6ch [Dutch (Audio 1)]\n\nSubtitle: VobSub [Dutch (Subtitle 1)]\nSubtitle: VobSub [Dutch (Subtitle 2)]\nSubtitle: VobSub [Dutch (Subtitle 3)]\nSubtitle: VobSub [Dutch (Subtitle 4)]\nSubtitle: VobSub [English (Subtitle 5)]\nSubtitle: VobSub [English (Subtitle 6)]\n\nGooische Vrouwen (2011) \n\nNederland\nKomedie\n105 minuten\n\ngeregisseerd door Will Koopman\nmet Linda de Mol, Tjitske Reidinga en Susan Visser\n\n\nCheryl en Martin zijn weer terug. Na een behoorlijke financiÃƒÂ«le dip is Martin\\'s nieuwe plaat een groot succes en ze verruilen hun rijtjeswoning voor een nieuwe villa in \\'t Gooi. Het leven van Cheryl en haar vriendinnen verloopt alles behalve soepel. Claire\\'s wereld stort in als ze te horen krijgt dat haar dochter met haar gezin voor een aantal jaren naar Burkina Faso verhuist om daar ontwikkelingshulp te verlenen. Haar kleinzoon Boy is haar alles en ze is ontzettend verdrietig bij het vooruitzicht hem te moeten missen. Anouk heeft moeilijkheden met haar dochter Vlinder. Vlinder heeft ontdekt dat haar moeder fraude pleegt en noemt haar tot overmaat van ramp ook nog een slet. Roelien staat alleen in haar strijd voor het milieu en voelt zich niet gesteund door haar man en stiefkinderen. Cheryl wordt weer eens geconfronteerd met het eeuwige probleem met Martin. Die wordt weer eens afgeleid door al het vrouwelijke schoon om hem heen en kan zich zoals gebruikelijk niet beheersen. Hij heeft het erg druk met zijn succesvolle comeback en Cheryl voelt zich daardoor behoorlijk verwaarloosd. Zelfs na haar borstvergroting krijgt ze niet de aandacht die ze verdient en als ze met eigen ogen ziet dat Martin weer vreemd gaat, is dat de druppel die de emmer doet overlopen. De dames besluiten dat het tijd is voor vakantie, pakken hun koffers en vertrekken naar Parijs om daar te werken aan hun innerlijk welzijn. Terwijl de mannen aan het thuisfront de boel in het honderd laten lopen, ontdekken de vier vrouwen het grootste belang in hun leven. En dat is vriendschap.\n\nWie had gedacht dat de filmversie van de zo succesvolle televisieserie zulke hoge ogen zou gooien in de bioscoop. Het is altijd een uitdaging om een serie te vertalen naar de lengte van een speelfilm en gezien de waanzinnig goede score zijn de makers daar zeer goed in geslaagd. Het zou ons dan ook zeer verbazen als dit succes geen vervolg \ngaat krijgen en daar zullen miljoenen fans zeker niet rauwig om zijn.\n\n\nEnglish\n\nCheryl and Martin are back. After quite a financial dip, Martin \\ 's new album a great success and they exchange their terraced house in a new villa \\' t Gooi. The life of Cheryl and her friends goes anything but smoothly. Claire \\ 's world falls apart when she hears that her daughter and her family for several years to move to Burkina Faso where development assistance. Her grandson Boy is her everything and she is very sad at the prospect of having to miss him. Anouk has trouble with her daughter Butterfly. Butterfly has discovered that her mother calls her to commit fraud, and worse still a slut. Roelien stands alone in its struggle for the environment and does not feel supported by her husband and stepchildren. Cheryl is again confronted with the perennial problem with Martin. Which is once again distracted by all the beautiful women around him and as usual can not control. He is very busy with his successful comeback and Cheryl will feel quite neglected. Even after her breast she gets the attention it deserves and as with their own eyes see Martin again strange thing is that the straw that breaks the camel's back. The ladies decide it's time for vacation, pack their bags and leave for Paris to work there with their inner wellbeing. While the men on the home front the whole thing run in the hundred, the four women discover the greatest importance in their lives. And that's friendship.\n\nWho would have thought that the movie version of hit series such as high eye would throw in the cinema. It is always a challenge to a series translate to the length of a feature film and given the insanely high score because the authors are very successful. We would therefore be very surprised if this success does not follow\ngoing to get millions of fans and there will certainly not for his rawness.\n &lt;a href=&quot;\nhttp://www.moviemeter.nl/film/72068&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.moviemeter.nl/film/72068&lt;/a&gt; &lt;a href=&quot;\nhttp://www.imdb.com/title/tt1700423/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt1700423/&lt;/a&gt;\n","torrent":{"xt":"urn:btih:47e307eac2a93d835b246e9bb296b9a7fc4f8bed","amp;dn":"Gooische+Vrouwen+%282011%29+HQ+FullPAL+576p+x264+AC3+5.1+Efl","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"47e307eac2a93d835b246e9bb296b9a7fc4f8bed","infoHashBuffer":{"type":"Buffer","data":[71,227,7,234,194,169,61,131,91,36,110,155,178,150,185,167,252,79,139,237]},"announce":[],"urlList":[]}}