{"title":"Message From Space / Uchu kara no messeji","uid":3997307,"size":4236806752,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:480c24a0c321e0f1f58c397c573da33bd06c0415&amp;dn=Message+From+Space+%2F+Uchu+kara+no+messeji&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"carsten2","files":11,"time":1201381458,"description":"Message From Space / Uchu kara no messeji\nIn what probably amounts to the most blatant rip-off of Star Wars to date, Japan\\&amp;#039;s Message from Space (Uchu kara no messeji) from 1978 features a super-fortress flyover, a white-clad princess, rogue star pilots, dogfights in space, a plucky robot, an intergalactic watering hole, a planet-killing space-station-moon, blasters, swords, armored minions, and a climactic trench-run to deliver a torpedo into an open shaft... ok, it\\&amp;#039;s a tunnel, but the similarity is unmistakable.\n\nMessage from Space, while attempting to emulate the style of Star Wars, does vaguely attempt a unique storyline. \n\nKing Kaiba from the peaceful planet of Jillucia has sent out eight Liabe holy seeds into space, each to find a warrior to defend from the evil Gavanas, who have nearly destroyed Jillucia. The warriors band together to overcome the \\&quot;galactic empire\\&quot; through several Star Wars-type scenarios, including sword fights, blaster exchanges, droids that save the day, and of course the obligatory \\&quot;tunnel run\\&quot;.\n\n------------------------------------------------------------------------------\n\nThis is my own made DVD. It is made from the France DVD rip and the VHS english soundtrak. The picture and sound is 8 /10.\n\nThis rip is made with DVD shrink.\n\nI have made a DVD cover and a text about the similarities between Star Wars and Message From Space in PDF format also included in this torrent.","torrent":{"xt":"urn:btih:480c24a0c321e0f1f58c397c573da33bd06c0415","amp;dn":"Message+From+Space+%2F+Uchu+kara+no+messeji","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"480c24a0c321e0f1f58c397c573da33bd06c0415","infoHashBuffer":{"type":"Buffer","data":[72,12,36,160,195,33,224,241,245,140,57,124,87,61,163,59,208,108,4,21]},"announce":[],"urlList":[]}}