{"title":"Democracy Now - 07 feb 2012","uid":7015804,"size":458229687,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:48b5c887dd6a7984aada674f0cc74b3cc99e2c88&amp;dn=Democracy+Now+-+07+feb+2012&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":1,"time":1328653458,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Feb 07, 2012\n\n- Syria: Homs Under Siege as Russian Minister Arrives\n- Reversing Stance, Obama Asks Wealthy to Support His Super PAC\n- Gingrich Blasts Romney as Voters Head to Polls in Three States\n- Catholics Vow to Fight Obama on Birth Control &quot;In the Streets&quot;\n- FAA Spending Bill Enables Police Use of Domestic Surveillance Drones\n- Egypt: Talks Canceled as U.S. Threatens to Withhold Aid\n- U.S. Orders Sanctions on Iranian Central Bank\n- Palestinian Leaders Agree to Form Unity Government\n- Investigation: Congress Members Steered $300 Million to Projects Near Their Properties\n- 500 Protest NYPD Fatal Shooting of Unarmed Teenager\n\n\nSpecial reports\n\n- A Struggle for Regional Supremacy: Syria Conflict Escalates as World Powers Debate Assad's Future\n\nSyria is seeing some of the worst violence of the 11-month uprising against Bashar al-Assad amid an ongoing international standoff over how to respond. Assad's forces have launched what appears to be one of their fiercest assaults on the flashpoint city of Homs to date. Both the United States and Britain have closed their embassies in the Syrian capital of Damascus and withdrawn diplomatic personnel, citing safety fears. As the crisis escalates, Russia and China are facing criticism for blocking a U.N. Security Council resolution backed by the United States and Arab League calling for a political transition in Syria. To discuss the situation in Syria, we're joined by Patrick Seale, a leading British writer on the Middle East and author of &quot;Asad: The Struggle for the Middle East.&quot; &quot;It's at least a two- or possibly a three-stage crisis. Internally in Syria, the situation is getting worse by the day,&quot; Seale says. &quot;At a higher level, there is a struggle between the United States, on the one hand, and its allies, and its opponents like Russia and China... Then there's a third level, possibly, of Arab Gulf states like Qatar, for example, even Saudi Arabia behind it, who are obsessed and worried by Iran, and they think that Iran might stir up Shia communities in the region.&quot;\n\n\n- U.S. Maintains Embargo of Cuba After 50 Years, Despite International Condemnation\n\nThere are no commemorations planned in Washington, D.C., but today marks the 50th anniversary of the U.S. embargo against Cuba - the longest-running embargo in the world. On February 7, 1962, President John F. Kennedy formally expanded the harsh regime of commercial and financial sanctions against Cuba that have continued to the present day. The embargo has been solidly bipartisan, notably intensifying under the Helms-Burton Act of 1996, which was passed by a Republican-controlled Congress and signed into law by President Bill Clinton, a Democrat. The United States has targeted Cuba in defiance of widespread international condemnation. &quot;This has been the longest enduring embargo we have had in the world and the question is, why is it still there? What good has it done? Of course it has squeezed the Cuban people,&quot; said Michael Ratner, president emeritus of the Center for Constitutional Rights, who has been involved in efforts to challenge the U.S. embargo against Cuba for many years.\n\n\n- &quot;Who Killed Che? How the CIA Got Away With Murder&quot;: New Book Ties Johnson Admin to Guevara's Death\n\nMichael Ratner and Michael Steven Smith are the co-authors of a new book about the U.S. role in the killing of Cuban revolutionary, Ernesto &quot;Che&quot; Guevara. Born in Argentina in 1928, Che rose to international prominence as one of the key leaders of the 1959 Cuban Revolution that overthrew U.S.-backed dictator Fulgencio Batista. After a period in the new Cuban government leadership, Che aimed to spark revolutionary activity internationally. On October 8, 1967, he was captured by Bolivian troops working with the CIA. He was executed one day later. In their book, &quot;Who Killed Che?&quot; Ratner and Smith draw on previously unpublished government documents to argue the CIA played a critical role in the killing. &quot;The line of the [U.S.] government was that, 'The Bolivians did it, we couldn't do anything about it.' That's not true,&quot; Smith said. &quot;This whole operation was organized out of the White House by Walt Whitman Rostow and the CIA.&quot; On Che's significance, Ratner said, &quot;Che became a symbol for revolutionary change. ... He still remains that today. If you go to Tahrir Square or Occupy Wall Street, people are wearing Che T-shirts because they understand their obligation, their necessity is to take on the 1 percent. That is what Che was about. I think that is why he is such a hero for people in the streets today.&quot;\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:48b5c887dd6a7984aada674f0cc74b3cc99e2c88","amp;dn":"Democracy+Now+-+07+feb+2012","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"48b5c887dd6a7984aada674f0cc74b3cc99e2c88","infoHashBuffer":{"type":"Buffer","data":[72,181,200,135,221,106,121,132,170,218,103,79,12,199,75,60,201,158,44,136]},"announce":[],"urlList":[]}}