{"title":"The Asphalt Jungle 1950 DVDrip XVID avi [PLEASE SEED WHEN YOU FI","uid":3818366,"size":940132864,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:49007ef43765906263b7bbc1827228c8f8534ad0&amp;dn=The+Asphalt+Jungle+1950+DVDrip+XVID+avi+%5BPLEASE+SEED+WHEN+YOU+FI&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"sheffboy","files":1,"time":1190698768,"description":"[img]http://img229.imageshack.us/img229/3163/asph3an8qu9.th.jpg[/img]\n\nA real classic film!\n\nDescription:\n\nIMDB-link......: http://imdb.com/title/tt0042208/[pre]\nYear.............: 1950\nCountry..........: USA\nAudio............: Mono 112 kbps mp3\nSubtitles........: None\nVideo Format.....: Fullframe 4:3 \nProgram..........: XviD 1.1.2 Final\nBit Rate.........: 136 kbps @ 24 bit\n\n\nDirector: John Huston\n\nProduction: M.G.M.; black and white; running time: 105 minutes; released August 1950.\n\nProducer: Arthur Hornblow Jr.; screenplay: Ben Maddow and John Huston, from the novel by W. R. Burnett; photography: Harold Rosson; editor: George Boemler; sound: Douglas Shearer; art directors: Cedric Gibbons and Randall Duell; music: Miklos Rosza.\n\nCast: Sterling Hayden (Dix Handley); Louis Calhern (Alonzo D. Emmerich); Jean Hagen (Doll Conovan); James Whitmore (Gus Minissi); Sam Jaffe (Doc Riedenschneider); John McIntire (Police Commissioner Hardy); Marc Lawrence (Cobby); Barry Kelley (Lt. Dietrich); Anthony Caruso (Louis Ciavelli); Teresa Celli (Maria Ciavelli); Marilyn Monroe (Angela Phinlay).\n\nWith The Asphalt Jungle, John Huston laid down the definitive pattern of the heist movie. A gang of criminals, each with a particular skill, is gathered together; the job (typically a robbery) is pulled with measured professionalism; but ill-chance, or internal dissension, undermines the gang\\&amp;#039;s success, bringing them to diaster and death. The formula was to be taken up, and creatively reworked any number of ways, by directors as varied as Kubrick (The Killing), Mackendrick (The Ladykillers), Becker (Touchez pas au grisbi), Dassin (Rififi) and Monicelli (I soliti ignoti); but Huston\\&amp;#039;s film still sustains comparison with any of its successors.\n\nThe Asphalt Jungle also broke new ground in presenting crime as an occupation like any other, carried out not by the preening megalomaniacs of 1930s gangster movies, nor by the disillusioned antiheroes of the 1940s, but by ordinary people motivated by everyday preoccupations and small private ambitions. The expert cracksman (Anthony Caruso) has \\&quot;mouths to feed, rent to pay\\&quot;; the tough hood, Dix Handley (Sterling Hayden), dreams of buying back the Kentucky farm of his childhood. Crime, muses Louis Calhern\\&amp;#039;s crooked lawyer in the script\\&amp;#039;s most famous line, \\&quot;is only a left-handed form of human endeavor.\\&quot;","torrent":{"xt":"urn:btih:49007ef43765906263b7bbc1827228c8f8534ad0","amp;dn":"The+Asphalt+Jungle+1950+DVDrip+XVID+avi+%5BPLEASE+SEED+WHEN+YOU+FI","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"49007ef43765906263b7bbc1827228c8f8534ad0","infoHashBuffer":{"type":"Buffer","data":[73,0,126,244,55,101,144,98,99,183,187,193,130,114,40,200,248,83,74,208]},"announce":[],"urlList":[]}}