{"title":"Life  Circles (Pressure Sounds) [FLAC] {MKOP}","uid":7595649,"size":414111339,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:49490746f711699741dcc472b9de7b1e7ec55c12&amp;dn=Life++Circles+%28Pressure+Sounds%29+%5BFLAC%5D+%7BMKOP%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mudmashers","files":21,"time":1346685286,"description":"Life Goes in Circles~Sounds from the Talent Corporation 1974-79 (Pressure Sounds) [FLAC] {MKOP}\n\nTommy Cowan isn't a household name outside of Jamaica, but on that island he is a legend. He was a member of the rocksteady group the Jamaicans, he toured the world as Bob Marley's business manager, and he's the one most responsible for the legendary Reggae Sunsplash series of concerts. Life Goes in Circles focuses on his Talent Corporation enterprise, a collection of artists, promoters, and imprints that the self-proclaimed &quot;catalyst and facilitator&quot; gathered to promote Jamaican music. One of the many hats Cowan wore was as liaison between the American music business and the Jamaican music business. When outside R&amp;B began to take serious hold on the island, Cowan created the Talent Corporation to battle the monster he'd helped create, so it's no big surprise the roots music here is deep and true. Devon Irons lays down the Rastafarian spirit over the slow and steady riddim of &quot;Jerusalem&quot; -- here in its extended version -- while a golden era Jacob Miller makes it ominous with chaotic dub effects and lyrics where &quot;undertakers not take no rest&quot; on his &quot;Ghetto on Fire.&quot; While there's an abundance of sufferer's songs and serious dread -- along with versions and dubs -- it's not all heaviness since Cowan the promoter was well aware of the power of popular music. Desi Roots looks for a &quot;little girl to school tonight&quot; and turns the &quot;Money in My Pocket&quot; riddim and melody into a reggae &quot;Love Is the Drug&quot; on &quot;School Tonight.&quot; Softer still is Dennis Brown's positive and comforting title track, and there's just a bit of polished lovers rock with Ken Boothe offering &quot;Speak Softly Love.&quot; Closing the collection is a trilogy of tracks based on the &quot;Hit Song&quot; riddim. Roman Stewart lays out the idea of empowerment through successful music on his main track while DJ Dillinger skips any metaphor and name-checks the Talent Corporation on his version. &quot;I man go up a Talent Corporation&quot; he says, &quot;To treat the generation/To this musical inspiration,&quot; explaining the who and the why with proper spirit. It's nice to see Pressure Sounds expanding on Dillinger's tribute because the music and Cowan's undying allegiance to Jamaican music deserve it.~David Jeffries (Allmusic)\n\n01. Devon Irons - Jerusalem (Extended Version)\n02. The Abyssinians - Love Comes And Goes\n03. The Abyssinians - Love Comes And Goes Version\n04. Jacob Miller - Ghetto On Fire\n05. Little Madness - Mother Country\n06. Little Madness - Mother Country Dub Side\n07. Desi Roots - School Tonight\n08. Augustus Pablo - The Way\n09. Earl Zero - City Of The Weak Heart\n10. The Circles - Dib The Weak Heart\n11. Leroy Smart - The Road Is Tough\n12. Dennis Brown - Life Goes In Circles\n13. Two Rasta Man - False Rumour\n14. King Tubby - False Rumour Version\n15. Talent Crew - King Tubby's Version\n16. Earl Zero - Please Officer\n17. Ken Boothe - Speak Softly Love\n18. Roman Stewart - Hit Song\n19. Dillinger - Natty Sings A Hit Song\n20. Dillinger - Dub Songs\n\nMusic Keep On Playing*Thank You Seeders","torrent":{"xt":"urn:btih:49490746f711699741dcc472b9de7b1e7ec55c12","amp;dn":"Life++Circles+%28Pressure+Sounds%29+%5BFLAC%5D+%7BMKOP%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"49490746f711699741dcc472b9de7b1e7ec55c12","infoHashBuffer":{"type":"Buffer","data":[73,73,7,70,247,17,105,151,65,220,196,114,185,222,123,30,126,197,92,18]},"announce":[],"urlList":[]}}