{"title":"The Life and Work of Professor J. W. Gregory FRS (1864-1932)","uid":6517630,"size":10279903,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4abe2ae84e31d1b1f1bc89a81d4fe7504a21383c&amp;dn=The+Life+and+Work+of+Professor+J.+W.+Gregory+FRS+%281864-1932%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"_F1_","files":-1,"time":1309883829,"description":"B. E. Leake, &quot;Memoir 34 - The Life and Work of Professor J. W. Gregory FRS (1864-1932): Geologist, Writer and Explorer&quot;\n Publisher: Geological Society of London | 2011 | ISBN: 1862393230 | PDF | 232 pages | 10.7 MB\n\n Gregory's remarkable career and his scientific work are detailed and critically assessed. Accounts of his heroic 1893 expedition to the Rift Valley (a term he coined) in Kenya (now the Gregory Rift), his first crossing of Spitzbergen, and his resignation as Leader of the first British Antarctic Expedition of 1901, when racing to the Pole under Scott became the priority, draw on unpublished letters. While in Melbourne he published on mining geology and a series of geography textbooks. His 1901 Lake Eyre expedition in Central Australia initiated the phrase 'The Dead Heart of Australia' and controversy over the source of artesian water. In the Chair of Geology in Glasgow from 1904, he built up the largest first-year geology class in the UK, over 400 students. He worked in every field of geology and every continent except Antarctica. He was also involved with the search for a 'homeland' for the Jews in Libya and Angola. He shrewdly realized that Wegener's Continental Drift Theory erroneously supposed that the Pacific Ocean was wider than now before the Atlantic opened. This led to his influential rejection of Continental Drift. He drowned in Peru traversing the Andes having published over 30 books and nearly 400 articles.\n\n The Geological Society of London\n\n Founded in 1807, the Geological Society of London is the oldest geological society in the world, and one of the largest publishers in the Earth sciences.\n\n The Society publishes a wide range of high-quality peer-reviewed titles for academics and professionals working in the geosciences, and enjoys an enviable international reputation for the quality of its work.\n\n The many areas in which we publish in include:\n\n -Petroleum geology\n -Tectonics, structural geology and geodynamics\n -Stratigraphy, sedimentology and paleontology\n -Volcanology, magmatic studies and geochemistry\n -Remote sensing\n -History of geology\n -Regional geology guides","torrent":{"xt":"urn:btih:4abe2ae84e31d1b1f1bc89a81d4fe7504a21383c","amp;dn":"The+Life+and+Work+of+Professor+J.+W.+Gregory+FRS+%281864-1932%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4abe2ae84e31d1b1f1bc89a81d4fe7504a21383c","infoHashBuffer":{"type":"Buffer","data":[74,190,42,232,78,49,209,177,241,188,137,168,29,79,231,80,74,33,56,60]},"announce":[],"urlList":[]}}