{"title":"Coats &amp; Schauberger - Nature as teacher - New principles in the","uid":3494268,"size":1482856,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4cdb0eab1bcbd16ee4ac8653a7f27f5dac4fe74f&amp;dn=Coats+%26+Schauberger+-+Nature+as+teacher+-+New+principles+in+the&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"red_gonzo","files":1,"time":1149938131,"description":"British architect Callum Coats edited and translated this book from Viktor Schauberger&amp;#039;s works with the full title Nature as teacher - New principles in the working of nature (1998). Schauberger, a famous austrian natural philosopher, predicted the ecological catastrophes which are occuring all around us and proposed the solution - return to the principles of mother nature.  185 pages, some pictures.\n\nFrom the backcover:\nToday we are standing helpless and perplexed. Wih no glimmer of improvement anywhere in sight, we feel hopelessly propelled towards a folrorn future. It is understandable therefore than an increasing number of people, sick and tired of this insane activity, are now seeking ways to return to mother nature. Viktor Schauberger (1885-1958)\nViktor Schauberger was one of the first geniune environmentalists. In the 1930s he was predicting ecological catastrophe when noone else could see it coming. Schauberger is now being proved right. He foresaw:\n-Global warming and its devastating consequences\n-Increasing violence and lawlessness as the direct result of destructive methods which block nature&amp;#039;s energies and balance\n-The destruction of the world&amp;#039;s forests and ecosystems\nThis, and the fact that he developed free energy machines through harnessing the magical processes of nature, has made Viktor Schauberger truly a man of our times.\nThis volume gives tremendous insight into what is happening on the Earth today and presents practical solutions on how we may yet save our precious world. Most telling is Schauberger&amp;#039;s elucidation of the vital natural cycles that modern unthinking technologies have interrupted and harmed, sometimes irreparably.\n","torrent":{"xt":"urn:btih:4cdb0eab1bcbd16ee4ac8653a7f27f5dac4fe74f","amp;dn":"Coats+%26+Schauberger+-+Nature+as+teacher+-+New+principles+in+the","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4cdb0eab1bcbd16ee4ac8653a7f27f5dac4fe74f","infoHashBuffer":{"type":"Buffer","data":[76,219,14,171,27,203,209,110,228,172,134,83,167,242,127,93,172,79,231,79]},"announce":[],"urlList":[]}}