{"title":"The Need For Speed by relentlesstech (1996)","uid":9342080,"size":570626048,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:4d261794924c71f6764eef765e8ae7de09b96778&amp;dn=The+Need+For+Speed+by+relentlesstech+%281996%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"relentlesstech","files":-1,"time":1386954949,"description":"The original Need for Speed was released for 3DO in 1994 with versions released for the PC (DOS) (1995), PlayStation and Saturn (1996) following shortly afterwards. The Need for Speed and its Special Edition were the only games in the series to support DOS. Subsequent releases for the PC run only within Windows.\n\nThe first installment of the NFS was one of only two serious attempts by the series to provide a realistic simulation of car handling and physics without arcade elements (the other being Porsche Unleashed). Electronic Arts teamed up with automotive magazine Road &amp; Track to match vehicle behavior, including the mimicking of the sounds made by the vehicles' gear control levers. The game also contained precise vehicle data with spoken commentary, several &quot;magazine style&quot; images of each car interior and exterior and even short video-clips highlighting the vehicles set to music.\n\nMost cars and tracks are available at the beginning of the game, and the objective is to unlock the remaining locked content by winning tournaments. The first version featured chases by police cars, which remained a popular theme throughout the series - the so-called Hot Pursuit editions (Need for Speed III: Hot Pursuit, Need for Speed: High Stakes, Need for Speed: Hot Pursuit 2, Need for Speed: Most Wanted, Need for Speed: Carbon, Need for Speed: Undercover, Need for Speed: Hot Pursuit (2010)) and have sold better in the marketplace than intervening versions. The initial version also featured an obnoxious opponent who taunted the player if the computer won the race or the player is arrested (if the player is ticketed several times).\n\n\nPLEASE KEEP SEEDING TO KEEP THE TORRENT COMMUNITY ALIVE!","torrent":{"xt":"urn:btih:4d261794924c71f6764eef765e8ae7de09b96778","amp;dn":"The+Need+For+Speed+by+relentlesstech+%281996%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4d261794924c71f6764eef765e8ae7de09b96778","infoHashBuffer":{"type":"Buffer","data":[77,38,23,148,146,76,113,246,118,78,239,118,94,138,231,222,9,185,103,120]},"announce":[],"urlList":[]}}