{"title":"Victory [1981] John Huston","uid":5767292,"size":726896315,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:4e5e117bf6822ff00b372fd24afc331d5fa60d0c&amp;dn=+Victory+%5B1981%5D+John+Huston&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ThorntonWilde","files":-1,"time":1281917389,"description":" &lt;a href=&quot;http://bayimg.com/hAomaAAcG&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://bayimg.com/hAomaAAcG&lt;/a&gt;\n\nVictory (1981) \n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0083284/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0083284/&lt;/a&gt;\n\nEscape to Victory, known simply as Victory in North America, is a 1981 film about Allied prisoners of war who are interned in a German prison camp during World War II. The film was directed by John Huston and stars Michael Caine, Sylvester Stallone and Max von Sydow.\n\nThe film received great attention upon its theatrical release, as it also starred football superstars Bobby Moore, Osvaldo Ardiles, Kazimierz Deyna, Paul Van Himst and PelÃƒÂ©. Numerous Ipswich Town F.C. players were also in the film, including John Wark, Russell Osman, Laurie Sivell, Robin Turner and Kevin OCallaghan. Further Ipswich Town players stood in for actors in the football scenes - Kevin Beattie for Michael Caine, and Paul Cooper for Sylvester Stallone. The script was written by Yabo Yablonsky.\n\n\n\n Sylvester Stallone ...  Captain Robert Hatch \n Michael Caine ...  Capt. John Colby - The Players: England \n PelÃƒÂ© ...  Cpl. Luis Fernandez - Allied Soccer Player - The Players: Trinidad \n Bobby Moore ...  Terry Brady - Allied Soccer Player - The Players: England \n Osvaldo Ardiles ...  Carlos Rey - Allied Soccer Player - The Players: Argentina \n Paul Van Himst ...  Michel Fileu - The Players: Belgium \n Kazimierz Deyna ...  Paul Wolchek - The Players: Poland \n Hallvar Thoresen ...  Gunnar Hilsson - The Players: Norway \n Mike Summerbee ...  Sid Harmor - Allied Soccer Player - The Players: England \n Co Prins ...  Pieter Van Beck - The Players: Holland \n Russell Osman ...  Doug Clure - The Players \n John Wark ...  Arthur Hayes - The Players: Scotland \n SÃƒÂ¸ren Lindsted ...  Erik Ball - Allied Soccer Player - The Players: Denmark \n Kevin OCallaghan ...  Tony Lewis - Allied Goalkeeper - The Players: Ireland \n Max von Sydow ...  Major Karl Von Steiner - The Germans (as Max Von Sydow) \n\nThe movie is based on the 1961 Hungarian film drama KÃƒÂ©t fÃƒÂ©lido a pokolban (Two half-times in Hell), which was directed by ZoltÃƒÂ¡n FÃƒÂ¡bri and won the critics award at the 1962 Boston Cinema Festival.\n\nThe film was inspired by the true story of Dynamo Kyivs players, who defeated German soldiers while Ukraine was occupied by German troops in World War II. According to myth, as a result of their victory, the Ukrainians were all shot. The true story is considerably more complex, as the team played a series of matches against German teams, emerging victorious in all of them, before finally being sent to prison camps by the Gestapo. Most of the team were killed there, but a few survived.\n\nEscape to Victory featured a great many professional footballers as both the POW team and the German team. Many of the footballers came from the Ipswich Town squad, who were at the time one of the most successful teams in Europe. Despite not appearing on screen, English World Cup-winning goalkeeper Gordon Banks was closely involved in the film, working with Sylvester Stallone on his goalkeeping scenes. Sports Illustrated magazine said the game is marvelously photographed by Gerry Fisher, under second unit director Robert Riger.\n\nLes Shannon, the ex-Burnley player, choreographed the actual game presented in the film. The movie also credits PelÃƒÂ© as the designer of plays. Gordon Banks, World Cup winning goalkeeper, coached Sylvester Stallone. The game was filmed in the Hidegkuti NÃƒÂ¡ndor Stadium in Budapest, Hungary. In the film, PelÃƒÂ© plays a character from Trinidad and Tobago rather than, obviously, his real-life native land of Brazil (which was involved in the war only in 1945).\n\n","torrent":{"xt":"urn:btih:4e5e117bf6822ff00b372fd24afc331d5fa60d0c","amp;dn":"+Victory+%5B1981%5D+John+Huston","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4e5e117bf6822ff00b372fd24afc331d5fa60d0c","infoHashBuffer":{"type":"Buffer","data":[78,94,17,123,246,130,47,240,11,55,47,210,74,252,51,29,95,166,13,12]},"announce":[],"urlList":[]}}