{"title":"IHU Project: Excellent Linux VoIP Program (IP to IP Telephony)","uid":6733953,"size":8040212,"categoryP":"applications","categoryS":"unix","magnet":"?xt=urn:btih:4f014f5ee05d90aa0c42949ea553041088cab357&amp;dn=IHU+Project%3A+Excellent+Linux+VoIP+Program+%28IP+to+IP+Telephony%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"missmiss3","files":-1,"time":1318207286,"description":"IHU is a Voice over IP (VoIP) application for Linux (using Qt), that creates an audio stream between two computers easily and with the minimal traffic on the network.\n\nThe main features are:\n\n    Peer-to-Peer: the communication takes place directly between the computers (UDP and TCP both supported), without need of session protocols (such as SIP or H323) or other servers in the middle.\n    Good audio performance: IHU was born to give the best audio performance, low latency above all. For this purpose IHU is compatible with ALSA, now the default Linux sound architecture, but also with JACK, a low latency sound server. For the audio compression, IHU uses Speex, a codec optimized for speech (and completely free and open source).\n    Crypted stream: you have also the possibility to Encrypt/Decrypt the stream using a fast hybrid cryptographic system (RSA + Blowfish)\n    Command-line support: the GUI is not strictly necessary, you can run also a textual IHU from command-line (for example if you need to run the program on remote computers).\n    Free and Open Source: IHU is totally free and distributed under the terms of GNU General Public License\n\nThe possibilities of use of IHU are endless, for example you can use it like a phone to talk with your friends all around the world, or at home/work, to talk between computers in the LAN (talkback), etc.","torrent":{"xt":"urn:btih:4f014f5ee05d90aa0c42949ea553041088cab357","amp;dn":"IHU+Project%3A+Excellent+Linux+VoIP+Program+%28IP+to+IP+Telephony%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4f014f5ee05d90aa0c42949ea553041088cab357","infoHashBuffer":{"type":"Buffer","data":[79,1,79,94,224,93,144,170,12,66,148,158,165,83,4,16,136,202,179,87]},"announce":[],"urlList":[]}}