{"title":"Biosynthetic Polymers for Medical Applications","uid":15183226,"size":21835388,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4f18ab0aa9c1de285f839def944a6f3b9553561a&amp;dn=Biosynthetic+Polymers+for+Medical+Applications&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1467473743,"description":"Biosynthetic Polymers for Medical Applications - L. Poole-Warren et al. (WP, 2016).pdf\r\n\r\nISBN 978-1-78242-105-4\r\n\r\nBiosynthetic Polymers for Medical Applications provides the latest information on biopolymers, the polymers that have been produced from living organisms and are biodegradable in nature. These advanced materials are becoming increasingly important for medical applications due to their favorable properties, such as degradability and biocompatibility.\r\n\r\nThis important book provides readers with a thorough review of the fundamentals of biosynthetic polymers and their applications. Part One covers the fundamentals of biosynthetic polymers for medical applications, while Part Two explores biosynthetic polymer coatings and surface modification. Subsequent sections discuss biosynthetic polymers for tissue engineering applications and how to conduct polymers for medical applications.\r\n\r\n\r\nComprehensively covers all major medical applications of biosynthetic polymers\r\nProvides an overview of non-degradable and biodegradable biosynthetic polymers and their medical uses\r\nPresents a specific focus on coatings and surface modifications, biosynthetic hydrogels, particulate systems for gene and drug delivery, and conjugated conducting polymers","torrent":{"xt":"urn:btih:4f18ab0aa9c1de285f839def944a6f3b9553561a","amp;dn":"Biosynthetic+Polymers+for+Medical+Applications","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4f18ab0aa9c1de285f839def944a6f3b9553561a","infoHashBuffer":{"type":"Buffer","data":[79,24,171,10,169,193,222,40,95,131,157,239,148,74,111,59,149,83,86,26]},"announce":[],"urlList":[]}}