{"title":"Rocking Horse Winner, The [1949]","uid":7175036,"size":980432460,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:4f6678f871d793d4964bac91a02aac76617ec24e&amp;dn=Rocking+Horse+Winner%2C+The+%5B1949%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"alien99","files":-1,"time":1334084870,"description":" &lt;a href=&quot;http://www.imdb.com/title/tt0042898/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.imdb.com/title/tt0042898/&lt;/a&gt;\n\nStoryline\n\nIn London, the young Paul Grahame lives with his upper class but financially broken family. His wasteful mother Hester Grahame is a compulsive buyer, spending all the family money on new expensive dresses, jewels and objects for their home. His father Richard Grahame is a gambler, losing money in the horse races. His uncle Oscar Cresswell is permanently covering the Grahame family debts. When the servant Bassett is hired, Paul finds that he can predict the winner of the horse races by rocking his wooden horse. Paul asks Bassett to become his partner. The two of them bet their money on the races. Paul wants to prove that he is lucky in order to silence the house, which perpetually whispers to him that it needs more money. \n\nUser Review\n\nThis is about a British family. The mother (Valerie Hobson) spends beyond her means. The father gambles...badly and loses his job. The family is close to bankruptcy when their young son Paul (John Howard Davies) develops this uncanny ability to predict winners in horse races. How does he do it? By riding his rocking horse.\n\nI read the D.H. Lawrence short story back in college in the 1980s and never forgot it. I heard about this film but was afraid to see it...I didn't think there was any way to film the story without it looking stupid. Also this movie is hard to find. I finally did catch it and I was impressed. They managed to take a very dark and strange short story and make an excellent movie out of it. It moves quickly (it's only 90 minutes) and I was never bored for one second. The acting really helps to carry this one. Hobson is just OK as the mother but Davies as the little boy, John Mills as Bassett and Ronald Squire as Uncle Oscar are just great. Ultimately the movie is sad and depressing but just incredible. This was way too ahead of its time to connect with audiences of 1950 and it (sadly) remains unknown to this day. Well worth seeing.","torrent":{"xt":"urn:btih:4f6678f871d793d4964bac91a02aac76617ec24e","amp;dn":"Rocking+Horse+Winner%2C+The+%5B1949%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4f6678f871d793d4964bac91a02aac76617ec24e","infoHashBuffer":{"type":"Buffer","data":[79,102,120,248,113,215,147,212,150,75,172,145,160,42,172,118,97,126,194,78]},"announce":[],"urlList":[]}}