{"title":"Forbidden Knowledge (Underground - Restored)","uid":8517760,"size":89233643,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:4fd54cb94cca5c328997a5edfaf80fb38ffe66cc&amp;dn=Forbidden+Knowledge+%28Underground+-+Restored%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"LeonardTSpock","files":-1,"time":1369804825,"description":"Issues 1 and 2 of 'Forbidden Knowledge'\n\nLast Gasp, June 1975 and, 36 pages\n\nContributions from George DiCaprio, Robert Williams, Rich Chidlaw, Matt Golden, Brent Boates, Art Vitello, Milt Gray, Jean Paul Laurens, Jim Himes, Icelandic Codpiece Comics Studio, Dennis Ellis, Chris Lane, Pete Von Sholly, Warren William Greenwood, Red Grant, Johnny Edgar, Jean Paul Laurens, Rich Chidlaw, Doug Hansen, Scott Shaw, Gregory Duncon, Jim Osborne\n\nPretty dark stuff, but some of it is very well done. In particular, each issue has a couple of stories with some incredibly well executed art. \n\n\nWords from the Comix Joint...\n\nOnly George DiCaprio would host such a macabre feast as Forbidden Knowledge. Filled with stories of cannibalism, incest, castration and exhumed corpses, the two-issue series wallows joyfully in its depravity. In the first issue, Jim Himes &quot;Blood Lust of the Tupinamba&quot; is particularly gruesome. The cruelty inherent to human history is a great excuse for Forbidden Knowledge to deliver some of the most stomach-churning and violent scenes in comic book history.\n\n\n\n-------------------------------------------------------------------------------\n\nAs a side effect of the restoration process, depending on what you are using to view this file, you may need to reduce the image size in order to achieve the best possible quality. On a smaller screen you'll never notice it, but if you are viewing on a full size monitor the file will open a bit too large. Just shrink it a little and enjoy!\t","torrent":{"xt":"urn:btih:4fd54cb94cca5c328997a5edfaf80fb38ffe66cc","amp;dn":"Forbidden+Knowledge+%28Underground+-+Restored%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4fd54cb94cca5c328997a5edfaf80fb38ffe66cc","infoHashBuffer":{"type":"Buffer","data":[79,213,76,185,76,202,92,50,137,151,165,237,250,248,15,179,143,254,102,204]},"announce":[],"urlList":[]}}