{"title":"Stossel.2014.04.03.[Want to Bet].Fox Business.CF.avi","uid":9898112,"size":354317368,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:510588a3ee267c04842360c9f3504977aa53dfd0&amp;dn=Stossel.2014.04.03.%5BWant+to+Bet%5D.Fox+Business.CF.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"skJGZV6z","files":-1,"time":1396739767,"description":"----------\n\nSTOSSEL - [Want to Bet?] - Fox Business Network\n2014, April 3, Thursday\n\nXvid/MP3 AVI - encoded from medium quality ReplayTV stream\n\n----------\n\n[excerpted from John Stossel's blog:]\n\nGAMBLING FEVER: Les Bernal of Stop Predatory Gambling says gambling hurts people. Patrick Basham of Cato disagrees - he says it's &quot;healthy.&quot; I wouldn't call it healthy, but should it be banned?\n\nONLINE GAMBLING: Should we be allowed to bet from our bedrooms? Many Americans are upset about plans to legalize that. But Former congresswoman Mary Bono says legalize away; banning things never works!\n\nBITCOIN BETTING: The U.S. government shut down popular internet poker sites. But now new offshore sites allow Americans to bet online. Naomi Brockwell of the New York Bitcoin Center explains how Bitcoins make that betting possible.\n\nWALL STREET GAMBLERS: Picking stocks is one way to gamble where the odds favor us. If you throw darts at a page of stock symbols, you will probably make more money than you'd make investing in managed mutual funds. Fox Business Network's Charles Payne disagrees and doesn't like me calling stock investments &quot;gambling.&quot; He explains why.\n\nLOTTERY SCAM: State lotteries are a ripoff. The betting odds are terrible.But most states - the same states who ban internet gambling sites - run lotteries. Ben Domenech of The Federalist explains the hypocrisy.\n\nMY TAKE: Politicians who support gambling talk about the tax revenue betting will raise. But that's not a gain for the people. We're better off when more revenue is in private hands, not when government controls it. I wish they'd legalize for the right reason: adults ought to be able to do anything we want with other consenting adults. Anything that's peaceful.","torrent":{"xt":"urn:btih:510588a3ee267c04842360c9f3504977aa53dfd0","amp;dn":"Stossel.2014.04.03.%5BWant+to+Bet%5D.Fox+Business.CF.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"510588a3ee267c04842360c9f3504977aa53dfd0","infoHashBuffer":{"type":"Buffer","data":[81,5,136,163,238,38,124,4,132,35,96,201,243,80,73,119,170,83,223,208]},"announce":[],"urlList":[]}}