{"title":"BLACK WIDOW 01-03 (1999) plus WEB OF INTRIGUE one-shot REQUESTED","uid":8198524,"size":76584809,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:51679d579a07e049803f5a31e33830df9fdda7b9&amp;dn=BLACK+WIDOW+01-03+%281999%29+plus+WEB+OF+INTRIGUE+one-shot+REQUESTED&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"STFmaryville","files":-1,"time":1361970134,"description":"This fills a request for oblivious2000. I'm assuming he/she meant the 1st BW mini from Marvel Knights.\n\nI've also thrown in Web of Intrigue, a one-shot reprint that was released the same month as the 1st issue of this mini (featuring one of my favorite artists, George Perez). Please seed and share with our friends here at TPB!  --STFmaryville\n\n------\n\nNatasha Romanov, a.k.a. the Black Widow, has always led an exciting life. First as a Soviet spy, fighting on the Cold War front-line, followed by her defection to the West and eventual work in the Avengers. She has earned a reputation over the years as a consummate professional, coldly efficient and as deadly as her namesake.\n\nNow, her time as Black Widow has come to into doubt. Yelena Belova, the new Russian Black Widow, seeks to reclaim the mantle she feels was stolen from her Motherland. Trained in the arts of espionage and combat and anxious to prove herself and eliminate her namesake, Belova will stop at nothing to achieve her goal. The two will battle on an international stage, from the deserts of the Middle East to the New York`s Upper West Side. When the smoke clears, will either woman be left standing?\n\nThis title embodies all the tension and action of traditional espionage novels. From the steps of the Kremlin to the lowest levels of the Pentagon, this is a story of blurred identity in a confused, post-Cold War arena.","torrent":{"xt":"urn:btih:51679d579a07e049803f5a31e33830df9fdda7b9","amp;dn":"BLACK+WIDOW+01-03+%281999%29+plus+WEB+OF+INTRIGUE+one-shot+REQUESTED","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"51679d579a07e049803f5a31e33830df9fdda7b9","infoHashBuffer":{"type":"Buffer","data":[81,103,157,87,154,7,224,73,128,63,90,49,227,56,48,223,159,221,167,185]},"announce":[],"urlList":[]}}