{"title":"A Brief History of the Western World (9e)","uid":6603391,"size":14366571,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:52b3358eddb14b63532d91f26e6400e04d6e4a5e&amp;dn=A+Brief+History+of+the+Western+World+%289e%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"_F1_","files":-1,"time":1313308607,"description":"A Brief History of the Western World (9th Edition)\nThomas H. Greer (Author), Gavin Lewis (Author)\n\nPaperback: 784 pages\nPublisher: Wadsworth Publishing; 9 edition (July 15, 2004)\nLanguage: English\nISBN-10: 0534642365\nISBN-13: 978-0534642365\n\nReview:\n&quot;This is the best one-volume survey of Western history that I know of. Unlike most such texts, it is truly written on the college level. It doesn't talk down to its readers, though it subtly gives them the background they need.&quot;\n\n&quot;I believe its most obvious special strength is its organization. The clear explanations of both political/diplomatic and cultural/intellectual developments woven into the narrative structure used makes the text readable and accessible for students.&quot;\n\n&quot;I think this book is very readable and well organized. It has many important organizational advantages. It attempts to take a balanced view of various cultural and religious issues. I am very impressed with the overall quality of the text book. I will recommend that the rest of the committee look at this as an alternative to the Perry book.&quot;\n\n&quot;The timelines are very appealing and strikingly laid out. The overviews at the beginning of each chapter are nicely presented and do a fine job of tying the chapter's themes together. The impact of technology and science is consistently well explained, and art and music are integrated nicely.&quot;\n\n&quot;This text is set apart from comparable competing texts by the sophistication of its narrative. Most comparable texts water down the content and simplify the vocabulary. This text presents a quality narrative that matches that of much longer texts.&quot;\n\nProduct Description:\nGreer/Lewis's A BRIEF HISTORY OF THE WESTERN WORLD gives you a comprehensive view of the development of Western civilization in half the pages of other texts. Each chapter provides broad coverage of political, social, cultural, and religious themes. Includes a CD-ROM and access to an online university library.","torrent":{"xt":"urn:btih:52b3358eddb14b63532d91f26e6400e04d6e4a5e","amp;dn":"A+Brief+History+of+the+Western+World+%289e%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"52b3358eddb14b63532d91f26e6400e04d6e4a5e","infoHashBuffer":{"type":"Buffer","data":[82,179,53,142,221,177,75,99,83,45,145,242,110,100,0,224,77,110,74,94]},"announce":[],"urlList":[]}}