{"title":"Steins Gate - Recut","uid":10380412,"size":9316504408,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:52fcdf6628323bd518778b680cf2e07e72aa7865&amp;dn=Steins+Gate+-+Recut&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dasdos2","files":-1,"time":1403062986,"description":"A fun project I  have been working on in my spare time.\nMy favorite story/anime of all time. This story is (mostly) serialized. Because of this, I decided to 'Re-Cut' the series into one (ridiculously) long move. I feel it's one of those shows that should be watched in one sitting, assuming you have about 8 hours to spare.. X-/ . The story is completely intact. The only things removed from it were the intro's/credits (except for the first and last ones.) as well as any overlapping scenes between the endings/begging's of episodes. I did my best to splice them together in a way were you could not tell which episode ends and which one begins. I looks well except for episode 9 or 10. This is a HD WEB-RIP from the Funimation website. Hope you enjoy one of the greatest stories I have ever seen.\n\nAudio: English 2.0\nSubtitles: None\nResolution: 1280 by 720\nLength: 08:16:35 &lt;Yes, it's eight hours.\nSize: 8.67 GB\nSource: Funimation Web-Rip\n\n\n::---------------------------------------------------------------------\n\nThe story of Steins;Gate takes place in Akihabara and is about a group of friends who have customized their microwave into a device that can send text messages to the past. As they perform different experiments, an organization named SERN who has been doing their own research on time travel tracks them down and now the characters have to find a way to avoid being captured by them. Steins;Gate has been praised for its intertwining storyline and the voice actors have been commended for their portrayal of the characters. A manga adaptation of the story illustrated by Sarachi Yomi began serialization in Media Factory's Monthly Comic Alive magazine on September 26, 2009.\n","torrent":{"xt":"urn:btih:52fcdf6628323bd518778b680cf2e07e72aa7865","amp;dn":"Steins+Gate+-+Recut","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"52fcdf6628323bd518778b680cf2e07e72aa7865","infoHashBuffer":{"type":"Buffer","data":[82,252,223,102,40,50,59,213,24,119,139,104,12,242,224,126,114,170,120,101]},"announce":[],"urlList":[]}}