{"title":"Grand Theft Auto-San Andeas PC Game.iso","uid":7943034,"size":14942208,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:53aeb21c97add7f91b0362010e839bb53ddd74c9&amp;dn=Grand+Theft+Auto-San+Andeas+PC+Game.iso&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"prodallasosoft","files":1,"time":1356045342,"description":"\n\nGrand Theft Auto: San Andreas is the third 3D game in the GTA series, taking the action from Vice City's 80s to a 90's hip hop world of hood violence and gangsters.\n \nYou play as Carl Johnson, returning to his home of Los Santos after 5 years away. Plenty has changed over the years, and Carl sets about getting his gang's reputation and influence back. Grand Theft Auto: San Andreas' gameplay is classic GTA - tons of cinematic cut scenes, varied missions and lots of mini games, spread over a free roaming sandbox world.\n \nWhat defines Grand Theft Auto: San Andreas more than anything is the scale. It's hugely ambitious, set in a massive state featuring three big cities, and plenty of countryside. The campaign is enormous, and there is plenty more to do beside. The storyline, a rags to riches tale, may not be massively original but it's well told with excellent acting and lots of memorable and funny characters. The radio stations are excellent, with a great mix of 90s music and hilarious adverts.\n \nThere are points where the Grand Theft Auto: San Andreas will be frustrating for some. Racing cars in the countryside can be pretty slippy for instance, and building up Carl's lungs for swimming underwater takes too long. Some of the missions are a little annoying too, but hey are eclipsed by the best moments of the game and the amount of fun you can have roaming the state, enjoying the sites and creating havoc!\n \nGrand Theft Auto: San Andreas is a milestone in sandbox gaming. It's violent and very much an adult game, and while it has gameplay flaws, the overall achievement and the fun you can have playing are pretty much unbeatable.\n\nTested And Working...\nScanned (With Kaspersky) And 100% Clean.\n\nPlease Leave A Comment Confirming This Pack\n\nPLEASE SEED !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\n\nAs Always,this is an iso, mount or burn,Install,and Play. Enjoy\t\t","torrent":{"xt":"urn:btih:53aeb21c97add7f91b0362010e839bb53ddd74c9","amp;dn":"Grand+Theft+Auto-San+Andeas+PC+Game.iso","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"53aeb21c97add7f91b0362010e839bb53ddd74c9","infoHashBuffer":{"type":"Buffer","data":[83,174,178,28,151,173,215,249,27,3,98,1,14,131,155,181,61,221,116,201]},"announce":[],"urlList":[]}}