{"title":"From Noon Til Three (Charles Bronson) [1976 ] @! .avi","uid":4866427,"size":622275210,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:54bed27ecfbfb44b17758f69fa017c80a4c69f1c&amp;dn=From+Noon+Til+Three+%28Charles+Bronson%29+%5B1976+%5D+%40%21+.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"alien99","files":1,"time":1240539399,"description":"\n\tCharles Bronson\t... \tGraham\n\tJill Ireland\t... \tAmanda\n\tDouglas Fowley\t... \tBuck Bowers (as Douglas V. Fowley)\n\tStan Haze\t... \tApe\n\tDamon Douglas\t... \tBoy\n\tHector Morales\t... \tThe Mexican\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0074553/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0074553/&lt;/a&gt;\n\nCharm is not a word you would associate Charles Bronson with, but he is chock full if it in this &quot;romp.&quot; A group of bank robbers leave Charles Bronson at a widow's (Jill Ireland's) house because his horse goes lame. They vow to pick him up after the robbery in what they figure will be about three hours (thus the name of the movie). In those three hours Charles Bronson, after almost attacking Jill Ireland, decides to go for a sympathy play and has Jill Ireland, within 15 minutes making love to him to help him with his &quot;impotency.&quot; While watching the movie, it makes you wonder how she held off for so long. If you want to see Charles Bronson half naked, with a physique of a man 20 years younger, making love - three times -- this is the movie for you. After he leaves, and is mistakenly thought killed, Jill Ireland writes a book about their three hour affair and the whole thing turns into a type of legend, which turns the town into a type of World's Fair exhibit. Charles Bronson ends up in jail for different reasons where he finds out that he has become a legend and of course ties to tell people that's he's that person, and if things weren't already crazy they get crazier. Charles Bronson is unrecognizable from the characters he played in practically all of his other movies. This movie shows his range as an actor and makes me sad he never got to display more of what he was actually capable of. Jill Ireland pulls off her character beautifully and also shows her range, something else we never got to see in her other movies. ","torrent":{"xt":"urn:btih:54bed27ecfbfb44b17758f69fa017c80a4c69f1c","amp;dn":"From+Noon+Til+Three+%28Charles+Bronson%29+%5B1976+%5D+%40%21+.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"54bed27ecfbfb44b17758f69fa017c80a4c69f1c","infoHashBuffer":{"type":"Buffer","data":[84,190,210,126,207,191,180,75,23,117,143,105,250,1,124,128,164,198,159,28]},"announce":[],"urlList":[]}}