{"title":"Everclear - Santa Monica  (2nafish)","uid":5672568,"size":113883140,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:54ecbfa9a2816c6d7eddc1d71fa619988fe95b3f&amp;dn=Everclear+-+Santa+Monica++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1278409239,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Santa Monica&quot; is a rock song by the band Everclear, from their 1995 album Sparkle and Fade. The song was written by the band's lead singer, Art Alexakis.\n\nThough not officially released as a single, American radio stations played &quot;Santa Monica&quot; enough for the song to reach #29 on the Billboard Hot 100 Airplay chart in 1996. The song also spent three weeks atop the Billboard Hot Mainstream Rock Tracks chart, and reached #5 on the Billboard Hot Modern Rock Tracks chart.\n\nWhen Alexakis was a teenager, his girlfriend committed suicide; shortly thereafter, Alexakis attempted the same by jumping off the Santa Monica Pier in southern California. One theory as to the meaning of this song is that Alexakis was drawing on this experience from earlier in his life.\n\nFollowing the terrorist attacks on September 11, 2001, the song was placed on the list of post-9/11 inappropriate titles distributed by Clear Channel.\n\nSparkle and Fade is the second album by Everclear, released on May 23, 1995. It was their first album to be released exclusively on Capitol Records; their previous effort, World of Noise, was re-released on Capitol after its introduction through the Portland, Oregon based label, Tim/Kerr Records.\n\nThe album's lead single, &quot;Heroin Girl,&quot; performed well on college radio but did not gain significant mainstream airplay. That would be granted to their follow up, &quot;Santa Monica,&quot; which effectively put Everclear on the map. The next two singles, &quot;Heartspark Dollarsign&quot; and &quot;You Make Me Feel Like A Whore,&quot; would have moderate rotation, but the band wouldn't gain major success again until their next album, So Much for the Afterglow.\n\nThe cover art to Sparkle and Fade features childhood pictures of the three members of the band, with bassist Craig Montoya on the left, guitarist/singer Art Alexakis in the middle, and drummer Greg Eklund on the right.\n\nThe album is Everclear's third best selling album to date with 1 million copies sold. It was dedicated to slain singer Mia Zapata of the Seattle punk rock band The Gits.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:54ecbfa9a2816c6d7eddc1d71fa619988fe95b3f","amp;dn":"Everclear+-+Santa+Monica++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"54ecbfa9a2816c6d7eddc1d71fa619988fe95b3f","infoHashBuffer":{"type":"Buffer","data":[84,236,191,169,162,129,108,109,126,221,193,215,31,166,25,152,143,233,91,63]},"announce":[],"urlList":[]}}