{"title":"Urban and Rural Decay Photography [PDF] [StormRG]","uid":10174841,"size":15487381,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:552c9d18294b538b90c9ddd25654380acda5f06c&amp;dn=Urban+and+Rural+Decay+Photography+%5BPDF%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"steelballz","files":-1,"time":1400452168,"description":"Description\nUrban and Rural Decay Photography- Finding the Beauty in the Blight\nAuthor:Thomas, J. Dennis\nPublished:July 24 2013\nPublisher:Focal Press\nISBN-10:0415663210\nISBN-13:9780415663212\nFormat: Retail PDF\nReader Required: Adobe Reader, Foxit, Nitro, Adobe Digital Editions\n\n\nTested on the above readers with no problems on laptop and Android tablet.\nDon't hesitate to PM me if you have any questions or problem with the download, as comments on the torrent are easy to miss. Please allow a couple\nseconds for the seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\nIt should also be noted that any reference to any dvd, cd, or any other dlc or extra content in this, or any other torrent I upload, is not available in the torrent unless I state otherwise. If you want the extras, buy the product\nThis PDF is encrypted! This encryption will NOT interfere with opening, printing, or copying the PDF. It will only prevent editing of the PDF. I have my reasons for it. If you have questions pm me through my acct on KAT\n\n\n\nimage\nCover from actual book file\n\n\nProduct Description\n\n\nPublication Date: July 24 2013\n\nIf you are a photographer who sees the beauty in abandoned buildings, crumbling facades, and preserving a fading history, and who also has a love of urban exploration, you have stumbled on a must-have for your photographic library. Urban and Rural Decay Photography offers expert tips and techniques for capturing breathtaking photographs of your favorite decay scenes, whether in urban or rural settings. Author J. Dennis Thomas guides you through the history of decay photography, shows you what equipment you will need, and discusses digital, film and HDR capture and composition. The book addresses which artistic considerations work best for the kinds of shots that capture a moment and convey a story. He also provides you with important safety advice and matters of the law when entering and working with decaying structures.\n\nChock full of inspiring images that will ignite your creativity and your passion for decay photography, Urban and Rural Decay Photography is just the book you need to get you out and discovering your newest urban or rural exploration adventure.\n\n\n\n\n\nimage\nScientia est potentia\n","torrent":{"xt":"urn:btih:552c9d18294b538b90c9ddd25654380acda5f06c","amp;dn":"Urban+and+Rural+Decay+Photography+%5BPDF%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"552c9d18294b538b90c9ddd25654380acda5f06c","infoHashBuffer":{"type":"Buffer","data":[85,44,157,24,41,75,83,139,144,201,221,210,86,84,56,10,205,165,240,108]},"announce":[],"urlList":[]}}