{"title":"When Women Sexually Abuse Men: The Hidden Side of Rape, Stalking","uid":9429631,"size":1214098,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5581926e32f182d177c226db6809e5a317d5c672&amp;dn=When+Women+Sexually+Abuse+Men%3A+The+Hidden+Side+of+Rape%2C+Stalking&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"prabhu_","files":2,"time":1388769659,"description":"When Women Sexually Abuse Men: The Hidden Side of Rape, Stalking, Harassment, and Sexual Assault \n\nby Philip W. Cook , Tammy L Hodo\n &lt;a href=&quot;\nhttp://img2.imagesbn.com/p/9780313397295_p0_v2_s260x420.JPG&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img2.imagesbn.com/p/9780313397295_p0_v2_s260x420.JPG&lt;/a&gt;\n\nabout book :-\n\nCrimes of a sexual nature perpetrated by adult females against males constitute a serious problem in our society. A woman can rape a man, and this crime occurs far more often than most imagine. This book addresses an entire range of crimes beyond rape, however; stalking, sexual harassment, and sexual assault are all covered in detail.\n\nWhen Women Sexually Abuse Men: The Hidden Side of Rape, Stalking, Harassment, and Sexual Assault illuminates the long-overlooked subject of adult female against adult male sex crimes. Combining personal accounts, information on criminal cases, relevant research on adult female against adult male sexual offenses, and statistical data from the FBI and other government sources, the authors comprehensively document how some women can be aggressive sexual predators, just like their male counterparts; highlight the changes in the criminal behavior of women; and provide fascinating stories of true crime as well as shocking revelations about human behavior.\n &lt;a href=&quot;\nhttp://img2.imagesbn.com/p/9780313397295_p0_v2_s260x420.JPG&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img2.imagesbn.com/p/9780313397295_p0_v2_s260x420.JPG&lt;/a&gt;\n\nabout author :-\n\nInvestigative journalist Philip W. Cook is the author of Abused Men-The Hidden Side of Domestic Violence (ABC-Clio Second Edition 2009-Greenwood/Praeger First Edition 1997). He is the author of the 2013 book, When Women Sexually Abuse Men-The Hidden Side of Rape, Stalking, Harassment and Sexual Assault with criminologist Tammy Hodo, PhD. Mr. Cook is a professional journalist whose work objectively examines and explains relevant research results, the feelings and problems of interviewed victims, as well as provider and media response to the issue. He has examined scores of national and international domestic violence and family programs and evaluated their potential for helpful replication. His presentation and book has received high praise from a diverse spectrum of society such as &quot;Dear Abby&quot;, leading domestic violence sociologists, attorneys, physicians, law enforcement, and numerous mental health professionals. &quot;Fascinating ... explains the many aspects of domestic violence. A wealth of material that could be helpful.&quot; 'Dear Abby' Abigail Van Buren, Syndicated Columnist.\nMr. Cook has appeared on numerous national radio and television shows such as CNN, MSNBC, Fox TV's &quot;The Crier Report&quot;, &quot;The O'Reilly Factor&quot; (twice), &quot;The Montel Williams Show&quot;, &quot;The Sally Jesse Raphael Show&quot;, &quot;The Home and Family Show&quot;, Westwood Radio Network (Jim Bohannon Show, Dirk Van), and CBS radio. His articles about domestic violence have been published in The Employee Assistance Professional &quot;Exchange&quot; Magazine, The Oregonian, Women's Freedom Network Magazine, Deseret News, Eugene Register-Guard, and many other publications. He is the co-author of articles in the distinguished academic publication &quot;The Journal for Human Behavior in the Social Environment&quot;, and &quot;Journal of Elder Abuse&quot; and his articles have been published in two supplemental college textbooks, including Domestic Violence (Greenhaven Press-2000), as well as an two anthology books published by Disinformation Press. He has been extensively quoted or interviewed as an expert on male victims of domestic violence in more than 100 radio talk shows, as well as in numerous publications such as &quot;Medical Economics&quot;, &quot;Law Enforcement Technology&quot; and numerous times in both local and national wire services, (Associated Press Canadian Associated Press) as well as many daily newspapers. &quot;The engaging style of a journalist providing an in-depth discussion of a topic that he acknowledges is controversial.&quot; -Journal of Marriage and the Family \n\nMr. Cook was a radio and television director of news. He was news director at radio stations in Portland, Oregon, San Antonio, Texas, and in the Dallas/Ft. Worth area. He also served as director of television news or assistant director of news at television stations in Reno, Nevada and Kennewick, Washington. He has received awards for his reporting from The Associated Press, The Professional Journalism Society, and the Radio Television News Directors Association .He is a graduate of the University of Oregon (79) with a BS in Journalism.\n\n`~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~`\n  SEED PLEASE , LET OTHERS GET IT TOO. \n `~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~`\t\n","torrent":{"xt":"urn:btih:5581926e32f182d177c226db6809e5a317d5c672","amp;dn":"When+Women+Sexually+Abuse+Men%3A+The+Hidden+Side+of+Rape%2C+Stalking","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5581926e32f182d177c226db6809e5a317d5c672","infoHashBuffer":{"type":"Buffer","data":[85,129,146,110,50,241,130,209,119,194,38,219,104,9,229,163,23,213,198,114]},"announce":[],"urlList":[]}}