{"title":"Love is forever.mp4","uid":12195454,"size":1601352246,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:55d1ce66edd03eb5c0b459318cdc990009397af9&amp;dn=Love+is+forever.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"claudiatannahill","files":1,"time":1438730035,"description":"Love Is Forever aka  Passion and Valor (1983)\n\n\n\nThe true story of an Australian news photographer and his heroic rescue of the girl he loves from a country torn by war and tyranny.\nFollowing the Pathet Lao takeover of Laos, Australian journalist John Everingham is originally sympathetic but then feels the nation is turning into a police state. General Siegfried Kaplan an East German advisor to the Pathet Lao secret police has noticed that Western newsagencies are receiving revealing news stories that could only have been provided by insiders in the Government. Kaplan vows to plug the security leaks and identify and eliminate the sources of the stories.\n\nAccording to the film, Everingham is the last Western journalist remaining in Laos. To gather information the General assigns the attractive Keo Sirisomphone to befriend and spy on Everingham. The two fall in love. Everingham is arrested but rather than executed or imprisoned he is exiled to Thailand.\n\nEvernigham vows to return to Laos to rescue Keo by learning how to scuba dive in the Mekong River and bring her to Thailand.\n\nMy rip from a VHS type Quality DVD from Amazon....don't buy that kind of crap ,seriously folks ...don't!","torrent":{"xt":"urn:btih:55d1ce66edd03eb5c0b459318cdc990009397af9","amp;dn":"Love+is+forever.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"55d1ce66edd03eb5c0b459318cdc990009397af9","infoHashBuffer":{"type":"Buffer","data":[85,209,206,102,237,208,62,181,192,180,89,49,140,220,153,0,9,57,122,249]},"announce":[],"urlList":[]}}