{"title":"Sanctuary - Into The Mirror Black (FLAC Lossless Log cue)","uid":3902076,"size":333250542,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:56ada0fb5cd8d03838e94522cee3611624dfb1d5&amp;dn=Sanctuary+-+Into+The+Mirror+Black+%28FLAC+Lossless+Log+cue%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"neonblack77","files":12,"time":1195619050,"description":"Sanctuary (US) - Into The Mirror Black\n\nFull-length, CBS / Epic\nFebruary 27th, 1990\n\nWarrel Dane : Vocals\nLenny Rutledge : Guitars\nSean Blosl : Guitars\nJim Sheppard : Bass\nDave Budbill : Drums\n\nProduced by Howard Benson\nEngineered by Bruce Barris\nAssistant enigineer Joe Barrasi\nRecorded at Sound City, Van Nuys, CA.\nMixed by Bruce Barris &amp; Howard Benson\nMixed at Cornerstone Recorders, Chatsworth, CA.\n\n1. Future Tense 05:10\n2. Taste Revenge 05:03\n3. Long Since Dark 05:08\n4. Epitaph 06:05\n5. Eden Lies Obscured 05:24\n6. The Mirror Black 05:10\n7. Seasons Of Destruction 04:54\n8. One More Murder 04:24\n9. Communion 05:38\n\nTotal playing time 46:56\n\nWritten by Starkweather222000  \n\n\nWell, ladies and gentlemen, it is with great honour that I present you the album of the decade. This is it, this is the landmark of the latter days of heavy metal. In 1990, the audience had mostly turned to more extreme, newer forms of metal music, call me death metal, early black metal, or even earlier atmospheric bands like Paradise Lost and Anathema. Though there is nothing really bad about that, classic, sharp-edged, traditional heavy metal was in a significant decline. And though really great bands had released extraordinary albums (Painkiller, Rust In Peace, Persistence Of Time), it was clear that the future of the genre was somewhat dark?\nAnd then there was Warrel. Few years before ?Into The Mirror Black?, Dane and his bandmates were just a good US power metal group with a pretty decent debut album called ?Refuge Denied?. But by the start of the new decade, Sanctuary made the artistic breakthrough with this masterpiece.\nIt sets the game off with a more-than-classic song called ?Future Tense?. Monstrous heavy metal riffs, superb high pitched vocals, everything was there to rejuvenate what seemed to be lost by the end of the 80?s. But still, the guys from Seattle had even more deadly arrows in their quiver. As you continue to the next songs, ?Taste Revenge? and ?Long Since Dark?, you realise that though the music is this burning, solid heavy metal played in the 80?s, everything else is more mature, more sophisticated. The lyrics, oh my God, these lyrics could be easily seen as poems?The artwork is on a higher level, nothing reminiscent of the 80?s heavy metal ?age of innocence?, with the cartoon like artworks and the fantasy-dragons-kings-and-queens thematology. By the time your stereo reaches ?Epitaph?, you?re in for the shock of your life. This song RULES, RULES, RULES. Surreal lyrics, totally psychotic vocal lines, this is a complete epic. And hold on for more??Eden Lies Obscured?, ?One More Murder?, ?Seasons Of Destruction?, whoa, I can?t get enough of this album?Destructive, almost corrosive metal tones, storms of beastly drumming, all played in extreme tecnhique. This album has an unbelievable quality. Some people say that this one is ?the last action hero?, the last album that can be named as a classic. And it is really really sad that it never had a successor. After ?Into The Mirror Black?, Sanctuary came to an untimely end. The two guitarists, Lenny Rutledge and Sean Blosl had major disagreements with Warrel and the others about the direction that the band should follow after this album. Rutledge and Blosl were drawn to a more grungy style, which Warrel didn?t like at all, so he decided to leave the band (along with Jim Sheppard) and create a glorious new chapter in the history of rock music called Nevermore. So, to sum up. Guys, steal, borrow, kill, do whatever is necessary to get this one. This is history. Pure, burning heavy metal history. The last one before the fall, the last classic.","torrent":{"xt":"urn:btih:56ada0fb5cd8d03838e94522cee3611624dfb1d5","amp;dn":"Sanctuary+-+Into+The+Mirror+Black+%28FLAC+Lossless+Log+cue%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"56ada0fb5cd8d03838e94522cee3611624dfb1d5","infoHashBuffer":{"type":"Buffer","data":[86,173,160,251,92,216,208,56,56,233,69,34,206,227,97,22,36,223,177,213]},"announce":[],"urlList":[]}}