{"title":"Great Big Sea - The Hard And The Easy [2005] [EAC/FLAC]","uid":11695744,"size":293553676,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:57667aa21529efd5d2dd4f880a28311155318a1f&amp;dn=Great+Big+Sea+-+The+Hard+And+The+Easy+%5B2005%5D+%5BEAC%2FFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dickspic","files":16,"time":1423702813,"description":"\n1.\tCome and I Will Sing You (The Twelve Apostles)\t3:41\n2.\tOld Polina\t2:39\n3.\tThe River Driver\t3:03\n4.\tThe Mermaid\t2:48\n5.\tCaptain Kidd\t2:50\n6.\tGraceful &amp; Charming (Sweet Forget me Not)\t4:18\n7.\tConcerning Charlie Horse\t3:12\n8.\tHarbour Lecou\t3:32\n9.\tTshialuk Girls Set (Father's Jig, Buffet Double, Tishialuk Girls)\t3:27\n10.\tFrench Shore\t3:48\n11.\tCod Liver Oil\t2:57\n12.\tTickle Cove Pond\t5:01\n\nIf you think you've figured out Great Big Sea's formula, you're right: take sea shanties, fishing songs, and the odd original tune that sounds like a folk song and deliver them all with lusty energy on acoustic instruments. If the Pogues had come from Newfoundland and treated alcohol as a peripheral rather than a central concern, and if their singer were big and burly rather than dissolute and disgusting, you'd have something very much like Great Big Sea. That formula has been pretty consistent over the preceding 13 years, so how much you'll enjoy their ninth album will depend largely on how much you enjoyed their first eight, although there is a difference: this one relies less on fishing and seafaring songs and more on songs that reflect other traditional concerns of the Newfoundlanders, such as lumbering, adultery, and, er, counting. OK, most of them are still about fishing and seafaring. And there's nothing wrong with that. &quot;Captain Kidd&quot; may be familiar, but they deliver it with such gusto that it sounds new again; &quot;Come and I Will Sing You (The Twelve Apostles)&quot; is a fun counting song that apparently has its roots in medieval Europe, and &quot;Graceful &amp; Charming (Sweet Forget Me Not)&quot; is as touching a sentimental ballad as you're ever likely to hear. Alan Doyle's voice is as regular-guy mediocre as ever, but the trio's harmonies still roar attractively and they play with infectious glee. The package includes a DVD with interview footage, some back-porch jamming, and what looks like a sort of community hall get-together. Very nice","torrent":{"xt":"urn:btih:57667aa21529efd5d2dd4f880a28311155318a1f","amp;dn":"Great+Big+Sea+-+The+Hard+And+The+Easy+%5B2005%5D+%5BEAC%2FFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"57667aa21529efd5d2dd4f880a28311155318a1f","infoHashBuffer":{"type":"Buffer","data":[87,102,122,162,21,41,239,213,210,221,79,136,10,40,49,17,85,49,138,31]},"announce":[],"urlList":[]}}