{"title":"FSX Razbam Convair FA-201A Kestrel","uid":6649213,"size":171377738,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:578d8594dc572d172cfdf229288e23aedcdb0620&amp;dn=FSX+Razbam+Convair+FA-201A+Kestrel&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mickyfinny","files":1,"time":1315068840,"description":"Fly the Kestrel.\n\nIn 1974, the US Navy issued a request for proposals for a lightweight multi-role aircraft that could serve as both a fighter and as an attack aircraft. The aim was to replace both the F-4 Phantom II an the A-7 Corsair II with an aircraft that had a lower cost than either the F-14 or the F-111.\n\nThe Convair F/ A-201 was the proposal put forward by Convair. It was based on an earlier proposal for an &quot;Advanced F-106&quot;. It was designed with a single Pratt &amp; Whitney JTF22A-30A/F100-PW-220 engine and its most striking feature was the inclusion of canard fins. There were to be both land-based and carrier-based aircraft. Also they proposed to make a VSTOL version with two lift engines and a vectored nozzle for the main one. In another first, this aircraft was designed with a fly-by-wire system to help control it.\n\nIn 1975 the U.S. Navy decided to select a derivative of the YF-17, the loser of the U.S: Air Force Lightweight Fighter (LWF) Aircraft competition which resulted in the F-16. The YF-17 was converted into the F/A-18 Hornet and the Convair proposal never went beyond the model stage.\n\nWe at RAZBAM decided to bring to life this interesting aircraft that never flew as the first in our &quot;What-If&quot; line. Aircraft that never made from the model stage but that were radical designs and held great promise in their design.\n\nHow do you start this craft?,cant see procedures in manual.Anyway Have fun:+)","torrent":{"xt":"urn:btih:578d8594dc572d172cfdf229288e23aedcdb0620","amp;dn":"FSX+Razbam+Convair+FA-201A+Kestrel","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"578d8594dc572d172cfdf229288e23aedcdb0620","infoHashBuffer":{"type":"Buffer","data":[87,141,133,148,220,87,45,23,44,253,242,41,40,142,35,174,220,219,6,32]},"announce":[],"urlList":[]}}