{"title":"Primitivist Modernism - Black Culture and the Origins of Transat","uid":10004349,"size":13265949,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:58dc480b1111dc9a6c28f51ff9fb50a79c674276&amp;dn=Primitivist+Modernism+-+Black+Culture+and+the+Origins+of+Transat&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"STBGD","files":-1,"time":1398034178,"description":"Sieglinde Lemke / 1998 / English / 192 / ISBN:019510403X / 13MB / pdf\n\nThis book explores a rich cultural hybridity at the heart of transatlantic modernism. Focusing on cubism, jazz, and Josephine Baker's performance in the Danse Sauvage, Sieglinde Lemke uncovers a crucial history of white and black intercultural exchange, a phenomenon until now greatly obscured by a cloak of whiteness. Considering artists and critics such as Picasso, Alain Locke, Nancy Cunard, and Paul Whiteman, in addition to Baker, Lemke documents a potent cultural dialectic in which black artistic expression fertilized white modernism, just as white art forms helped shape the black modernism of Harlem and Paris. Coining the term primitivist modernism to designate the multicultural heritage of this century's artistic production, Lemke reveals the generative and germinating black cultural Other in the arts. She examines this neglected dimension in full, fascinating detail, blending literary theory, social history, and cultural analysis to document modernism's complex absorption of African culture and art. She details numerous ways in which African and African American forms (visual styles, musical idioms, black dialects) and fantasies (Baker's costume and dance, say) permeated high and mass culture on both sides of the Atlantic. So-called primitive art and high modernism; savage rhythms and European music hall culture; European and African American expressions in jazz; European primitivism and the racial awakenings of African American culture: paired and freshly examined by Lemke, these subjects stand revealed in their true interrelatedness. Insisting on modernism's two-way cultural flow, Lemke demonstrates not only that white modernism owes much of its symbolic capital to the black Other, but that black modernism built itself in part on white Euro-American models. Through superbly nuanced readings of individual texts and images (fifteen striking examples of which are reproduced in this handsome volume), Lemke reforms our understanding of modernism. She shows us, in clear, invigorating fashion, that transatlantic modernism in both its high and popular modes was significantly more diverse than commonly supposed. Students and scholars of modernism, African American studies, and cultural studies, and those with interests in twentieth-century art, dance, music, or literature, will find this book richly rewarding.","torrent":{"xt":"urn:btih:58dc480b1111dc9a6c28f51ff9fb50a79c674276","amp;dn":"Primitivist+Modernism+-+Black+Culture+and+the+Origins+of+Transat","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"58dc480b1111dc9a6c28f51ff9fb50a79c674276","infoHashBuffer":{"type":"Buffer","data":[88,220,72,11,17,17,220,154,108,40,245,31,249,251,80,167,156,103,66,118]},"announce":[],"urlList":[]}}