{"title":"Tanks for the Memories v1.1.4","uid":9056386,"size":33254728,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:59a6908793517943d3c94a33b26bbe8146ed64af&amp;dn=Tanks+for+the+Memories+v1.1.4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Androider","files":-1,"time":1381959556,"description":"\nEverybody's scared of something. \n\nEven you. Fortunately,\nscience is here to help! (Proven fact: only babies are scared of science). A leading psychologist, tired of sitting behind people while they laid on those Far-Side-looking curved psychologist couch things, went into his laboratory \n(psychologists do in fact have laboratories, they're just not allowed to tell you) and came out with a solution. Tanks!\n\nYes! Tanks! The gentleman in question has not, as of the \ndate of this writing, provided me with the scientific literature explaining the process, but he'll use tanks to go inside your mind, to find the fears embedded in your memories, and just shoot the heck out of them. \n\nAfraid of bugs? He'll find the bugs inside your mind and shoot them. Afraid of clowns? Same deal. Afraid of something that you think can't be shot? He'll find a way to shoot it. Historians of the future, in their spacesuits, will look back on this day as they day we humans realized we had nothing more to fear, because anything that can be feared can also be tracked down and then shot with a tank.\n\nTANKS FOR THE MEMORIES is a fresh, addictive mobile game for Android and iOS, featuring:\n\n- Gameplay that's intuitive and easy to pick up, yet full of customizability and split-second tactical thinking\n- Bright, appealing art for the different stages, with clever interpretations of different fears\n- Heavy expandability through the capability to deliver more levels after launch\n- A charming sense of playfulness and possibility\n\nFree 50 Pieces of Mind to use in the Tank shop for purchasing this app!\n\nWhat's New:\n\nUpdate fixes bug where player could not accumulate Pieces of Mind in certain modes.\nUpdate fixes bug where player couldn't purchase more than one POM Bundle.\nKnown issue: on some devices, when you let your device idle (the screen goes black) during gameplay, upon return the level will restart. We are working to correct this issue.\n\nMore info:\n &lt;a href=&quot;\nhttps://play.google.com/store/apps/details?id=minicore.MemTanks.GamePro&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://play.google.com/store/apps/details?id=minicore.MemTanks.GamePro&lt;/a&gt;\n","torrent":{"xt":"urn:btih:59a6908793517943d3c94a33b26bbe8146ed64af","amp;dn":"Tanks+for+the+Memories+v1.1.4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"59a6908793517943d3c94a33b26bbe8146ed64af","infoHashBuffer":{"type":"Buffer","data":[89,166,144,135,147,81,121,67,211,201,74,51,178,107,190,129,70,237,100,175]},"announce":[],"urlList":[]}}