{"title":"The Hobbit The Desolation of Smaug (2013) 720p BrRip - leoamaro","uid":9857665,"size":1041512820,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:59c1b4bc754de76b774ed3dcab96e2905c5443eb&amp;dn=The+Hobbit+The+Desolation+of+Smaug+%282013%29+720p+BrRip+-+leoamaro&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"leoamaro","files":2,"time":1396238405,"description":"The Hobbit: The Desolation of Smaug is a 2013 epic fantasy adventure film directed by Peter Jackson. It was produced by New Line Cinema and Metro-Goldwyn-Mayer in collaboration with Wingnut Films. It was distributed by Warner Bros. Entertainment Inc. and is the second installment in a three part film adaptation based on the novel of the same name by J. R. R. Tolkien. The film was preceded by An Unexpected Journey and was written by Fran Walsh, Philippa Boyens, Peter Jackson and Guillermo del Toro. It will conclude with the release of There and Back Again in December of 2014.\nThe film is set in the fictional world of Middle-earth sixty years before the events of The Lord of the Rings. The story centres on the title character Bilbo Baggins (Martin Freeman) as he accompanies Gandalf the Grey (Ian McKellen) and thirteen Dwarves, led by Thorin Oakenshield (Richard Armitage), on a quest to reclaim the Lonely Mountain from the dragon Smaug (Benedict Cumberbatch). The film also expands upon certain elements relating to the White Council and Gandalf, as he investigates a growing evil at Dol Guldur, and includes the pursuit of Azog and Bolg as they seek vengeance against Thorin and his ancestors.The ensemble cast also includes Evangeline Lilly, Lee Pace, Luke Evans, Ken Stott, James Nesbitt and Orlando Bloom, and features Sylvester McCoy, Stephen Fry, Mikael Persbrandt and Manu Bennett.\nAlthough originally planned as a two part adaptation, it was announced on 30 July 2012 that a third film would be produced, and was subsequently retitled The Desolation of Smaug.They were shot simultaneously around New Zealand and Pinewood Studios with additional filming taking place throughout May of 2013.It was filmed in 3D at a projection rate of 48 frames per second.\n\nThe Hobbit: The Desolation of Smaug premiered on 2 December 2013 in Los Angeles and was released internationally on 11 December 2013. The film has grossed over $940 million worldwide, surpassing both The Fellowship of the Ring and The Two Towers nominally, becoming the fourth highest-grossing film of 2013 and the 24th highest grossing film of all time. The film received three nominations at the 86th Academy Awards and a further two BAFTA nominations.","torrent":{"xt":"urn:btih:59c1b4bc754de76b774ed3dcab96e2905c5443eb","amp;dn":"The+Hobbit+The+Desolation+of+Smaug+%282013%29+720p+BrRip+-+leoamaro","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"59c1b4bc754de76b774ed3dcab96e2905c5443eb","infoHashBuffer":{"type":"Buffer","data":[89,193,180,188,117,77,231,107,119,78,211,220,171,150,226,144,92,84,67,235]},"announce":[],"urlList":[]}}