{"title":"Painkiller: Battle out of Hell","uid":7701374,"size":1625466772,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:59cc513ec2ea6d0dbe2961cf985eb82e52f26cca&amp;dn=Painkiller%3A+Battle+out+of+Hell&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"shephard1","files":-1,"time":1349532307,"description":"Painkiller: Battle Out of Hell is an expansion pack for Painkiller, released on November 22, 2004. It was developed and published by the same companies as Painkiller. Painkiller: Battle out of hell features an all-new 10-level single player campaign, two new weapons (with two fire modes each), new multiplayer game modes, and improved visual effects.\nThe story continues where the original left off: Lucifer is killed and his position as ruler of Hell is now free. Alastor, one of four hell generals Daniel Garner was assigned to kill in the original game, appears with a horde of demons and confronts Daniel, who now has to retreat with the help of Eve. Daniel's new goal is to battle out of hell and eliminate Alastor, who is now rightful ruler of the demonic forces. Before confronting his powerful enemy, Daniel visits such places as an orphanage full of possessed children, a hellish circus named Loony Park, a pirate bay, coliseums, Necropolis, and even a twisted version of World War II Leningrad. After taking out Alastor, Eve thanks Daniel for allowing her to take control. Eve offers Daniel the chance to rule by her side, but Daniel refuses. Eve then invites Daniel to leave and join Catherine in Heaven, but Daniel again refuses, and begins firing his gun at Eve as the screen fades to black.\n\nNote: You must have Painkiller installed in your computer.","torrent":{"xt":"urn:btih:59cc513ec2ea6d0dbe2961cf985eb82e52f26cca","amp;dn":"Painkiller%3A+Battle+out+of+Hell","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"59cc513ec2ea6d0dbe2961cf985eb82e52f26cca","infoHashBuffer":{"type":"Buffer","data":[89,204,81,62,194,234,109,13,190,41,97,207,152,94,184,46,82,242,108,202]},"announce":[],"urlList":[]}}