{"title":"Co każdy duży chłopiec wiedzieć powinien. Wydanie 2","uid":15801723,"size":13524895,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:59f5ed27a1beacd4d32e110d2a85542352246af5&amp;dn=Co+ka%C5%BCdy+du%C5%BCy+ch%C5%82opiec+wiedzie%C4%87+powinien.+Wydanie+2&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"BanchMon2","files":1,"time":1473514934,"description":"Co każdy duży chłopiec wiedzieć powinien. Wydanie 2\r\n\r\nFormat pdf, epub, djvu\r\n\r\n\r\nKsiążka polecana przez Kwaśniewska, żonę znanego alkoholika. Jeden z rozdziałów tego poradnika medycznego nosi tytuł &quot;pij z umiarem&quot;. Książka skierowana do mężczyzn. Rysunki do niej robił Mleczko. Czytać w skanach, bo OCR i epub mają literówki. \r\n\r\n\r\nW 2009 roku w Polsce mężczyźni żyli przeciętnie 71,5 roku, natomiast kobiety 80 lat. W porównaniu z początkiem lat 90. ubiegłego stulecia mężczyźni żyją dłużej o ponad 5 lat, kobiety zaś o prawie 5 lat. Mimo pozytywnych zmian w wydłużaniu przeciętnego trwania życia, Polska nadal wypada niekorzystnie na tle krajów europejskich. Wiek dożywania Polaków jest krótszy o kilka lat. Wiek dożywania mężczyzn w naszym kraju jest 8,5 roku krótszy niż kobiet! Dlaczego mężczyźni żyją krócej niż kobiety? Główną przyczyną są uwarunkowania kulturowe. Już mali chłopcy słyszą, że nie powinni okazywać słabości, żeby nie narazić się na drwiny. Tak &quot;zaprogramowani&quot; najczęściej mężczyźni pojawiają się w lekarskim gabinecie dopiero wówczas, gdy ból jest już nie do wytrzymania lub gdy skłonią ich do wizyty zaniepokojone kobiety - partnerki, matki lub siostry. Czas to zmienić. Musimy wytłumaczyć mężczyznom, że od wizyt kontrolnych może zależeć ich życie. Że wczesne wykrycie choroby, to szansa na wyleczenie. Musimy ich przekonać, że wizyta u urologa, kardiologa, czy androloga to nie ostateczność, ale niezbędny standard. To my kobiety, musimy przekonać mężczyzn, że nadszedł czas ich walki o dłuższe życie. Dlatego porozmawiamy ze specjalistami i ze znanymi mężczyznami, o tym jak powinni dbać o siebie nasi mężowie, ojcowie, synowie, bracia i przyjaciele. Dlaczego tę książkę warto przeczytać? Po prostu dlatego, ze jest dobra, bo w sposób mądry, prostymi słowami mówi o sprawach trudnych, sprawach zdrowia mężczyzn","torrent":{"xt":"urn:btih:59f5ed27a1beacd4d32e110d2a85542352246af5","amp;dn":"Co+ka%C5%BCdy+du%C5%BCy+ch%C5%82opiec+wiedzie%C4%87+powinien.+Wydanie+2","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"59f5ed27a1beacd4d32e110d2a85542352246af5","infoHashBuffer":{"type":"Buffer","data":[89,245,237,39,161,190,172,212,211,46,17,13,42,133,84,35,82,36,106,245]},"announce":[],"urlList":[]}}