{"title":"cybermage","uid":11980672,"size":407354513,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:5a0ae8f140a19fd22a4ceed599093257d5720f17&amp;dn=cybermage&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"MADJACKTHEPISSEDPIRATE","files":5,"time":1433192864,"description":"this is an old dos game i played on win 95 back in the day\ngetting it to run is up to you...its too old for you youngsters but it may be a find for us old fossils\n\ni image filed this with clone cd..so you may need to use clone cd to burn it to a cd or you may be able to use daemon or power iso etc....if you get it running and enjoy it make a comment...this is an old game so dont expect graphics..though back then it wasnt bad.\n\nCyberMage is a first-person shooter game with RPG elements designed by David W. Bradley. It was created by Origin and released by Electronic Arts in late 1995. Set in a cyberpunk reality, the game is characterized by a dark, heavy atmosphere. It was not particularly successful in sales, which is attributable to high system requirements and gameplay difficulty.\n\n\nSet in the year 2044, the game features a world ruled by corporations and groups of anti-corporation rebels. The corporations, faced with the rebellion and competition among themselves, start working on implant products that lead to hybrid humans.\n\nThe game's protagonist player awakes up in a bio-gen tube in a strange suit, with a gem implanted in his forehead. The gem is the Darklight, a stone of magical power. After hearing gunshots and explosions, the character crawls out of the tube to find the aftermath of the battle generated by those trying to find him. Amnesiac and disorientated, the character seeks to understand what his true identity is. He discovers that has been experimented upon by the SARCorp corporation, and he seeks revenge for his mistreatment","torrent":{"xt":"urn:btih:5a0ae8f140a19fd22a4ceed599093257d5720f17","amp;dn":"cybermage","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5a0ae8f140a19fd22a4ceed599093257d5720f17","infoHashBuffer":{"type":"Buffer","data":[90,10,232,241,64,161,159,210,42,76,238,213,153,9,50,87,213,114,15,23]},"announce":[],"urlList":[]}}