{"title":"Democracy Now - 24 oct 2011","uid":6768249,"size":457740676,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:5b602cc692c66c96a396ee76f8998e73290bcbde&amp;dn=Democracy+Now+-+24+oct+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":1,"time":1319476613,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Oct 24, 2011\n\n- Obama: With U.S. Withdrawal, &quot;War in Iraq Will Be Over&quot;\n- U.S. to Keep Private Forces, Negotiate New Military Terms in Iraq; Clinton Warns Iran on Withdrawal\n- Libyans Celebrate &quot;Liberation&quot; Following Gaddafi Death\n- U.S. Recalls Syria Ambassador Over Alleged Threats\n- McCain Raises Specter of U.S. Military Action in Syria\n- Panetta: Pacific Region &quot;Top Priority&quot; for U.S. Military\n- Tunisians Select Assembly in First Elections\n- 130 Arrested at Occupy Chicago Protest\n- Cantor Cancels Occupy-Themed Speech Over Protest Fears\n- News Corp Shareholders Press Murdoch on Hacking Scandal\n- Argentina Re-Elects Fernandez de Kirchner\n- Venezuelan President Hugo ChÃƒÂ¡vez Says He's Free of Cancer\n- NPR Drops Opera Program Over Host's Activism\n\n\nSpecial reports\n\n- Michael Moore &amp; Cornel West on OWS, Iraq &amp; the Progressive Discontent Obama Faces in '12 Vote\n\nAs Occupy protests against inequality and corporate greed continue across the United States and around the world, we're joined by Michael Moore, Academy Award-winning filmmaker and activist, and Princeton University Professor Cornel West. &quot;We expect [President Obama] to do the work of the people,&quot; Moore says. &quot;The people are not going to go away. He can either go down as an historic President who become the FDR of this century, or he can be remembered as the man who was in the pocket of Goldman Sachs.&quot; West added, &quot;What we are trying to do is connect what is going on with Wall Street to what is going on in Harlem. ... If we continue to have this kind of magnificent movement here and around the world, we want to connect in the corporate greed in Wall Street, and the military industrial complex, the prison complex, and the corporate media multiplex.&quot;\n\n\n- Occupy Louisville: Voices From Social Justice Encampment in The Hometown of Muhammed Ali\n\nOver the weekend, Democracy Now! host Amy Goodman visited demonstrators at Occupy Louisville, a protest inspired by Occupy Wall Street. They've set up an encampment right across the street from a local jail. We hear from veterans, students, social justice activists, and other community members who spent the night at the protest.\n\n\n- Dr. Cornel West: &quot;We Are in a Magnificent Moment of Democratic Awakening&quot;\n\nPrinceton University professor and renowned civil rights activist Cornel West was arrested Friday afternoon during a demonstration in Harlem against alleged racial profiling by the New York City Police Department. West joined a protest against the NYPD's stop-and-frisk policy, which critics say disproportionately targets people of color. New York City police carried out 600,000 such searches last year, with 87 percent of the targets being black or Hispanic. West's arrest in New York City comes just a week after he and 18 others were arrested on the steps of the U.S. Supreme Court during a protest against the increasing role of money in politics, the same day that the new Dr. Rev. Martin Luther King, Jr. memoir was dedicated. A professor of religion and African American studies at Princeton University, West is the author of numerous books, including his memoir, &quot;Brother West: Living and Loving Out Loud.&quot;\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:5b602cc692c66c96a396ee76f8998e73290bcbde","amp;dn":"Democracy+Now+-+24+oct+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5b602cc692c66c96a396ee76f8998e73290bcbde","infoHashBuffer":{"type":"Buffer","data":[91,96,44,198,146,198,108,150,163,150,238,118,248,153,142,115,41,11,203,222]},"announce":[],"urlList":[]}}