{"title":"Various Artists - Fascinatin' Rhythm (Capitol Sings George Gersh","uid":9171320,"size":409745553,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:5be875ff0be001c13105c92ac3e2057148e9e2f6&amp;dn=Various+Artists+-+Fascinatin%27+Rhythm+%28Capitol+Sings+George+Gersh&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"alekow1","files":38,"time":1384075885,"description":"\nFascinatin' Rhythm: Capitol Sings Gershwin is a very enjoyable sampler, featuring a generous selection of Capitol recording artists singing many of the best items in George Gershwin's catalog. \nEvery featured artist more or less fits into the &quot;traditional pop vocal&quot; category, but there's enough variety in their vocals and arrangements to make this a varied, consistently entertaining listen. (AMG)\n\n\n\n&quot;Fascinatin' Rhythm,&quot; the Capitol Sings collection of George Gershwin tunes, begins with Freddy Martin and his Orchestra doing a version of &quot;Rhapsody in Blue&quot; to which you can swing your partner around the dance floor, perfectly capturing the charm of this series. \nHere are your favorite songs by our greatest composers often done in different ways from what you usually expect. But changing music style or tempo, adding percussions or strings, are what make these songs so enjoyable. \nDorothy Donegan's &quot;A Foggy Day&quot; is a particularly jazzy version, but then Margaret Whiting's &quot;But Not For Me&quot; is big band style while Ann Richards does a very slow and sultry cover of &quot;I Got Rhythm&quot; (at least at the start). Sometimes the twist is that someone like Gordon MacRae sings &quot;Summertime,&quot; a song he would certainly never get to do on stage in &quot;Porgy &amp; Bess&quot; for a couple of rather obvious reasons. \nLike all the albums in this series, &quot;Fascinatin' Rhythm&quot; combines covers by big stars like Nat King Cole, Judy Garland, Tony Bennett and Peggy Lee with lesser known artists such as Keely Smith, Jo Ann Greer, Dakota Staton and Marian McPartland (I guess I would have to put Anna Marie Alberghetti in the middle on this one). My favorite track on this album would be Judy Garland's live version of &quot;Swanee,&quot; but &quot;They Can't Take That Away From Me&quot; is certainly one of Peggy Lee's best efforts. \n&quot;Fascinatin' Rhythm&quot; may be well be the most female artist dominated disc in the Capitol Sings collection, which for my money only adds to its enjoyment. (Customer from Amazon)\n\n &lt;a href=&quot;\nhttp://i.imgur.com/4QLm4G5.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i.imgur.com/4QLm4G5.jpg&lt;/a&gt;\n\n\n01. Freddy Martin &amp; His Orchestra - Rhapsody In Blue    [3:10]\n02. Dorothy Donegan - A Foggy Day    [2:11]\n03. Margaret Whiting - But Not For Me    [2:59]\n04. The Nat King Cole Trio - Embraceable You    [3:24]\n05. Vic Damone - Fascinatin' Rhythm    [2:09]\n06. Ann Richards - I Got Rhythm    [4:08]\n07. Liza Minnelli - I'll Build A Stairway To Paradise    [2:07]\n08. Ella Mae Morse - It Ain't Necessarily So    [2:19]\n09. Marian McPartland - Let's Call The Whole Thing Off    [2:44]\n10. Jeri Southern - Nice Work If You Can Get It    [1:58]\n11. Andrews Sisters - Of Thee I Sing    [2:16]\n12. Julie London - 'S Wonderful    [1:34]\n13. Jean Turner - Someone To Watch Over Me    [2:37]\n14. Tony Bennett - Strike Up The Band    [1:33]\n15. Gordon Macrae - Summertime    [2:59]\n16. Judy Garland - Swanee    [2:04]\n17. Dakota Staton - They All Laughed    [2:08]\n18. Peggy Lee - They Can't Take That Away From Me    [2:30]\n19. June Christy - How Long Has This Been Goin' On    [4:57]\n20. Jo Ann Greer - That Certain Feeling    [2:01]\n21. Kate Smith - Who Cares (As Long As You Care For Me)    [2:253]\n22. Kenny Gardner - I Got Plenty Of Nuttin'    [2:49]\n23. Keely Smith - The Man I Love    [3:16]\n24. Anna Maria Alberghetti - I've Got A Crush On You    [2:43]\n\n\n\nLabel: Capitol Records\nReleased: 1992\nCatalogue: CDP 7 96792 2\n\n\n\n\n\n\n\nCodec: Flac\nCompression Level: 6\nQuality: High\n\n\nCD-rip by alekow (EAC and Flac)\nCovers Included (600dpi)\n\n\n\n\n\n\n\nEnjoy, Seed and Share\n","torrent":{"xt":"urn:btih:5be875ff0be001c13105c92ac3e2057148e9e2f6","amp;dn":"Various+Artists+-+Fascinatin%27+Rhythm+%28Capitol+Sings+George+Gersh","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5be875ff0be001c13105c92ac3e2057148e9e2f6","infoHashBuffer":{"type":"Buffer","data":[91,232,117,255,11,224,1,193,49,5,201,42,195,226,5,113,72,233,226,246]},"announce":[],"urlList":[]}}