{"title":"Sexually Broken--Tan busty blonde Leya Falcon bound and bent ove","uid":11373950,"size":627700246,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:5c2178ff93714fdb28500456806fa1982dae9af2&amp;dn=Sexually+Broken--Tan+busty+blonde+Leya+Falcon+bound+and+bent+ove&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"merzedes","files":-1,"time":1415125264,"description":"\nTan busty blonde Leya Falcon bound and bent over, rough blindfolded sex and brutal deepthroat! | Leya Falcon | Matt Williams \n\nNovember 3, 2014\n\n\nHigh MP4 only.\n\n\nBig breasted blonde restrained and blindfolded then used without mercy from both ends \n\nSensory deprivation is the spice that can take fucking to the next level. And today we have the perfect subject to practice some spice on. Leya Falcon is blonde, busty and tan with a phat ass made for the pounding. Bending her juicy ass over our custom made wooden fuck box, Leya is shackled and bound into place. A metal bar makes both a handy grip bar and a convenient place to tie up her hair. With her hair restrained, Leya can not move her head away or dodge the dick. A leather blindfold is the final touch.\n\nOnce the blindfold is in place, Leya can not see or anticipate a thing. Firmly bound with both ends deliciously exposed, Leya is reduced to a bag of holes for our use. We can plunge home balls deep in either mouth or pussy as we see fit, and that is exactly what we do. We switch back and forth, pounding out her pussy and then using her mouth and then back again. Leya moans and cums gratefully as she is fucked so hard her teeth rattle.\n\nIt is a relentless training of her holes, and all the while Leya is locked in total darkness. The bondage and orgasm overload blasts her into sexual subspace and we are still not done with her yet. A vibrator rips yet another orgasm out of that smooth shaved pussy as Leya strains in her shackles. She is dazed and woozy, finally able to grasp the true meaning of Sexuallybroken. \n\nToday was not a regular day at the LA porn office for Leya. Instead, it was a brutal throat and pussy training in strict bondage with relentless orgasm overload. She will not be forgetting her training anytime soon, will you my dear? \n \nScreens &lt;a href=&quot;\nhttp://sexuallybroken.com/sexual/bondage/2014/11_03lfalcon2/SexuallyBroken-Leya-Falcon-Matt-Williams-Tan-busty-blonde-Leya-Falcon-bound-and-bent-over-rough-blindfolded-sex-and-brutal-deepthroat.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://sexuallybroken.com/sexual/bondage/2014/11_03lfalcon2/SexuallyBroken-Leya-Falcon-Matt-Williams-Tan-busty-blonde-Leya-Falcon-bound-and-bent-over-rough-blindfolded-sex-and-brutal-deepthroat.php&lt;/a&gt;\n\n16 000 Femdom/BDSM/Fetish torrentuploads completed. Man.. feels like every 1000 goes by faster and faster ;)\n\nJust keep on leaving us the nice comments below and we are happy :)\n\n\nAny Questions ?? Read our FAQ!!\n   &lt;a href=&quot;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&lt;/a&gt;\n\n\nCheers  :-)","torrent":{"xt":"urn:btih:5c2178ff93714fdb28500456806fa1982dae9af2","amp;dn":"Sexually+Broken--Tan+busty+blonde+Leya+Falcon+bound+and+bent+ove","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5c2178ff93714fdb28500456806fa1982dae9af2","infoHashBuffer":{"type":"Buffer","data":[92,33,120,255,147,113,79,219,40,80,4,86,128,111,161,152,45,174,154,242]},"announce":[],"urlList":[]}}