{"title":"The Next Million Years - Charles Galton Darwin (1953)","uid":8849532,"size":839303,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5c4c3560d575b71aaae862a8599d3ba2094eceb2&amp;dn=The+Next+Million+Years+-+Charles+Galton+Darwin+%281953%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Djofullinn","files":-1,"time":1377486865,"description":"Charles Galton Darwin, the author of -The Next Million Years,- was a physicist and eugenicist and the grandson of Charles Darwin. Published in 1953, Mr. Darwin's book is amazingly prescient about what the next fifty years would bring: energy shortage (oil), food shortage, and the -pressures- of overpopulation. While the author speculates what the remedies can or might be implemented for resolution of these problems, Mr. Darwin is primarily interested in the essential problem - Man -- and how his essential problematic human nature can be perfected from the wild animal that he is to one that is controlled and perfected so as to reach his or her maximum effectiveness in a world of limited resources. Thus, it is not until Chapter VIII of this 11-chaptered work that the general dullness and mechanical verbal probity of the rhetoric disappears and the reader is palpably confronted with a horrifying but superficially scientific creed which asserts that inheritable wealth comes from the inherited ability of successful and wealthy families, and that because these wealthy familes, generation after generation, have proven themselves &quot;successful&quot; because of their consistent -success- through time, they, therefore, must be of superior intelligence and ability over the rest of mankind, and, concomitantly, these families, and the individual members of these families, alone are fit to be the elite and to rule over and control the rest of the human race.\n\nCharles Galton Darwin foresees a future in which human beings are farmed and bred like animal stock (page 184), each to a specialized purpose (including the use of drugs and artificial use of hormones to remove the sexual desire out of -inferior- human beings), completeley controlled by the so-called successful elite. In this new creed, it will be necessary to revise the old doctrine of the sanctity of the individual human life as well and to create policies that would allow the very unlucky in life (including babies) not to survive and not selfishly waste limited, precious, natural resources needed by the functional upper classes.\n\nThe author concludes, presciently as well, that China will be the civilization emblematic of the future the elite are planning as it not only has endured for century after century, longer than the Roman Empire, but the very way of life in China, socially crowded and politically cowed, is a good paradigm for what the future of the entire world shall broadly look like in the 21st century with its provinces, dynasties, and collectivism spearheaded under one central head or world government owned and run by future descendants of the Darwin family and other -successful- familes in addition. ","torrent":{"xt":"urn:btih:5c4c3560d575b71aaae862a8599d3ba2094eceb2","amp;dn":"The+Next+Million+Years+-+Charles+Galton+Darwin+%281953%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5c4c3560d575b71aaae862a8599d3ba2094eceb2","infoHashBuffer":{"type":"Buffer","data":[92,76,53,96,213,117,183,26,170,232,98,168,89,157,59,162,9,78,206,178]},"announce":[],"urlList":[]}}