{"title":"[MonkeyVision] Backtrack Linux 3.0 Live CD","uid":4341116,"size":2272239670,"categoryP":"applications","categoryS":"unix","magnet":"?xt=urn:btih:5ca0759f46b798dc18de55f16039a21798dbbde4&amp;dn=%5BMonkeyVision%5D+Backtrack+Linux+3.0+Live+CD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"psiborg999","files":4,"time":1218600757,"description":"[MonkeyVision] BackTrack 3.0 Linux\n\nBackTrack 3.0 (third release)\n======================================================\nCompany / developer: Mati Aharoni, Max Moser, Remote-Exploit, jayme\n\nOS family: Linux\n\nWorking state: Current\n\nSource model: Free and Open Source Software\n\nLatest stable release: 3.0 &gt;&gt;&gt; June 19, 2008\n\nKernel type: Monolithic kernel\n\nDefault user interface: KDE, Fluxbox\n\nLicense: Various\n\n\nWebsite: www.remote-exploit.org\n\n\n\nSize: 2.1 Gig Total.\n\n\n\nFiles: (4)\n\nCD ISO Image (700 meg),\nUSB ISO Image (784 meg),\nVMWARE Virtual Machine (689 meg, RAR Compressed),\nnfo file\n\n\n\n\n\nQUICK SYNOPSIS:\n=====================================================\n\nBackTrack is a Slackware and SLAX-based live CD with a collection of security and forensics tools. \nIt was created by merging Auditor Security Linux with WHAX (formerly Whoppix).\n\n\n\n\n\nFULL INFO:\n=======================================================\n\n BackTrack is a Linux distribution distributed as a Live CD which resulted from the merger of WHAX and the Auditor Security Collection. It takes advantage of SLAX&amp;#039;s modular design and structure to enable the user to include customizable scripts, additional tools and configurable kernels in personalized distributions. The BackTrack project was created by Mati Aharoni and Max Moser (with updates provided by jayme) and is a collaborative effort involving the community.\nBackTrack 2 was released on March 6, 2007 and includes over 300 security tools. A beta version of BackTrack 3 was released on December 14, 2007, but it was announced that its main focus was to support more and newer hardware as well as provide more flexibility and modularity.\nBackTrack 3 was released on June 19, 2008. New additions include SAINT and Maltego. Nessus was not included in this release, and the developers decided not to upgrade from kernel version 2.6.21.5.\n\nFeatures\n---------------------\nBackTrack focuses its central idea on the needs of computer penetration testers. The inclusion of Live CD and Live USB functionality enables any user to just insert their respective data medium and boot up BackTrack. Direct hard disk installations (2.7 GB uncompressed) can also be completed within the Live CD (700 MB compressed) environment through the basic graphical installation wizard with no restart subsequent to installation. BackTrack further continues its compatibility with the computer forensics demographic with accessibility and internationalization by including support for Japanese input in reading and writing in Hiragana, Katakana and Kanji.\n\n\nThe key additions to the BackTrack suite are notably -\n--------------------------------------------------------------------------------\n\nMetasploit integration\nRFMON wireless drivers\nKismet\nAutoScan-Network - AutoScan-Network is a network discovering and managing application\nNmap\nEttercap\nWireshark (formerly known as Ethereal)\n\n\n\nBackTrack&amp;#039;s functionality further increases with the arrangement of each tool in 16 categories.\n\nThe tool categories are as follows -\n\nEnumeration\nExploit Archives\nScanners\nPassword Attacks\nFuzzers\nSpoofing\nSniffers\nTunneling\nWireless Tools\nBluetooth\nCisco Tools\nDatabase Tools\nForensic Tools\nBackTrack Services\nReversing\nMisc.\n\n\nIn relation to basic software packages, BackTrack includes some ordinary desktop programs such as Mozilla Firefox, Gaim, K3b, and XMMS.\n\n\nCriticism\n----------------------------\nThe BackTrack 2 release garnered some criticism. The security suite did not include the popular security scanner Nessus, due to various licensing problems. Newer releases also created problems with PostgreSQL in Fluxbox which created an error, as well as the inclusion of programs such as the aforementioned Nessus and VMware which did not work. According to news releases the new version of BackTrack 3 will include advertising. Currently, bookmarks in Firefox seem to be the only advertising visible in version 3 Beta.\n\n\nTraining\n---------------------------\nThe Backtrack security distro has spawned a spin-off training course called Offensive Security, as well as the Offensive Security Certified Professional certification. This training course teaches basic penetration testing using the Backtrack Live CD.\n\n\n\nSummary\n---------------------------\n\nThis is an excellent Security testing Tool. PLEASE use it with caution and wisdom.\n\nI&amp;#039;ve included the Live CD Image, Live USB image, and the VMWARE Virtual Machine.\n\n\n\n-UncleMonkey777","torrent":{"xt":"urn:btih:5ca0759f46b798dc18de55f16039a21798dbbde4","amp;dn":"%5BMonkeyVision%5D+Backtrack+Linux+3.0+Live+CD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5ca0759f46b798dc18de55f16039a21798dbbde4","infoHashBuffer":{"type":"Buffer","data":[92,160,117,159,70,183,152,220,24,222,85,241,96,57,162,23,152,219,189,228]},"announce":[],"urlList":[]}}