{"title":"Listening In - The Secret White House Recordings of John F. Kenn","uid":9256571,"size":21709884,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5d60e76218a484289c65fb5e2970bd5455869c88&amp;dn=Listening+In+-+The+Secret+White+House+Recordings+of+John+F.+Kenn&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"gnv65","files":-1,"time":1385559264,"description":"Listening In - The Secret White House Recordings of John F. Kennedy \nby Ted Widmer and Caroline Kennedy\nHyperion | September 2012 | ISBN-10: 1401324568 | ePUB/PDF | 12.8/7.88 mb &lt;a href=&quot;\nhttp://www.amazon.com/Listening-In-Secret-Recordings-Kennedy/dp/1401324568&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Listening-In-Secret-Recordings-Kennedy/dp/1401324568&lt;/a&gt;\nPDF conversion is mine.\n\nIn July 1962, in an effort to preserve an accurate record of Presidential decision-making in a highly charged atmosphere of conflicting viewpoints, strategies and tactics, John F. Kennedy installed hidden recording systems in the Oval Office and in the Cabinet Room. The result is a priceless historical archive comprising some 265 hours of taped material. JFK was elected president when Civil Rights tensions were near the boiling point, and Americans feared a nuclear war. Confronted with complex dilemmas necessitating swift and unprecedented action, President Kennedy engaged in intense discussion and debate with his cabinet members and other advisors. Now, in conjunction with the fiftieth anniversary of the Kennedy presidency, the John F. Kennedy Library and historian Ted Widmer have carefully selected the most compelling and important of these remarkable recordings for release, fully restored and re-mastered onto two 75-minute CDs for the first time. Listening In represents a uniquely unscripted, insider account of a president and his cabinet grappling with the day-to-day business of the White House and guiding the nation through a hazardous era of uncertainty.\nAccompanied by extensively annotated transcripts of the recordings, and with a foreword by Caroline Kennedy, Listening In delivers the story behind the story in the unguarded words and voices of the decision-makers themselves. Listening In covers watershed events, including the Cuban Missile Crisis, the Space Race, Vietnam, and the arms race, and offers fascinating glimpses into the intellectual methodology of a circumspect president and his brilliant, eclectic brain trust.\nJust as the unique vision of President John F. Kennedy continues to resonate half a century after his stirring speeches and bold policy decisions, the documentary candor of Listening In imparts a vivid, breathtaking immediacy that will significantly expand our understanding of his time in office.\n\nAbout the Author\nForward by Caroline Kennedy, editor of the New York Times bestselling Jacqueline Kennedy: Historic Conversations on Life with John F. Kennedy, She Walks in Beauty, A Patriot's Handbook, Profiles in Courage for Our Time, The Best-Loved Poems of Jacqueline Kennedy Onassis, A Family of Poems, and A Family Christmas and the coauthor of The Right to Privacy and In Our Defense: The Bill of Rights in Action. She serves as president of the John F. Kennedy Library Foundation and lives in New York City.\nAnnotation by Ted Widmer, Director and Librarian of the John Carter Brown Library at Brown University. He is the author or editor of many works of American history, and a frequent contributor to The New York Times, Washington Post, International Herald Tribune, and other publications. He was a speechwriter and senior adviser to President Clinton, and conducted the oral history project that accompanied President Clinton's preparation for his memoir, My Life. He was educated at Harvard University.","torrent":{"xt":"urn:btih:5d60e76218a484289c65fb5e2970bd5455869c88","amp;dn":"Listening+In+-+The+Secret+White+House+Recordings+of+John+F.+Kenn","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5d60e76218a484289c65fb5e2970bd5455869c88","infoHashBuffer":{"type":"Buffer","data":[93,96,231,98,24,164,132,40,156,101,251,94,41,112,189,84,85,134,156,136]},"announce":[],"urlList":[]}}