{"title":"The Revised Fundamentals of Caregiving - Jonathan Evison","uid":13350782,"size":761758,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5d63f1c3dd19c826bf45202b12fd12c2c48edc5f&amp;dn=The+Revised+Fundamentals+of+Caregiving+-+Jonathan+Evison&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1454085104,"description":"In The Revised Fundamentals of Caregiving (soon to be released as a feature film titled The Fundamentals of Caring, starring Paul Rudd and Selena Gomez), Jonathan Evison, author of the new novel This Is Your Life, Harriet Chance! and the New York Times bestseller West of Here, has crafted a novel of the heart, a story of unlikely heroes in a grand American landscape.\r\n\r\nFor Ben Benjamin, all has been lost--his wife, his family, his home, his livelihood. Hoping to find a new direction, he enrolls in a night class called The Fundamentals of Caregiving, where he will learn to take care of people with disabilities. He is instructed about professionalism, about how to keep an emotional distance between client and provider, and about the art of inserting catheters while avoiding liability. But when Ben is assigned his first client--a tyrannical nineteen-year-old boy named Trevor, who is in the advanced stages of Duchenne muscular dystrophy--he soon discovers that the endless service checklists have done nothing to prepare him for the reality of caring for a fiercely stubborn, sexually frustrated teenager who has an ax to grind with the whole world.\r\n\r\nOver time, the relationship between Ben and Trev, which had begun with mutual misgivings, evolves into a close friendship, and the traditional boundaries between patient and caregiver begin to blur. The bond between them strengthens as they embark on a road trip to visit Trev’s ailing father--a journey rerouted by a series of bizarre roadside attractions that propel them into an impulsive adventure disrupted by one birth, two arrests, a freakish dust storm, and a six-hundred-mile cat-and-mouse pursuit by a mysterious brown Buick Skylark. By the end of that journey, Trev has had his first taste of love, and Ben has found a new reason to love life.\r\n\r\nBursting with energy and filled with moments of absolute beauty, this big-hearted and inspired novel ponders life’s terrible surprises as well as what it takes to truly care for another human being","torrent":{"xt":"urn:btih:5d63f1c3dd19c826bf45202b12fd12c2c48edc5f","amp;dn":"The+Revised+Fundamentals+of+Caregiving+-+Jonathan+Evison","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5d63f1c3dd19c826bf45202b12fd12c2c48edc5f","infoHashBuffer":{"type":"Buffer","data":[93,99,241,195,221,25,200,38,191,69,32,43,18,253,18,194,196,142,220,95]},"announce":[],"urlList":[]}}