{"title":"PCSX2-1.0.0-r5350-Released-2012-(AMW3)","uid":7623806,"size":8945751,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:5d858a86e8262fdc38fdeb7fdcad3ab8f0d934e0&amp;dn=PCSX2-1.0.0-r5350-Released-2012-%28AMW3%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"AssassinMW3","files":-1,"time":1347387995,"description":"PCSX2 1.0 released! 2012 \n\n\nAfter many long years of development, debugging and testing effort, we have reached a point where PCSX2 runs a great majority of the games, and there are no important issues that could possibly be fixed without requiring major modifications to the emulator.\n\nBecause of that (and because we already felt it was overdue), we decided to stop thinking of new things to do for a bit, polish the stability, compatibility and existing features and release the result as the first major version of PCSX2!\n\nThere have been tons of changes since the last release, including improvements to Jake Stine's wxWidgets GUI overhaul, cottonvibes' new multithreaded VU core and improvements on the primary plugins.\n\nThis release is a big milestone that marks the way to new features and improvements!\n\nHere is an excerpt of the latest changes:\n\nWindows\n\nCore:\n\n    Video timing adjustments\n    microVU fixes for Metal Gear Solid 2 and others\n    General speedups\n    microVU speedup\n    New GIF unit that mimics the real one better\n    microVU elementary function bug fixed (affecting Valkyrie Profile 2, Radiata Stories and Star Ocean 3)\n    Implemented Multi-Threaded VU! A new speed hack with almost 100% compatibility with games, using a third core to run the VU1 unit separately\n    CDVD fixes (Time Crisis boots now)\n    Added support for progressive scan timings\n    Path 3 arbitration and timing refinements\n    Added Finnish, Malaysian, Korean, French, Indonesian, Italian, Japanese and Polish translations\n\n\nSPU2-X:\n\n    Configurable output volume\n    Fixes to reverb\n    Various sound looping fixes\n    Improved time stretcher\n    Reverse phase audio quality improved\n\n\nGSdx:\n\n    Fixed RGB mode movie recording\n    Texture cache change that fixes some black screening games\n    Implemented NVidia FXAA 3.10, page up key activates it\n    Better multithreading\n    Arc the Lad bad fog fix\n    Fixed shadows in software renderer\n    Implementation of GSdx &quot;Shadeboost&quot; project (saturation, brightness, contrast settings)\n    User configurable hacks in the GUI\n    Fixed flickering in many FMVs\n    Implementation of GSdx &quot;Cutie&quot; project (various extra CRC hacks)\n\n\nLilypad:\n\n    Pad state getting stuck with savestates bug fixed\n\n\nUSBqemu:\n\n    Revamped it a bit\n\n\nLinux:\n\nOnePad changes:\n\n    New dialog configuration panel\n    Improved support of various pad (sixaxis)/mouse/wiimote\n    Added support for more controllers\n    Added support for pressure-sensitive buttons\n\n\nGSdx:\n\n    GSdx ported for Linux! Based on OpenGL 3.3 with some 4.x hardware independent extensions. Requires OpenGL 4.2 drivers and is still in experimental stages. Don't expect the hardware renderer to run properly, but the Software renderer should be fine.\n\n    Added support for configuration and keyboard shortcuts from PCSX2\n\n\nZZogl:\n\n    Added support for configuration and keyboard shortcuts from PCSX2\n    Added a GLSL backend to replace CG. Like GSdx, it requires OpenGL 4.2 drivers. Only available with PCSX2 self-compilation.\n\n\nPCSX2 GUI:\n\n    Added thread timing information to see the CPU usage in the status bar\n    Fix multiple frame/box letters sizing.\n\n\n\nIn addition to these changes we found a fixed several bugs that could lead to crashes in various situations.\nThe PCSX2 executable has been built and tested with PGO optimizations enabled so it will be an extra 10% faster over regular SVN builds.\n\nWe hope you enjoy this first major version release and have fun playing your games on it! Smile","torrent":{"xt":"urn:btih:5d858a86e8262fdc38fdeb7fdcad3ab8f0d934e0","amp;dn":"PCSX2-1.0.0-r5350-Released-2012-%28AMW3%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5d858a86e8262fdc38fdeb7fdcad3ab8f0d934e0","infoHashBuffer":{"type":"Buffer","data":[93,133,138,134,232,38,47,220,56,253,235,127,220,173,58,184,240,217,52,224]},"announce":[],"urlList":[]}}