{"title":"Pink Floyd - P.U.L.S.E. (resequenced and expanded by }{eywood)","uid":9121920,"size":1233276485,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:5deff80445e67ca4d231837b80d959107cd387a0&amp;dn=Pink+Floyd+-+P.U.L.S.E.+%28resequenced+and+expanded+by+%7D%7Beywood%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"}{eywood","files":35,"time":1383149955,"description":"Here we have Pink Floyd's P*U*L*S*E* album as it should have been made.  Restricting it to a 2CD set was a mistake that I have remedied.  This includes the entire 2CD set plus additions from other sources, which I will explain shortly.\n\nBut first a little background.\n\nPink Floyd's 1994 tour had, primarily, two setlists: the standard one, and the Dark Side of the Moon one.  The standard setlist was played for most of the tour, and it contained a spot in it where there was an optional song from night to night.  In the first set you would hear either &quot;Lost For Words&quot;, &quot;A Great Day For Freedom&quot;, or &quot;Coming Back To Life&quot;, depending on what show you went to.  If they played multiple nights in the same city each night that song would change.  Occasionally they would also pull an oddity out, such as &quot;Marooned&quot; in Oslo, but for the most part the set stayed within these parameters. For the last few shows of the North American tour they surprised everyone by breaking out the Dark Side of the Moon in its entirety for the second set.  This meant that several of the regular songs were dropped from the show, and several of the normally second set numbers were relocated to the first set. This set was also used for the last couple weeks worth of shows at Earl's Court that closed the tour.\n\nP*U*L*S*E attempted to combine both setlists and give a more thorough overview of the tour than any one show would have.  The problem is they made it to fit on 2 CDs, thereby causing several songs to not make the cut.  &quot;Take It Back&quot;, &quot;Lost For Words&quot;, &quot;One of These Days&quot; and &quot;On The Turning Away&quot; never made it to the CD, although &quot;One of These Days&quot; did get on the cassette version.  Also on the cassettes is a 20 minute condensation of the soundscape played before the show (when you came into the stadium a sound effects tape was playing on the quadrophonic soundsystem, showing off what it could do and substituting for an opening act).\n\nWhat I've done here is to take the CD version and combine it with the cassette and DVD versions in order to replace a couple of the missing portions, as well as resequence the entire thing to be in a semblance of the order it would have been played if all this material were done at one show.  With no CD time restrictions I believe the show flows better this way and is a truer representation of a Pink Floyd show than the released version.  Below is the tracklisting with the shows the songs were recorded at listed after the title for anyone who was wondering.\n\n\n01. Introductory Soundscape\n02. Astronomy Domine (Earl's Court 10-15-94)\n03. Learning To Fly (Earl's Court 10-14-94)\n04. What Do You Want From Me (Rome 9-21-94)\n05. A Great Day For Freedom (Earl's Court 10-19-94)\n06. Sorrow (Rome 9-21-94)\n07. Keep Talking (Hannover 8-17-94)\n08. Take It Back (Earl's Court 10-20-94)\n09. Coming Back To Life (Earl's Court 10-20-94)\n10. High Hopes (Earl's Court 10-20-94)\n11. One Of These Days (Earl's Court: first half 10-16-94, second half 10-20-94)\n12. Shine On You Crazy Diamond (Earl's Court 10-20-94)\n13. Speak To Me (Earl's Court 10-20-94)\n14. Breathe (Earl's Court 10-20-94)\n15. On The Run (Earl's Court 10-20-94, explosion Earl's Court 10-15-94)\n16. Time (intro Modena 9-17-94, Earl's Court 10-20-94,)\n17. Breathe (reprise) (Earl's Court 10-20-94)\n18. The Great Gig In The Sky (Earl's Court 10-20-94)\n19. Money (Modena 9-17-94)\n20. Us And Them (Earl's Court 10-20-94)\n21. Any Colour You Like (Earl's Court 10-23-94)\n22. Brain Damage (Earl's Court 10-19-94)\n23. Eclipse (Earl's Court 10-19-94)\n25. Wish You Were Here (Rome 9-20-94)\n24. Another Brick In The Wall Part 2 (Earl's Court 10-20-94) \n26. Comfortably Numb (Earl's Court 10-20-94)\n27. Hey You (Earl's Court 10-13-94, last verse Earl's Court 10-15-94)\n28. Run Like Hell (Earl's Court 10-15-94)\n\n\n\nFor this release {&quot;Take It Back&quot; and &quot;Coming Back To Life&quot; were taken from the P*U*L*S*E DVD (the version of CBTL used on the CD is from the same show, but it is more natural sounding when connected to &quot;Take It Back&quot; as on the DVD) and the Soundscape and first few notes of &quot;One of These Days&quot; (the wind and the bass up until the keyboards come in) are from the cassette version.  The first half of &quot;One Of These Days&quot; (up until the loud part begins) is taken from a pre-FM broadcast CD of the &quot;Pink Floyd: Up Close&quot; radio show.  This is the only place OOTD is released at CD quality.  All other versions are available only on cassette releases.  The intro of OOTD is from cassete only because of dialogue over it on the radio show.  the loud part of the song is from the DVD (it was the same show used for the cassette version).  All other songs are from the standard release CD, but ordered differently.","torrent":{"xt":"urn:btih:5deff80445e67ca4d231837b80d959107cd387a0","amp;dn":"Pink+Floyd+-+P.U.L.S.E.+%28resequenced+and+expanded+by+%7D%7Beywood%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5deff80445e67ca4d231837b80d959107cd387a0","infoHashBuffer":{"type":"Buffer","data":[93,239,248,4,69,230,124,164,210,49,131,123,128,217,89,16,124,211,135,160]},"announce":[],"urlList":[]}}