{"title":"Richard Hoagland - Other Side of Midnight - July 2015 *CORRECTED","uid":12323964,"size":404237607,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:5e0cbd68c4d8d8d247fc3b41e2fdfeea758db82e&amp;dn=Richard+Hoagland+-+Other+Side+of+Midnight+-+July+2015+%2ACORRECTED&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"NotHuman","files":12,"time":1441091669,"description":"Richard C. Hoagland - The Other Side of Midnight Internet radio show MP3s\nJuly 2015 - \n\nThis is a collection of MP3s of The Other Side of Midnight, a streaming Internet radio program, hosted by Richard C. Hoagland.  \n\nThe Other Side of Midnight airs on the Dark Matter Digital Network weekdays from 3-5am  Eastern (12-2am Pacific), immediately following Art Bell's Midnight in the Desert.  From the website:     \n\n &quot;A new beginning into the exploration of matters of scientific importance and the impact on society and our human existence, the Other Side of Midnight takes you on a  journey through the minds of exceptional scientific experts, investigators and analysts.\n\n Panel discussions feature opposing points of view to discuss a wide variety of positions on science, humanity and government projects, while also venturing into comparisons  of \nour own science fiction dreams and the reality of our human existence.&quot;\n\nThe MP3s were captured directly from the Dark Matter Digital Network radio stream at its broadcast bitrate of 48kbps using the program streamWriter, with no re-encoding performed (with the exception of a few files from July 2015 which were recorded analog through my system's sound card audio before I learned to do it properly).  All MP3s are properly tagged with the guest name and topic in the comments tag.  \n\nMy plan is to seed a new Other Side of Midnight torrent at the end of each month, containing all of the shows for that month.  The first torrent is July 2015, and the last will be to be determined (depending on the popularity of the torrents).  \n\nIf you are planning on downloading multiple torrents, simply point each torrent to download to the top level folder above the &quot;Richard C. Hoagland - The Other Side of Midnight&quot; folder and the individual months will download to their own subfolders.  \n\nThe name of each torrent may appear the same in your BT client (depending on the client).  This is necessary to keep the folder structure I want as this will be a series of torrents with subfolders.  You can see which month/year a torrent is by clicking the Files tab for each torrent.  \n\n\nRelevant links:\n &lt;a href=&quot;\nhttp://othersideofmidnight.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://othersideofmidnight.com/&lt;/a&gt;\n &lt;a href=&quot;\nhttp://darkmatterdigitalnetwork.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://darkmatterdigitalnetwork.com/&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.enterprisemission.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.enterprisemission.com/&lt;/a&gt;","torrent":{"xt":"urn:btih:5e0cbd68c4d8d8d247fc3b41e2fdfeea758db82e","amp;dn":"Richard+Hoagland+-+Other+Side+of+Midnight+-+July+2015+%2ACORRECTED","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5e0cbd68c4d8d8d247fc3b41e2fdfeea758db82e","infoHashBuffer":{"type":"Buffer","data":[94,12,189,104,196,216,216,210,71,252,59,65,226,253,254,234,117,141,184,46]},"announce":[],"urlList":[]}}