{"title":"Memoirs of a Geisha (Multi-Subs)(Juultje)(2Lions-Team)","uid":5937793,"size":4652962200,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:5e878680e71cf0b67ce772e09f26a9af3eaf51b6&amp;dn=Memoirs+of+a+Geisha+%28Multi-Subs%29%28Juultje%29%282Lions-Team%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"juutje","files":-1,"time":1289032402,"description":"Memoirs of a Geisha (2005)\n\nWon 3 Oscars.\n\nVerenigde Staten\nDrama / Romantiek\n145 minuten\n\ngeregisseerd door Rob Marshall\nmet Ziyi Zhang, Ken Watanabe en Michelle Yeoh\n\nEen verhaal van liefde en verraad tegen de achtergrond van de snel veranderende Japanse maatschappij in de 20ste eeuw. De 9-jaar oude Chiyo is de dochter van een arme visser en wordt van haar familie gescheiden en verkocht aan een geisha-huis in het Gion-district van Kyoto. Hier is ze het mikpunt van de grillen van hoofd-geisha Hatsumomo, maar zij weet zich te verzetten en groeit met hulp van Hatsumomo's concurrente Mameha uit tot de beroemdste geisha van Japan.\n\nEngels\n\nIn 1929 an impoverished nine-year-old named Chiyo from a fishing village is sold to a geisha house in Kyoto's Gion district and subjected to cruel treatment from the owners and the head geisha Hatsumomo. Her stunning beauty attracts the vindictive jealousy of Hatsumomo, until she is rescued by and taken under the wing of Hatsumomo's bitter rival, Mameha. Under Mameha's mentorship, Chiyo becomes the geisha named Sayuri, trained in all the artistic and social skills a geisha must master in order to survive in her society. As a renowned geisha she enters a society of wealth, privilege, and political intrigue. As World War II looms Japan and the geisha's world are forever changed by the onslaught of history. \n\n\nWeblink http://www.imdb.com/title/tt0397535/\nWeblink http://www.moviemeter.nl/?film=27773\n\nFormaat : DVD5  ISO\nBron : Retail\nAudio : AC 3 5.1  English\nOndertitels : English Spanish Dutch Arabic Bulgarian Croatian Czech Danish Finnish Hindi Norwegian Slovenian Swedish\nMenu : Yes\nCover+Label: Yes\nStandaard:Pal\n\nBrought to you by \n2Lions Team\n\nmeer zien??\nKom dan eens kijken op ons forum \n\nEnjoy\n2Lions-Team\n\n                        \nDON T HIT AND RUN Niet gelijk afhaken als de FILM binnen is blijf seeden. \n\nDon`t quit after you finished the download, but keep seeding\n\n\nThere are fake torrents from uploaders who use our team name.\nThose are not ours, or members from our team.\nWe 2Lions-Team are not responsible for the fake posts on our name\n\nWij 2Lions-Team zijn niet verantwoordelijk voor die zieke FAKE posten die op onze naam worden gedaan\n\nPlease check our site !!!\n\nto the fakers , get a life !!!\n\n\n \n","torrent":{"xt":"urn:btih:5e878680e71cf0b67ce772e09f26a9af3eaf51b6","amp;dn":"Memoirs+of+a+Geisha+%28Multi-Subs%29%28Juultje%29%282Lions-Team%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5e878680e71cf0b67ce772e09f26a9af3eaf51b6","infoHashBuffer":{"type":"Buffer","data":[94,135,134,128,231,28,240,182,124,231,114,224,159,38,169,175,62,175,81,182]},"announce":[],"urlList":[]}}