{"title":"Instant Enlightenment (MOBI)","uid":8590718,"size":460317,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5e96e776da932134c68cb5c0abedfa2e8788a8c9&amp;dn=Instant+Enlightenment+%28MOBI%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"candymancan","files":1,"time":1371636656,"description":"Does enlightenment have a dark side? It does, explains David Deida, &quot;but instead of closing to what seems unloving, we can learn to open as what we would rather avoid.&quot; In Instant Enlightenment, this maverick author and teacher offers a &quot;rude awakening&quot; through a collection of daring exercises and practices intended to provoke, challenge, and immediately reveal the ever-present &quot;love that lives all things.&quot; What's the filthiest thing you can say that still feels like, &quot;I love you&quot;? Can you &quot;wear&quot; the mood and shape of everyone and everything around you without fear or reservation? Which imagined action--sleeping, sexing, or dying to save another--most feels like liberation and unbound love? These are just some of the unconventional questions raised in Instant Enlightenment. Each pithy chapter encourages readers to blast the light of consciousness on the taboos we hide in shadow, from our ideas about sex and money to emotions and spirituality. &quot;The secret to gifting your life's deepest purpose is to open through what you most resist, so your love's mission can bless the world,&quot; writes David Deida. Instant Enlightenment will surprise and possibly offend you--but it will lead you &quot;fast and suddenly&quot; to the realization of the sacred entirety of your experience.\n\n(Great book for insights into life)","torrent":{"xt":"urn:btih:5e96e776da932134c68cb5c0abedfa2e8788a8c9","amp;dn":"Instant+Enlightenment+%28MOBI%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5e96e776da932134c68cb5c0abedfa2e8788a8c9","infoHashBuffer":{"type":"Buffer","data":[94,150,231,118,218,147,33,52,198,140,181,192,171,237,250,46,135,136,168,201]},"announce":[],"urlList":[]}}