{"title":"Soylent Green .mp4","uid":11144830,"size":1471085038,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:5f6033494749ad9cad5a3a0b543006d887120556&amp;dn=Soylent+Green+.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"strawberry5","files":-1,"time":1412240959,"description":"A smart sci-fi with an engaging vision of the future.\n\nWith the world ravaged by the greenhouse effect and overpopulation, an NYPD detective investigates the murder of a CEO with ties to the world's main food supply.\n\nIn 2022, Earth is overpopulated and totally polluted; the natural resources have been exhausted and the nourishment of the population is provided by Soylent Industries, a company that makes a food consisting of plankton from the oceans. In New York, when Soylent's member of the board William R. Simonson is murdered apparently by a burglar at the Chelsea Towers West where he lives, efficient Detective Thorn is assigned to investigate the case with his partner Solomon &quot;Sol&quot; Roth. Thorn comes to the fancy apartment and meets Simonson's bodyguard Tab Fielding and the &quot;furniture&quot; (woman that is rented together with the flat) Shirl and the detective concludes that the executive was not victim of burglary but executed. Further, he finds that the Governor Santini and other powerful men want to disrupt and end Thorn's investigation. But Thorn continues his work and discovers a bizarre and disturbing secret of the ingredient used to manufacture Soylent Green.\n\n\nCopyright Disclaimer: Under Section 107 of the Copyright Act 1976, allowance is made for fair-use purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use, tips the balance in favour of fair use. ","torrent":{"xt":"urn:btih:5f6033494749ad9cad5a3a0b543006d887120556","amp;dn":"Soylent+Green+.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5f6033494749ad9cad5a3a0b543006d887120556","infoHashBuffer":{"type":"Buffer","data":[95,96,51,73,71,73,173,156,173,90,58,11,84,48,6,216,135,18,5,86]},"announce":[],"urlList":[]}}