{"title":"Walter Brueggemann - Commentary on Jeremiah (pdf)","uid":8582520,"size":5895550,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5fbbcd40e01ee263abaafa59160cc2f478754f8b&amp;dn=Walter+Brueggemann+-+Commentary+on+Jeremiah+%28pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pharmakate","files":-1,"time":1371441396,"description":"A Commentary on Jeremiah: Exile and Homecoming (Eerdmans, 1998). 502 pages.\n\nNew scan. Searchable pdf (clearscan) with contents in bookmarks, accurate pagination and metadata, etc.\n\n\ndescription:\n\nThis widely praised expository commentary by Walter Brueggemann - one of the premier Old Testament scholars of our time - explores the historical and social milieu of Jeremiah and offers a theological interpretation of this central book of the Old Testament. In contrast to current approaches to Jeremiah, Brueggemann uses a combination of sociological and literary analysis to provide a fresh look at the critical theological issues in the Jeremiah tradition - a look that ultimately yields compelling insights into the message and significance of Jeremiah both for this tumultuous period in the history of ancient Israel and for our own complicated times. This combined edition of Brueggemann's original two-volume work, published until recently as part of the International Theological Commentary series, will continue to be an essential resource for pastors, students, and general readers. It is reprinted here with an important new preface by Brueggemann that surveys the current state of Jeremiah studies.","torrent":{"xt":"urn:btih:5fbbcd40e01ee263abaafa59160cc2f478754f8b","amp;dn":"Walter+Brueggemann+-+Commentary+on+Jeremiah+%28pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5fbbcd40e01ee263abaafa59160cc2f478754f8b","infoHashBuffer":{"type":"Buffer","data":[95,187,205,64,224,30,226,99,171,170,250,89,22,12,194,244,120,117,79,139]},"announce":[],"urlList":[]}}