{"title":"Slurry Transport Using Centrifugal Pumps 3rd ed","uid":12625275,"size":108690495,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5fbd093c9ccb60d49255a265621185e20dacb549&amp;dn=Slurry+Transport+Using+Centrifugal+Pumps+3rd+ed&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1445766095,"description":"Slurry Transport Using Centrifugal Pumps 3rd ed - K. C. Wilson et al. (Springer, 2006).pdf\r\n\r\nISBN 9780387232621\r\n\r\n1,1 Applications of Slurry Transport Vast tonnages are pumped every year in the form of solid-liquid mixtures, known as slurries. The application which involves the largest quantities is the dredging industry, continually maintaining navigation in harbours and rivers, altering coastlines and winning material for landfill and construction purposes. As a single dredge may be required to maintain a throughput of 7000 tonnes of slurry per hour or more, very large centrifugal pumps are used. Figures 1-1 and 1-2 show, respectively, an exterior view of this type of pump, and a view of a large dredge-pump impeller (Addie &amp; Helmley, 1989). The manufacture of fertiliser is another process involving massive slur- transport operations. Li Florida, phosphate matrix is recovered by huge draglines in open-pit mining operations. It is then slurried, and pumped to the wash plants through pipelines with a typical length of about 10 kilometres. Each year some 34 million tonnes of matrix are transported in this manner. This industry employs centrifugal pumps that are generally smaller than those used in large dredges, but impeller diameters up to 1. 4 m are common, and drive capacity is often in excess of 1000 kW. The transport distance is typically longer than for dredging applications, and Chapter 1 Figure LI. Testing a dredge pump at the GIW Hydraulic Laboratory Figure 1. 2. Impeller for large dredge pump 1. Introduction 3 hence a series of pumping stations is often used. Figure 1-3 shows a boost- pump installation in a phosphate pipeline","torrent":{"xt":"urn:btih:5fbd093c9ccb60d49255a265621185e20dacb549","amp;dn":"Slurry+Transport+Using+Centrifugal+Pumps+3rd+ed","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5fbd093c9ccb60d49255a265621185e20dacb549","infoHashBuffer":{"type":"Buffer","data":[95,189,9,60,156,203,96,212,146,85,162,101,98,17,133,226,13,172,181,73]},"announce":[],"urlList":[]}}