{"title":"Jennifer Lopez - Ain't It Funny  (2nafish)","uid":5306751,"size":197433348,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:606950f0bdcd4be8708c0c7550faa68e6c477ba8&amp;dn=Jennifer+Lopez+-+Ain%5C%27t+It+Funny++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1264379027,"description":"File Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nThis video has no logos or titles.\n\n\n&quot;Ain't It Funny&quot; is a song by American singer Jennifer Lopez from her second studio album, J.Lo (2001). Written by Lopez and Cory Rooney and produced by Rooney and Dan Shea, it was released as the album's third international single in mid-2001.\n\nThe music video was filmed in sepia tone and directed by Herb Ritts. It opens with Lopez traveling on a road where she finds a fortune-teller who shows Lopez her future with the cards. A group of female gypsies (one of them played by former Pussycat Dolls member Carmit Bachar) shows up and makes over Lopez so as to make her one of their own. Then Lopez finds a man (played by Mexican soap opera actor Eduardo VerÃƒÂ¡stegui) she could not resist, falling in love with him. In the middle of the video, there is an extended dance sequence, in which she performs a flamenco-influenced routine. Eventually all the people there start dancing together, including Lopez and her lover. The video debuted the week of July 2, 2001 internationally and in the autumn of 2001 in the U.S.\n\nAlthough originally set for European and Australian release only, promotional singles of the song were sent out to U.S. radio stations in the autumn of 2001 after the success of &quot;I'm Real&quot; in the United States. Lopez even stopped by MTV's Total Request Live to premier the video and explain the concept of the song. She said she had written the song while filming The Wedding Planner. The song was originally intended for the film's soundtrack, but did not make the final cut.\n\nDue to lack of promotion and radio airplay, the single did not receive a proper U.S. commercial release and was therefore ineligible to chart on any of the Billboard charts. It nevertheless became an international hit, reaching the top five in the United Kingdom, the Netherlands, and Sweden, and the top ten in Belgium, Switzerland, Norway, Ireland, and Australia. Lopez also performed the song at the Royal Variety Performance in 2001, in front of Queen Elizabeth II.\n\n&quot;Ain't It Funny&quot; later received a hip hop-oriented remix entitled &quot;Ain't It Funny&quot; (Murder Remix), which appeared on Lopez's 2002 remix album J to tha L-O!: The Remixes; it went on to be far more successful than the original track in the United States. Unlike &quot;I'm Real&quot;, &quot;Ain't It Funny&quot;'s original version and its remix charted separately.\n\n&quot;Que Ironia&quot; (meaning &quot;What an Irony&quot;), the Spanish-language version of &quot;Ain't It Funny&quot;, was released to Spanish-speaking countries in 2001. This version is commercially available on all Latin American copies of the J.Lo album, and it is also available on some international CD singles.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:606950f0bdcd4be8708c0c7550faa68e6c477ba8","amp;dn":"Jennifer+Lopez+-+Ain%5C%27t+It+Funny++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"606950f0bdcd4be8708c0c7550faa68e6c477ba8","infoHashBuffer":{"type":"Buffer","data":[96,105,80,240,189,205,75,232,112,140,12,117,80,250,166,142,108,71,123,168]},"announce":[],"urlList":[]}}