{"title":"The Killing [Remake] 1x08 HDTV Spanish by tony","uid":6751103,"size":372967880,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:6098fdbd4c38c167fa393230b82e0cb079580fca&amp;dn=The+Killing+%5BRemake%5D+1x08+HDTV+Spanish+by+tony&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"carambolas","files":3,"time":1318878169,"description":"Si quieres mas series, peliculas, juegos, etc... tanto por descarga directa como por torrent. visitanos:\n  &lt;a href=&quot;\nhttp://www.tonytorrent.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.tonytorrent.com&lt;/a&gt;\n\n'The Killing' es el resultado de la adaptaciÃƒÂ³n que la cadena norteamericana AMC ('Mad Men', 'The Walking Dead') y la guionista Veena Cabreros Sud ('Caso abierto') han realizado de la serie danesa 'Forbrydelsen' (estrenada tambiÃƒÂ©n como 'The Killing' fuera de Escandinavia), una adaptaciÃƒÂ³n que no sÃƒÂ³lo no traiciona al original, sino que lo enriquece asumiendo riesgos propios como es el hecho de que esta nueva versiÃƒÂ³n introduzca algunas variantes sobre el caso y sea tambiÃƒÂ©n perfectamente creÃƒÂ­ble.\nPara ello, ha contado con varios colaboradores, entre ellos, el guionista danÃƒÂ©s SÃƒÂ¸ren Sveistrup, uno de los responsables de 'Forbrydelsen', presente como guionista y productor en los crÃƒÂ©ditos de varios episodios de 'The Killing', y realizadores de prestigio, como Ed Bianchi, responsable de la producciÃƒÂ³n de HBO 'Deadwood', y la cineasta polaca Agnieszka Holland, directora de numerosas pelÃƒÂ­culas y series en Estados Unidos, entre ellas 'El jardÃƒÂ­n secreto', 'Washington Square', 'El tercer milagro' y episodios de 'The Wire: Bajo escucha', 'Caso abierto' y 'Treme'.\nLas dos series parten de una premisa idÃƒÂ©ntica: una inspectora de policÃƒÂ­a, a punto de abandonar el servicio porque se traslada a otra ciudad junto a su pareja y su hijo, se ve envuelta en el que estÃƒÂ¡ llamado a ser el caso de su vida, la desapariciÃƒÂ³n de una adolescente cuyo cuerpo serÃƒÂ¡ encontrado en el maletero de un coche. El crimen trastocarÃƒÂ¡ todos sus planes ya que aplazarÃƒÂ¡ su traslado y afectarÃƒÂ¡ a su vida personal.\nA partir de aquÃƒÂ­, la versiÃƒÂ³n americana de 'The Killing' asume riesgos propios, contextos que no siempre van a ser iguales a los del original y la inclusiÃƒÂ³n de una serie de situaciones que abocan a lo que parece un final diferente. AMC y el equipo de guionistas liderado por Veena Cabreros Sud no se han limitado a cambiar Copenhague por Seattle, han querido ir mucho mÃƒÂ¡s allÃƒÂ¡, dotar a la serie de su propia personalidad y presentar una historia que estÃƒÂ¡ tan bien contada y dosifica con tal maestrÃƒÂ­a las claves del gÃƒÂ©nero de investigaciÃƒÂ³n que atrapa al espectador desde el primer minuto.","torrent":{"xt":"urn:btih:6098fdbd4c38c167fa393230b82e0cb079580fca","amp;dn":"The+Killing+%5BRemake%5D+1x08+HDTV+Spanish+by+tony","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6098fdbd4c38c167fa393230b82e0cb079580fca","infoHashBuffer":{"type":"Buffer","data":[96,152,253,189,76,56,193,103,250,57,50,48,184,46,12,176,121,88,15,202]},"announce":[],"urlList":[]}}