{"title":"Fujifilm Finepix s6500fd software cd.iso","uid":4067202,"size":488071168,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:60e2e72413febd17a6f2ece5bddff3e41b02cddb&amp;dn=Fujifilm+Finepix+s6500fd+software+cd.iso&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"unusingur","files":1,"time":1204855574,"description":"Hello and Welcome :)\n\nThis is the complete software suite that arrived with my Finepix s6500fd camera from Fujifilm. I saw some people on forums asking for this cd, and Fujifilm doesn&amp;#039;t offer the programs on it for download. Well, here it is, so if you craved for it then you can simply thank me by spreading the word and seeding, since this piece of software, even if it might not be known by many, might be wanted badly by those few in a loong time from now on. I will seed as long as i can, but i can&amp;#039;t promise forever.\n\nThe disc image contains the Finepix Viewer (wich is not more than an ordinary picture viewer, just like picasa, for example), Finepix Studio for working with raf files (Fuji&amp;#039;s raw), and Imagemixer LE, wich is not that interesting (you can make better picture cds with free programs). Aside from the original disc i also included the romanian camera manual in pdf format (it came in the box), wich can be found in the Manual folder on the root of the disc.\n\n&gt;&gt;&gt; If the disc fails the autostart just explore it and double-click the setup.exe icon.\n\nSafety note: all the files in this image are created from the original disk (using UltraIso) and i doubt this readme file can contain a virus. It is not my intention to spread viruses, mallware and similar kind of threats. However, it is strongly reccomended to take all precautions during first time use to asure that nothing bad happens to your computer. That means, ofcourse, having your antivirus turned on while downloading and scaning the file after downloading. To make sure there is no such risk i choosed not to include a virtual drive emulator (therefore no keygens are needed), finding one is your own job. I am not responsible of anything bad that might result from improper use of this image file and it&amp;#039;s content.","torrent":{"xt":"urn:btih:60e2e72413febd17a6f2ece5bddff3e41b02cddb","amp;dn":"Fujifilm+Finepix+s6500fd+software+cd.iso","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"60e2e72413febd17a6f2ece5bddff3e41b02cddb","infoHashBuffer":{"type":"Buffer","data":[96,226,231,36,19,254,189,23,166,242,236,229,189,223,243,228,27,2,205,219]},"announce":[],"urlList":[]}}