{"title":"KeePass Password Safe 1.15 Portable","uid":4723576,"size":1146176,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:61da4be7265238bbdd4b09d97af42acb4419709e&amp;dn=KeePass+Password+Safe+1.15+Portable&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"olofolleola4","files":-1,"time":1234634912,"description":"Copied from KeePass Password Safe Homepage:\n\n\nKeePass, the free, open source, light-weight and easy-to-use password manager.\n\n\nWhat is KeePass?\n\nToday you need to remember many passwords.\nYou need a password for the Windows network logon, your e-mail account, your homepage's FTP password, online passwords (like website member account), etc. etc. etc. The list is endless. Also, you should use different passwords for each account. Because if you use only one password everywhere and someone gets this password you have a problem... A serious problem.\nThe thief would have access to your e-mail account, homepage, etc.\nUnimaginable.\n\nKeePass is a free open source password manager, which helps you to manage your passwords in a secure way. You can put all your passwords in one database, which is locked with one master key or a key file.\nSo you only have to remember one single master password or select the key file to unlock the whole database. The databases are encrypted using the best and most secure encryption algorithms currently known (AES and Twofish).\n\n\nFeatures:\n\n\n\nStrong Security\n\n\n* KeePass supports the Advanced Encryption Standard (AES, Rijndael) and the Twofish algorithms to encrypt its password databases.\n\n* Both of these ciphers are regarded as very secure by the cryptography community. Banks are using these algorithms for example, too.\n\n* Even if you would use all computers in the world to attack one database, decrypting it would take longer than the age of the universe.\n\n* Even quantum computers won't help that much.\nThe algorithms are symmetric so its complexity would be reduced a bit, anyway, the sun will go nova before you have decrypted the database.\n\n* The complete database is encrypted, not only the password fields.\nSo your usernames, notes, etc. are protected, too.\n\n* SHA-256 is used as password hash. SHA-256 is a 256-bit cryptographically secure one-way hash function. Your master password is hashed using this algorithm and its output is used as key for the encryption algorithms.\n\n* In contrast to many other hashing algorithms, no attacks are known yet against SHA-256.\n\n* Protection against dictionary and guessing attacks: by transforming the final master key very often, dictionary and guessing attacks can be made harder.\n\n* In-Memory Passwords Protection:\nYour passwords are encrypted while KeePass is running, so even when the operating system caches the KeePass process to disk, this wouldn't reveal your passwords anyway.\n\n* Security-Enhanced Password Edit Controls:\nKeePass is the first password manager that features security-enhanced password edit controls. None of the available password edit control spies work against these controls. The passwords entered in those controls aren't even visible in the process memory of KeePass.\n\n\n\nMultiple User Keys\n\n\n* One master password decrypts the complete database.\n\n* Alternatively you can use key files.\nKey files provide better security than master passwords in most cases.\nYou only have to carry the key file with you, for example on a floppy disk, USB stick, or you can burn it onto a CD.\nOf course, you shouldn't lose this disk then.\n\n* For even more security you can combine the above two methods: the database then requires the key file and the password in order to be unlocked.\nEven if you lose your key file, the database would remain secure.\n\n\nFeatures Portable and No Installation Required, Accessibility\n\n\n* KeePass is portable: it can be carried on an USB stick and runs on Windows systems without being installed.\n\n* KeePass doesn't store anything on your system.\nThe program doesn't create any new registry keys and it doesn't create any initialization files (INI) in your Windows directory.\nDeleting the KeePass directory (in case you downloaded the binary ZIP package) or using the uninstaller (in case you downloaded the installer package) leaves no trace of KeePass on your system.\n\n* KeePass runs, without downloading any additional libraries, on Windows 98, 98SE, ME, NT, 2000, XP (Home &amp; Pro, 32-bit &amp; 64-bit), 2003 and Vista.\nNo .NET framework is required.\n\n* Ports for other systems like Linux, Mac OS X, PocketPC, Smartphone, etc. are available!\n\n\nExport Export To TXT, HTML, XML and CSV Files\n\n\n* The password list can be exported to various formats like TXT, HTML, XML and CSV.\n\n* The XML output can be easily used in other applications.\n\n* The HTML output uses cascading style sheets (CSS) to format the table, so you can easily change the layout.\n\n* The CSV output is fully compatible with most other password safes like the commercial closed-source Password Keeper and the closed-source Password Agent, also the CSVs can be imported by spreadsheet applications like Microsofts Excel or OpenOffice's Calc.\n\n* Many other file formats are supported through KeePass plugins.\n\n\nImport Import From Many File Formats\n\n\n* KeePass uses the common CSV export format of various passwords safes like Password Keeper and Password Agent. Exports from these programs can be easily imported to your KeePass databases.\n\n* KeePass can parse and import TXT outputs of CodeWalletPro, a commercial closed-source password safe.\n\n* KeePass can import TXT files created by Bruce Schneier's Password Safe v2.\n\n* Many other file formats are supported through KeePass plugins.\n\n\nMessage Easy Database Transfer\n\n\n* A password database consists of only one file that can be transferred from one computer to another easily.\n\n\nMultiple Support of Password Groups\n\n\n* You can create, modify and delete groups, in which passwords can be sorted into.\n\n* The groups can be arranged as a tree, so a group can have subgroups, those subgroups can have subgroups themselves, etc.\n\n\nFeatures Time Fields and Entry Attachments\n\n\n* KeePass supports time fields: creation time, last modification time, last access time and expiration time.\n\n* You can attach files to password entries\n(useful to store PGP signature files in KeePass for example).\n\n\nKeyboard Auto-Type, Global Auto-Type Hot Key and Drag&amp;Drop\n\n\n* KeePass can minimize itself and type the information of the currently selected entry into dialogs, webforms, etc.\nOf course, the typing-sequence is 100% user-customizable, read the documentation file for more.\n\n* KeePass features a global auto-type hot key.\nWhen KeePass is running in the background (with opened database) and you press the hot key, it looks up the correct entry and executes its auto-type sequence.\n\n* All fields, title, username, password, URL and notes can be drag&amp;dropped into other windows.\n\n\nBinary Intuitive and Secure Windows Clipboard Handling\n\n\n* Just double-click on any field of the password list to copy its value to the Windows clipboard.\n\n* Timed clipboard clearing: KeePass can clear the clipboard automatically some time after you've copied one of your passwords into it.\n\n* Protection against clipboard monitors (other applications won't get notifications that the clipboard content has been changed).\n\n* Paste-once functionality: allow only one paste operation, after pasting the clipboard is cleared automatically by KeePass.\n\n\nMagnifier Searching and Sorting\n\n\n* You can search for specific entries in the databases.\n\n* To sort a password group, just click on one of the column headers in the password list, you can sort by any column.\n\n\nTranslation Multi-Language Support\n\n\n* KeePass can be translated into other languages very easily.\n\n* Over 30 different languages are available!\n\n\nKey Strong Random Password Generator\n\n\n* KeePass can generate strong random passwords for you.\n\n* You can define the possible output characters of the generator (number of characters and type).\n* Random seeding through user input: mouse movement and random keyboard input.\n\n\nFeatures Plugin Architecture\n\n\n* Other people can write plugins for KeePass.\n\n* Plugins can extend the functionality of KeePass, like providing additional import/export methods for other file formats.\n\n* Go to the plugins page for more information and plugin downloads.\n\n\nFeatures Open Source!\n\n\n* KeePass free and you have full access to its source code!\n\n* Open Source prevents backdoors.\nYou can have a look at its source code and compile it yourself.\n\n* You can yourself check if the security is implemented correctly, you can, if you want, use any other encryption algorithm.\n\n* Opening the sources also encourages other people to port the application to other systems (PocketPC version already in development) or write translations.\n\n* KeePass is OSI Certified Open Source Software.\nOSI Certified is a certification mark of the Open Source Initiative.\n\n\nIs it really free?\n\nYes, KeePass is really free, and more than that: it is open source (OSI certified). You can have a look at its full source and check whether the encryption algorithms are implemented correctly.\n\n\nChanges from 1.14 to 1.15:\n\n\nNew Features:\n\n\n* Completely new plugin architecture (exposing a lot more functionality to plugins, faster, requires less memory, safer memory management / cross-module calls, more secure, and allows independent development of KeePass and plugins, i.e. starting with 1.15 KeePass can be updated without requiring plugins to be updated and vice versa).\n\n* Added option to use advanced in-memory protection (DPAPI, only Windows Vista and higher; the key is stored in a secure, non-swappable memory area managed by Windows; option enabled by default).\n\n* The hash of the master key and its transformed version are now in-memory protected.\n\n* Added help source selection dialog (by default the online help center is used).\n\n* Added '-set-urloverride', '-clear-urloverride' and '-get-urloverride' command line options.\n\n* Focused disabled menu items are now drawn with a transparent selection rectangle.\n\n* Windows XP and higher: added support for double-buffering in the entry list.\n\n* Windows Vista and higher: added support for alpha-blended marquee selection in the entry list.\n\n* Added KeeForceAllowChangeMasterKey, KeeForceAllowPrinting, KeeForceAllowImport and KeeForceAllowExport configuration options (these override the option to disable unsafe operations and the mini mode setting; they are only loaded from the enforced and global INI files, not the local one).\n\n* Added KeeDisallowPrintingPasswords configuration option to disallow printing passwords and viewing them in the print preview.\n\n* Added multi-user documentation.\n\n\nImprovements:\n\n\n* Improved plugin loading performance.\n\n* Plugins don't need to be manually enabled anymore (just copy the plugin files into the KeePass application directory).\n\n* Improved main menu items order.\n\n* Improved main menu accelerators.\n\n* Improved group main menu item texts.\n\n* Improved performance of various entry list operations.\n\n* Hash of master key is now cleared when closing a database.\n\n* Hash of file key is now cleared after opening/saving files.\n\n* Various code optimizations.\n\n* Minor other improvements.\n\n\nBugfixes:\n\n\n* Fixed cursor navigation problem in secure edit controls.\n\n* Fixed random access violation in OnScreenKeyboard plugin.\n\n\nComments from the uploader (olofolleola4):\nThe plugin page is here:  &lt;a href=&quot;\nhttp://keepass.info/plugins.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://keepass.info/plugins.html&lt;/a&gt;","torrent":{"xt":"urn:btih:61da4be7265238bbdd4b09d97af42acb4419709e","amp;dn":"KeePass+Password+Safe+1.15+Portable","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"61da4be7265238bbdd4b09d97af42acb4419709e","infoHashBuffer":{"type":"Buffer","data":[97,218,75,231,38,82,56,187,221,75,9,217,122,244,42,203,68,25,112,158]},"announce":[],"urlList":[]}}