{"title":"Ultimate leglocks of Russian sambo by Igor Yakimov","uid":10595709,"size":5094308641,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:61e3913d27f570b0663ed25ae3e7791df8ce2805&amp;dn=Ultimate+leglocks+of+Russian+sambo+by+Igor+Yakimov&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":"T1T","files":445,"time":1405816484,"description":"\n\nAll new on DVD! Russian Sambo leg locks are the most devastating you will find anywhere! Igor Yakimov's Ultimate Leg Locks of Russian Sambo video series is considered to be the greatest work on leg locks ever produced. This tape set stars Igor Yakimov, widely considered to be the best leglock specialist in Russia! Let Igor show you leglocks like you have never seen before including ankle locks, knee bars, knee knots, calf crushes and brutal hip twist that will devastate your opponents. You will see how to apply Russian Sambo leglocks from virtually every position possible with many of these never seen before outside of Russia! Many of these leg locks are so advanced, they utilize multiple locks at the same time, crushing, twisting and breaking the legs in multiple areas all in the same technique. You will even learn Russian Sambo leglocks and armbars that can be done together at the same time! We guarantee that this video series will blow you away with techniques that can be used in the street or for sport. Over 250 techniques in all!\n\n\nVOLUME 1: Takedowns into Leglocks\nThese videos will teach you one of the most common places for Russian Sambo champions to secure a leg lock, from the standing position. Igor will show all the tricks and secrets that has allowed him to become a three-time champion as he details throws, sweeps and other takedowns that lead to leglocks. These two videos cover every technique, from the most basic to the most advanced he has ever used like fake throws and counters to throws that will give you a leg submission. As a military specialist of the Soviet Union, Igor Yakimov will also teach you how to apply leg locks on kicking and striking opponents. See devastating combinations like armbars and leglocks together!\n\nVOLUME 2: Takedowns into Leglocks\nThese videos will teach you one of the most common places for Russian Sambo champions to secure a leg lock, from the standing position. Igor will show all the tricks and secrets that has allowed him to become a three-time champion as he details throws, sweeps and other takedowns that lead to leglocks. These two videos cover every technique, from the most basic to the most advanced he has ever used like fake throws and counters to throws that will give you a leg submission. As a military specialist of the Soviet Union, Igor Yakimov will also teach you how to apply leg locks on kicking and striking opponents. See devastating combinations like armbars and leglocks together!\n\nVOLUME 3: Leglocks Inside the Guard\nA Russian Sambo fighter can be very dangerous inside his opponent's guard. Let Igor show you how to really mess someone up that places you in this position! Learn single, double, and triple locks for sport or the street! See how to work against the guard by attacking the legs with ankle, knee and hip locks. Learn how to apply leg and arm combos! A must have DVD!\n\nVOLUME 4: Leglocks from the Guard\nOn his back, Igor is devastating! Russian Sambo fighters must not only be offensive in this position, but also be able to defend and protect their legs when they have an opponent in their guard. This is a serious look at how to defend and how to attack. Learn how to turn an attack on your own legs around into a leglock on your opponent! Learn sweeps and turnovers that lead to leglocks. Also more nasty arm and leg combos that you will not see on other bogus DVD sets.\n\nVOLUME 5: Leglocks Across the Side\nThis is an awesome tape! Yes, leg locks can be done from the cross body and there are a lot of them! You will not see this material elsewhere. Learn Russian Sambo leg lock combos like leg and neck cranks and more arm and leg combos. Learn how to fake and control to make your opponent set himself up for a painful experience. This DVD just has to be seen to believe!\n\nVOLUME 6: Leglocks from the Mount &amp; Back\nRussian Sambo leglocks from the mount and the back positions! First, Igor shows one of his favorite attacks in leg locks, hurting Judo players that sit in the turtle position! Learn multiple ways to break legs that will make people that hide in this position think again. Then, learn how to defend your back if an opponent should get it by reversing him into a leg lock! Next, Igor takes you to the mounted position were he will teach you some of the most nasty leg and arm bar combinations you will ever see. These techniques are some of the very same ones that Igor has used in international competitions with great success.. Last but not least, Igor shows some of the most advanced techniques in Russian Sambo by showing you how to escape from an arm bar into a leg lock. You won't want to miss this DVD.","torrent":{"xt":"urn:btih:61e3913d27f570b0663ed25ae3e7791df8ce2805","amp;dn":"Ultimate+leglocks+of+Russian+sambo+by+Igor+Yakimov","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"61e3913d27f570b0663ed25ae3e7791df8ce2805","infoHashBuffer":{"type":"Buffer","data":[97,227,145,61,39,245,112,176,102,62,210,90,227,231,121,29,248,206,40,5]},"announce":[],"urlList":[]}}