{"title":"The Great Altruist - Z.D. Robinson","uid":6384252,"size":1444262,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:623790abb189246e705d6d7ee93cb87ac30e76fe&amp;dn=The+Great+Altruist+-+Z.D.+Robinson&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mcbipolar","files":4,"time":1305142035,"description":"Title: The Great Altruist\n\nAuthor: Z. D. Robinson\n\nFormats Included: EPUB, MOBI, PRC\n\nDescription:\n\nGenesis is a confident and brash time-traveler, sure of her abilities, and ready to use them on behalf on anyone in need of fixing a past mistake. But when she tries to help a young Holocaust survivor prevent World War II, she is forced to recognize that her powers are not without a price.\n\nDefeated and filled with regret, James Grant suddenly enters her life. Depressed over a lost love, James is taken back in time on a journey to save his parent's marriage while learning that living in the past will destroy his future.\n\nStill filled with remorse, Genesis tries to leave James - the man she now loves - and live a life of solitude when she learns of her true origin and loses all of her powers...and just when humanity will need them the most!\n\nHalfway around the world, an organization bent on destroying civilization and starting anew is gathering its final members for a mission into Earth's future to gather weapons of mass destruction. When James is dragged into their scheme, he is forced to choose between saving Genesis, his new bride, and the rest of the world. What follows is an adventure filled with backstabbing parents, ruthless secret societies, and a battle across time and space between Genesis reborn and the organization's most twisted agent.","torrent":{"xt":"urn:btih:623790abb189246e705d6d7ee93cb87ac30e76fe","amp;dn":"The+Great+Altruist+-+Z.D.+Robinson","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"623790abb189246e705d6d7ee93cb87ac30e76fe","infoHashBuffer":{"type":"Buffer","data":[98,55,144,171,177,137,36,110,112,93,109,126,233,60,184,122,195,14,118,254]},"announce":[],"urlList":[]}}