{"title":"The Picture of Dorian Gray - Oscar Wilde (Unabridged)","uid":6121855,"size":250707983,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:6370f7f967aa28584d873c51d7ef873648d5cfa8&amp;dn=The+Picture+of+Dorian+Gray+-+Oscar+Wilde+%28Unabridged%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"rosie1966","files":3,"time":1295742029,"description":"A lush, cautionary tale of a life of vileness and deception or a loving portrait of the aesthetic impulse run rampant? Why not both? After Basil Hallward paints a beautiful, young man's portrait, his subject's frivolous wish that the picture change and he remain the same comes true. Dorian Gray's picture grows aged and corrupt while he continues to appear fresh and innocent. After he kills a young woman, &quot;as surely as if I had cut her little throat with a knife&quot;, Dorian Gray is surprised to find no difference in his vision or surroundings. &quot;The roses are not less lovely for all that. The birds sing just as happily in my garden.&quot;\n\nAs Hallward tries to make sense of his creation, his epigram-happy friend Lord Henry Wotton encourages Dorian in his sensual quest with any number of Wildean paradoxes, including the delightful &quot;When we are happy we are always good, but when we are good we are not always happy.&quot; But despite its many languorous pleasures, The Picture of Dorian Gray is an imperfect work. Compared to the two (voyeuristic) older men, Dorian is a bore, and his search for ever new sensations far less fun than the novel's drawing-room discussions. Even more oddly, the moral message of the novel contradicts many of Wilde's supposed aims, not least &quot;no artist has ethical sympathies. An ethical sympathy in an artist is an unpardonable mannerism of style.&quot; Nonetheless, the glamour boy gets his just deserts. And Wilde, defending Dorian Gray, had it both ways: &quot;All excess, as well as all renunciation, brings its own punishment.&quot; \n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:6370f7f967aa28584d873c51d7ef873648d5cfa8","amp;dn":"The+Picture+of+Dorian+Gray+-+Oscar+Wilde+%28Unabridged%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6370f7f967aa28584d873c51d7ef873648d5cfa8","infoHashBuffer":{"type":"Buffer","data":[99,112,247,249,103,170,40,88,77,135,60,81,215,239,135,54,72,213,207,168]},"announce":[],"urlList":[]}}