{"title":"The State of the Art in Intrusion...  (2014) Al-Sakib Khan Patha","uid":9549182,"size":56832454,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6493be867ea405306f27db51c320613b1df9fc5a&amp;dn=The+State+of+the+Art+in+Intrusion...++%282014%29+Al-Sakib+Khan+Patha&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"7","files":-1,"time":1391203170,"description":"The State of the Art in Intrusion Prevention and Detection (2014) Al-Sakib Khan Pathan (pdf)\n\n\nThe State of the Art in Intrusion Prevention and Detection by Al-Sakib Khan Pathan\n\n\nFormat: pdf\nLength: 492 pages\nGenre: Non-Fiction/Computers &amp; Technology/Security\nDate: 25 January 2014\n\nThe State of the Art in Intrusion Prevention and Detection analyzes the latest trends and issues surrounding intrusion detection systems in computer networks, especially in communications networks. Its broad scope of coverage includes wired, wireless, and mobile networks; next-generation converged networks; and intrusion in social networks.\n\nPresenting cutting-edge research, the book presents novel schemes for intrusion detection and prevention. It discusses tracing back mobile attackers, secure routing with intrusion prevention, anomaly detection, and AI-based techniques. It also includes information on physical intrusion in wired and wireless networks and agent-based intrusion surveillance, detection, and prevention. The book contains 19 chapters written by experts from 12 different countries that provide a truly global perspective.\n\nAuthor:\n\nAl-Sakib Khan Pathan received a PhD degree in computer engineering in 2009 from Kyung Hee University, South Korea. He received a BSc degree in computer science and information technology from Islamic University of Technology (IUT), Bangladesh, in 2003. He is currently an assistant professor in the computer science department at International Islamic University Malaysia (IIUM), Malaysia.\n","torrent":{"xt":"urn:btih:6493be867ea405306f27db51c320613b1df9fc5a","amp;dn":"The+State+of+the+Art+in+Intrusion...++%282014%29+Al-Sakib+Khan+Patha","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6493be867ea405306f27db51c320613b1df9fc5a","infoHashBuffer":{"type":"Buffer","data":[100,147,190,134,126,164,5,48,111,39,219,81,195,32,97,59,29,249,252,90]},"announce":[],"urlList":[]}}