{"title":"Sunshine cleaning [BRSCREENER][Xvid][Spanish]","uid":5711737,"size":1217759232,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:6539f2831836538ea62964823f250d2cf42148c7&amp;dn=Sunshine+cleaning+%5BBRSCREENER%5D%5BXvid%5D%5BSpanish%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Morck22","files":2,"time":1279924631,"description":"Estreno en cines el viernes 23 de julio de 2010\n(672 visitas)\nSunshine Cleaning (2009)\n[Sunshine Cleaning en imdb]\nChristine Jeffs\ncolor /\n\n91 minutos\n(1h y 31m) / 2.35:1 / Comedia, Crimen\nEE. UU. [Pelicula sin calificar]\nAmy Adams, Emily Blunt, Alan Arkin, Jason Spevack, Steve Zahn, Mary Lynn Rajskub, Clifton Collins Jr., Eric Christian Olsen, Paul Dooley, Kevin Chapman, Judith Jones, Amy Redford, Christopher Dempsey, Vic Browder, Ivan Brutsche\nRose Lorkowski (Amy Adams) es una madre soltera que intenta mantener a su hijo Oscar (Jason Spevack) y a su no muy fiable hermana Norah (Emily Blunt), con un aburrido trabajo como criada. Aunque durante anos fue lider de las animadoras de la escuela y parecia tener un futuro prometedor, ahora Rose tiene poco de lo que presumir. Todavia ve a la antigua promesa del futbol (Steve Zahn), pero lo que tienen es poco mas que un desalentador affair. Cuando expulsan a Oscar de la escuela publica, Rose consigue un trabajo como limpiadora de escenas de crimen con riesgo biologico, todo para ayudar a pagar la escuela privada del nino. Traera consigo a Norah para ayudarla con este creciente negocio. A medida que las hermanas trabajan en limpiar los lios dejados por las vidas caoticas de otros, deberan aprender a reconciliar sus propias diferencias y a vencer un pasado problematico si esperan prosperar en su recien iniciada aventura empresarial.\n\nProducida por Back Lot Pictures, Big Beach Films, Clean Sweep Productions. Distribuida en Espana por Baditri.\n\nTiempo de espera desde el estreno oficial hasta que ha llegado a Espana: 16.1 meses.","torrent":{"xt":"urn:btih:6539f2831836538ea62964823f250d2cf42148c7","amp;dn":"Sunshine+cleaning+%5BBRSCREENER%5D%5BXvid%5D%5BSpanish%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6539f2831836538ea62964823f250d2cf42148c7","infoHashBuffer":{"type":"Buffer","data":[101,57,242,131,24,54,83,142,166,41,100,130,63,37,13,44,244,33,72,199]},"announce":[],"urlList":[]}}