{"title":"Hard Disk Sentinel 3.10 build 3755 Portable","uid":5523836,"size":20881872,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:6645793e408905c6a4e2b94c04bcb7e919fe8968&amp;dn=Hard+Disk+Sentinel+3.10+build+3755+Portable&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"NoExcuses","files":4,"time":1272715051,"description":"Hard Disk Sentinel Pro v3.10 build 3755 made Portable.\n\nNo need to install it!\nOr, if you want to, Setup and Crack are included...\n\n\nHard Disk Sentinel Professional (HDSentinel) is a HDD/SSD monitoring and analysis application. Its goal is to find, test, diagnose and repair disk drive problems, report and display SSD and HDD health, performance degradations and failures. Hard Disk Sentinel gives complete textual description, tips and displays/reports the most comprehensive information about the hard disks and solid state disks inside the computer or in external enclosures (USB / e-SATA). Many different alerts and report options are available to ensure maximum safety of your valuable data.\n\nThe software monitors hard disk drive / HDD status, including health, temperature and all S.M.A.R.T. (Self-Monitoring, Analysis and Reporting Technology, built in most hard disks and solid state disks today) values for each disks. Also it measures the disk transfer speed in real time which can be used as a benchmark or to detect possible hard disk failures, performance degradations.\n\n\nMore infos at\n &lt;a href=&quot;\nhttp://www.hdsentinel.com/hard_disk_sentinel_professional.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.hdsentinel.com/hard_disk_sentinel_professional.php&lt;/a&gt;\n\n\n\nThe Portable SFX EXE file is built up using WinRAR. You can use it to extract the files and check them one by one if you want to be sure of what is running on your machine.\n\n\nThis has also been built on an XP x86 machine, I don't know if this program can run on a x64 or Vista machine. I't's up to you to check it if you are using them.\n\n\n\nSUGGESTIONS ON USING P2P DOWNLOADS\n==================================\n\n1) It's always better to run all downloaded programs using Sandboxie or a similar virtual machine until you are sure they are clean.\n\n\n2) When in doubt, scan them with an Internet Scan service as the ones provided by Jotti and VirusTotal\n &lt;a href=&quot;\nhttp://virusscan.jotti.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://virusscan.jotti.org/&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.virustotal.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.virustotal.com/&lt;/a&gt;\n\nThis will ***NOT*** give you any warranty that a file passing their analysis is clean, nor that if they see them as a troian it's so or not just another false positive, but helps you to decide and at least ask for help or infos.\n\n\n3) Remember, trust nobody, and when in doubt, go to point 1) \n\n\n4) If you find any upload containing trojans or whatsoever malicious or unclean, instead of start cursing in the comments of the upload, take the time to go to the Suprbay Forum at:\n &lt;a href=&quot;\nhttp://forum.suprbay.org/forumdisplay.php?fid=29&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.suprbay.org/forumdisplay.php?fid=29&lt;/a&gt;\n\nand report links and comments there, and someone will take care of all the nasties.\n\n\nThat's the only way to keep TPB and its uploads fresh and clean.\n\n\nThat's for what is regarding security. If after testing it you like it and it's useful for you, show your support buying it!\n\n\n\nEnjoy and remember to seed... :o)\n\n\n","torrent":{"xt":"urn:btih:6645793e408905c6a4e2b94c04bcb7e919fe8968","amp;dn":"Hard+Disk+Sentinel+3.10+build+3755+Portable","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6645793e408905c6a4e2b94c04bcb7e919fe8968","infoHashBuffer":{"type":"Buffer","data":[102,69,121,62,64,137,5,198,164,226,185,76,4,188,183,233,25,254,137,104]},"announce":[],"urlList":[]}}