{"title":"The Ultimate Guide To The Dark Knight","uid":7849342,"size":43936928,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:67b1ba527975053a354f8b361e93d8f63395a224&amp;dn=The+Ultimate+Guide+To+The+Dark+Knight&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SplhcbPrime","files":-1,"time":1353559862,"description":"Orphan Bruce Wayne swore to strike fear into the hearts of the criminals ruling the streets of Gotham City -- and the mysterious legend of Batman was born. This definitive celebration of one of the most popular fictional heroes contains full details of the extraordinary events, and the bizarre and sinister characters in the thrilling career of Batman.\n\nCreated by Bob Kane in the late 1930s, Batman is on the of the greatest fictional heroes. The Caped Crusader, The Dark Knight, The Guardian of Gotham... each generation has coined its own favorite nickname to describe this ultimate crime fighter as he wages war on a gallery of evil-doing villains. \n\nFor Batman:  The Ultimate Guide To The Dark Knight, DK Publishing has been permitted unparalleled access to the archives of DC Comics, shapers of the Batman legend. Spectacular artworks reveal the secret workings of key installations and equipment such as:  the Batcave; the Batmobile; the suit Of Batman; and the weaponry contained in his utility belt. Panoramic views of Gotham City and Arkham Asylum allow readers to enter into the world of Batman. Crucial events and characters of the Batman legend are illustrated with drawings from the original DC comic books. The result is a unique, in-depth approach to the thrilling story of Batman's crime fighting career which is sure to dazzle and delight fans of all ages.\n\nThis guide pulls apart and pokes at the many of the gadgets and backdrops found in the dark world of the Dark Knight. Exploded diagrams reveal the innards of the new and old Batcaves, and stat-packed tags and captions spell out everything from how the Bat-Signal works to where Catwoman stashes her bullwhip. Batman scholar Scott Beatty has compiled hundreds of excellent panels and covers from the original comic, and he displays commanding knowledge cataloging Gotham's most colorful characters in big, splashy spreads.\n\nIf you are already well versed in Bat-trivia, you probably will not find The Ultimate Guide To The Dark Knight anywhere near ultimate enough. But as a broad history of Batman, his friends, allies, foes, high-tech hardware and hideouts, this oversized, illustration-filled Dark Knight guide just can't be beat. \n\nNOTE:  These are not my scans.  All praise and glory to the original scanners (and authors/artists/publishers,) please.\n\nEnjoy, and please seed.\n","torrent":{"xt":"urn:btih:67b1ba527975053a354f8b361e93d8f63395a224","amp;dn":"The+Ultimate+Guide+To+The+Dark+Knight","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"67b1ba527975053a354f8b361e93d8f63395a224","infoHashBuffer":{"type":"Buffer","data":[103,177,186,82,121,117,5,58,53,79,139,54,30,147,216,246,51,149,162,36]},"announce":[],"urlList":[]}}