{"title":"Andrea Barret - The Voyage of the Narwhal","uid":8848505,"size":560003383,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:67ca569b1e8f8c9f533d88b13536527d47fda261&amp;dn=Andrea+Barret+-+The+Voyage+of+the+Narwhal&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"whnstn","files":-1,"time":1377461653,"description":"Having honed her craft in four previous novels and the NBA-winning short-story collection Ship Fever (1996), Barrett delivers a stunning novel in which a meticulous grasp of historical and natural detail, insight into character and pulse-pounding action are integrated into a dramatic adventure story with deep moral resonance. In Philadelphia in 1855, naturalist Erasmus Darwin Wells?40, unmarried and gripped by a despondent realization that his life is a failure?sees a last chance to make his reputation as he prepares to accompany his future brother-in-law, Zechariah Voorhees, on a voyage to the arctic in search of Sir John Franklin's lost expedition. At 26, Zeke bristles with charisma, and a megalomaniacal sense of his own destiny. But loyal, naive Erasmus doesn't grasp the scope of Zeke's recklessness and blind ambition until Zeke has committed a series of colossal and fatal blunders, subjecting his men to unspeakable privation, hunger, cold and danger. When the crew finally refuses to accompany Zeke on a foolhardy mission and he goes off alone and does not return on schedule, Erasmus is placed in an exquisite dilemma: whether to force the men to gamble on Zeke's unlikely survival as the ice closes in for a second winter, or?as he knows he must do?abandon the ship and begin a harrowing trek over land and water in hope of rescue. Erasmus's eventual return home, where he is scorned by journalists, who accuse him of cowardice, and by his sister, Lavinia, who is bereft of her hopes of marriage, is underscored by further ironies so potent that readers will finish the last third of the book in a fever of anticipation and dread. As Barrett describes the provisioning of the Narwhal, the flora and fauna of the arctic, the turbulent seas and breathtaking scenery, the plot seems slow to develop. But her careful depiction of all the characters?a humane ship's doctor; a cook who survived the Irish famine; and, back in Philadelphia, spirited Alexandra Copeland, whose presence in the Wells household as companion to Lavinia eventually leads to an affecting love story?deepens the narrative texture. Meanwhile, the extremes of both human behavior and nature?looming icebergs, fatal accidents, episodes of heroism, grisly discoveries of lost ships and dead men, the inexorable tyranny of winter darkness?are described with an accuracy that make one forget that this is not a memoir but a work of the imagination. The denouement, when it arrives, is a triumph: a confluence of justice, retribution, spiritual faith, metamorphosis and love.","torrent":{"xt":"urn:btih:67ca569b1e8f8c9f533d88b13536527d47fda261","amp;dn":"Andrea+Barret+-+The+Voyage+of+the+Narwhal","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"67ca569b1e8f8c9f533d88b13536527d47fda261","infoHashBuffer":{"type":"Buffer","data":[103,202,86,155,30,143,140,159,83,61,136,177,53,54,82,125,71,253,162,97]},"announce":[],"urlList":[]}}