{"title":"Amadeus","uid":4631168,"size":1958343262,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:67e3c2a86944471e9718a30b330537838f099220&amp;dn=Amadeus&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"johnny312","files":-1,"time":1231393887,"description":"The satirical sensibilities of writer Peter Shaffer and director Milos Forman (One Flew over the Cuckoo's Nest) were ideally matched in this Oscar-winning movie adaptation of Shaffer's hit play about the rivalry between two composers in the court of Austrian Emperor Joseph II--official royal composer Antonio Salieri (F. Murray Abraham), and the younger but superior prodigy Wolfgang Amadeus Mozart (Tom Hulce). The conceit is absolutely delicious: Salieri secretly loathes Mozart's crude and bratty personality, but is astounded by the beauty of his music. That's the heart of Salieri's torment--although he's in a unique position to recognize and cultivate both Mozart's talent and career, he's also consumed with envy and insecurity in the face of such genius. That such magnificent music should come from such a vulgar little creature strikes Salieri as one of God's cruelest jokes, and it drives him insane. Amadeus creates peculiar and delightful contrasts between the impeccably re-created details of its lavish period setting and the jarring (but humorously refreshing and unstuffy) modern tone of its dialogue and performances--all of which serve to remind us that these were people before they became enshrined in historical and artistic legend. Jeffrey Jones, best-known as Ferris Bueller's principal, is particularly wonderful as the bumbling emperor (with the voice of a modern midlevel businessman). The film's eight Oscars include statuettes for Best Director Forman, Best Actor Abraham (Hulce was also nominated), Best Screenplay, and Best Picture.\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0086879/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0086879/&lt;/a&gt;\n","torrent":{"xt":"urn:btih:67e3c2a86944471e9718a30b330537838f099220","amp;dn":"Amadeus","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"67e3c2a86944471e9718a30b330537838f099220","infoHashBuffer":{"type":"Buffer","data":[103,227,194,168,105,68,71,30,151,24,163,11,51,5,55,131,143,9,146,32]},"announce":[],"urlList":[]}}