{"title":"We Want to Live - The Primal Diet (2005 Expanded Edition)","uid":14047101,"size":2091052,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6a395bc1d64550170101cdd9391076756bea61b8&amp;dn=We+Want+to+Live+-+The+Primal+Diet+%282005+Expanded+Edition%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":1,"time":1459041248,"description":"Aajonus Vonderplanitz struggled to save his estranged son from life-threatening injuries following an automobile accident. Through this remarkable story the readers also learn how Aajonus healed himself of terminal cancer, diabetes, bursitis and psoriasis, and how thousands of people have healed themselves of hundreds of &quot;incurable&quot; diseases, simply by eating natural food prepared in specific ways and in specific combinations. We Want To Live also features a remedy section listing hundreds of diseases and ailments with the foods that have healed them. Listed are everything from aging, the common cold, beauty tips to cancer, infant problems, and muscular dystrophy. These phenomenal results with health, healing, and sensible disease-prevention are culled from over 40 years of medical and naturopathic experience and experimentation. We Want To Live is an impressive addition to any health and medicine reference book collection. -- Midwest Book Review\r\n\r\nThis book includes a remedy section listing hundreds of diseases and ailments, with specific foods and combinations of foods that people have used to cure themselves. Listed is everything from beauty tips, the common cold and infant problems, to aging, muscular dystrophy, HIV and cancer","torrent":{"xt":"urn:btih:6a395bc1d64550170101cdd9391076756bea61b8","amp;dn":"We+Want+to+Live+-+The+Primal+Diet+%282005+Expanded+Edition%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6a395bc1d64550170101cdd9391076756bea61b8","infoHashBuffer":{"type":"Buffer","data":[106,57,91,193,214,69,80,23,1,1,205,217,57,16,118,117,107,234,97,184]},"announce":[],"urlList":[]}}