{"title":"Judith Visser 6 boeken (E-Book)NLT-Release","uid":6728568,"size":2004788,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6c2e9edeab9df9f974a6f3c12309874e53467471&amp;dn=Judith+Visser+6+boeken+%28E-Book%29NLT-Release&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"linday1","files":-1,"time":1318031512,"description":"\nBiografieVisser studeerde voor voedingsdeskundige maar wijdde zich daarna aan schrijven. Ze debuteerde in 2006 met Tegengif, waarin het leven van een jonge Rotterdamse prostituee centraal staat. Het boek, waarvan de eerste druk binnen een week was uitverkocht, zorgde voor ophef onder bordeelbezoekers en kreeg veel aandacht in de media. Na het uitkomen van het boek werd Visser overigens op staande voet ontslagen door haar toenmalige werkgever, omdat ze in haar functie als receptioniste alle uitgaande post van promotiestickers voor Tegengif had voorzien.[1] De roman, waarvan ook een door Visser zelf ingesproken audiovariant verscheen, werd uitgeroepen tot Beste Rotterdamse Boek van 2006. Het vervolg Tinseltown, dat verscheen in 2007, werd dat jaar met dezelfde prijs bekroond. In 2008 verscheen Vissers thrillerdebuut Stuk, dat haar een nominatie voor de Gouden Strop 2009 opleverde. Haar eveneens in 2008 gepubliceerde novelle Ysabella werd het Rotterdams Leescadeau van dat jaar. Vissers tweede literaire thriller Oversteken verscheen in 2009, gevolgd door Trip in 2010.\n\nVisser was in 2007 onderwerp van een relletje, toen de openbare bibliotheek van Zuidland in de media liet weten dat Visser niet welkom was om daar een lezing te houden uit eigen werk. Een bibliotheekmedewerkster verklaarde &quot;misselijk&quot; te zijn geworden van de enigszins &quot;pikante&quot; scÃƒÂ¨nes in Tegengif.[2]\n\nIn 2011 bracht de Rotterdamse theatergroep Siberia het toneelstuk Stuk op de planken, gebaseerd op Vissers gelijknamige thriller\n\n2006: Tegengif (roman)\n2008: Ysabella (novelle) (Rotterdams Leescadeau)\n2007: Tinseltown (roman)\n2010: Trip (literaire thriller)\n2008: Stuk (literaire thriller)\n2009: Oversteken (literaire thriller)\n\n\nVoor de nieuwste films, muziek en boeken ga je naar:\n &lt;a href=&quot;\nhttp://www.movierecensies.nl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.movierecensies.nl&lt;/a&gt;\n\nBy Linday","torrent":{"xt":"urn:btih:6c2e9edeab9df9f974a6f3c12309874e53467471","amp;dn":"Judith+Visser+6+boeken+%28E-Book%29NLT-Release","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6c2e9edeab9df9f974a6f3c12309874e53467471","infoHashBuffer":{"type":"Buffer","data":[108,46,158,222,171,157,249,249,116,166,243,193,35,9,135,78,83,70,116,113]},"announce":[],"urlList":[]}}