{"title":"Das_Weisse_Rauschen_-_The_White_Sound.avi","uid":5714560,"size":1468872350,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:6c6be583443401a6bce916ceb31591f2fda7d841&amp;dn=Das_Weisse_Rauschen_-_The_White_Sound.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":1,"time":1280027657,"description":"Das weisse Rauschen (2001) - The White Sound [DVDrip-DEU-SubEng]\n\n[IMG]http://ia.media-imdb.com/images/M/MV5BMTg5NDc4ODg3N15BMl5BanBnXkFtZTcwODQ2MzgxMQ@@._V1._SX275_SY400_.jpg[/IMG]\n\n[IMG]http://ia.media-imdb.com/images/M/MV5BMTg1NjcyNDExN15BMl5BanBnXkFtZTcwNzI1MDc4MQ@@._V1._SX242_SY400_.jpg[/IMG]\n\nDirector: Hans Weingartner\nWriters: Tobias Amann (screenplay), Matthias Schellenberg (screenplay)\nRelease Date: 31 January 2002 (Germany)\nGenre: Drama \nPlot: Kati, Jochen and Lukas take a trip magic mushrooms. Lukas is not coming back. full summary | add synopsis\nPlot Keywords: Magic Mushroom | Paranoid Schizophrenia | Schizophrenia | Jump From Bridge | Hippie\nAwards: 6 wins &amp; 4 nominations \nDurata: 99min\nSottotitoli: Inglese\nAudio: Tedesco \nTracce audio: 2 tracce + 1 traccia che contiene in contemporanea sia l'audio del film che commenti del regista.\nColonna sonora: Musiche di vario genere, tra cui anche alcune canzoni di Fabrizio De Andre! (non sapevo fosse cosi' famoso anche in Germania!)\n\nNote: il regista e' lo stesso di Free Rainer (Reclaim you brain!), di Edukators (Die fette jahre sind vorbei!) e di Berlin Calling. Un fim assolutamente da vedere!\n\nCast:\n\tDaniel BrÃƒÂ¼hl\t\tLukas\n\tAnabelle Lachatte\tKati\n\tPatrick Joswig\t\tJochen\n\tKatharina SchÃƒÂ¼ttler\tRagazza dell'appuntamento al cinema \n\tIlse Strambowski\tCassiera del cinema\n\tMichael SchÃƒÂ¼tz\t\tPsichiatra\n\n\n2 recensioni da imdb.com: [ http://www.imdb.com/title/tt0276617/ ]\n\nAuthor: Christian Wasser from Langen, Germany\n\nNormalmente non sono particolarmente patito di film sulle malattie mentali e odio quando un attore ottiene automaticamente un Academy Award solo per il fatto di avere avuto il ruolo da paziente. &quot;Das weisse Rauschen&quot; e' l'eccezione alla regola.\nIn questo film si ha veramente una comprensione della mente di un paranoico e schizofrenico (interpretato brillantemente da Daniel BrÃƒÂ¼hl ), il tutto e' cosi' ben ricercato che appare autentico al 100% (il regista ha studiato neurologia).\n\nE ancora il film non diventa uno studio su un caso clinico, ma racconta una storia interessante di un giovane ragazzo, Lukas, che trasloca a Cologne (DE) per condividere un appartamento con la sua sorella maggiore, Kati (Anabelle Lachatte) e il suo ragazzo  (di Kati), Jochen. All'inizio tutto va bene; passano le giornate prendendo droghe e divertendosi, ma quando Lukas abbandona gli studi universitari il primo giorno solo perche non riesce a trovare l'ufficio iscrizioni e quando un'appuntamento con una ragazza va male ;-) il pubblico comincia a sospettare che ci sia qualcosa che non va in Lukas.\n\nAppena la schizophrenia si manifesta, il film diventa un'esperienza veramente intensa (simile ai film di  Darren Aronofsky o anche a &quot;Das Experiment&quot;), a causa della colonna sonora che ha la stessa cacofonia delle voci che iniziano a tormentare Lukas.\n\nL'interpretazione e' grandiosa senza eccezioni. Il personaggio di Anabelle Lachatte (veramente sexy, ma coi piedi per terra) potrebbe essere il peggior aiuto che un &quot;matto&quot; possa avere, ma e' sempre chiaro che lei ama il fratelle e che farebbe qualsiasi cosa per aiutarlo. Katharina SchÃƒÂ¼ttler nel suo piccolo ruolo e' brava come sempre. La cinematografia ha l'aspetto e da la sensazione di un &quot;Dogma film&quot;, ma per una volta &quot;it didn't make me dizzy&quot;. (ops nn so che vuol dire dizzy...)\n\nPer concludere, direi che a confronto con &quot;A Beautiful Mind&quot;, &quot;Das weisse Rauschen&quot; e' il film migliore.... molto meglio.\n------------------\n\naltro post:\n\nAuthor: Superunknovvn from Austria, Vienna\n\n&quot;Das weiÃƒ","torrent":{"xt":"urn:btih:6c6be583443401a6bce916ceb31591f2fda7d841","amp;dn":"Das_Weisse_Rauschen_-_The_White_Sound.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6c6be583443401a6bce916ceb31591f2fda7d841","infoHashBuffer":{"type":"Buffer","data":[108,107,229,131,68,52,1,166,188,233,22,206,179,21,145,242,253,167,216,65]},"announce":[],"urlList":[]}}