{"title":"Antonio Carlos Jobim - Terra Brasilis (1980)@flac","uid":12834939,"size":486228192,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:6c9ec52482c126ed0f993701793a1ca944b466d2&amp;dn=Antonio+Carlos+Jobim+-+Terra+Brasilis+%281980%29%40flac&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"alekow1","files":34,"time":1448437452,"description":"\nIt is difficult to add to what has already been stated about this album from 1980. It has some mixed views, ranging from some of the songs being performed in English to the arrangements themsevles. But to me, I love the album. Everything about the performances, the arrangements and concept. Antonio Carlos Jobim performs on vocals and piano/keyboards, it is arranged by Claus Ogerman and maybe even most importantly, produced by one of the Godfather's of Bossa Nova and Brazilian music, Aloysio Oliveira. With this much star power behind the concept, you get a real winner.\r\n\r\nSeveral of the songs will not be new to Bossa Nova fans. But some of the renditions here are amongst my favorite interpretations. On full display is the trademark Jobim/Bossa Nova style of a simultaneous rise and fall orchestration (there's probably a mroe technical t erm for it but...) which really gives you a 'wave' to his music and Claus's arrangements. The album opens up with this on display in &quot;Vivo Sonhando&quot;, a staple and classic. I really enjoyed the way &quot;Desafinado&quot; was done. There's something about Getz/Gilberto's version which I enjoy but this one as well, sung in English, is also quite special. &quot;Voce Vai Ver&quot; is a beautiful bossa, sung in Portuguese along with Jobim's daughter. &quot;Estrada Do Sol&quot; is very sweet too, painting a wonderful picture of whatever you wish it to. &quot;Two Kites&quot; is incredibly romantic - the English to me works very well and is a major takeaway on the album. Innocent and playful, like &quot;Double Rainbow&quot;, a nice pace - it just captures a fantastic moment. Speaking of &quot;Double Rainbow&quot;, that may be my favorite on this album. I love the &quot;Elis &amp; Tom&quot; version, but the orchestration, guitar and sweet piano play puts a smile on my face whenever I hear it. When I hear this version I also remember a fantastic scene in the movie &quot;Bossa Nova&quot; where Pedro Paulo works with his father, a tailor, to create a beautiful dress for a woman he is passionate about. The song fit perfectly with the scene and movie. And what of this version of &quot;Wave&quot;? Like a powerful scene from a movie, full of emotion and passion that has an odd effect with me in that it reminds me of the original - as if it is a soundtrack. It's very beautiful.\r\n\r\nI highly recommend this album. If you are a Bossa Nova fan or Antonio Carlos Jobim fan, you definitely want to own this - it is one of his essentials (along with Elis &amp; Tom, Stone Flower, Wave and a few others). I could not mention all of the songs, but the overwhelming majority of them I really enjoy and the others I enjoy, just not as much as the amazing highlights. The album itself fits with a time in Brazil in the early 1980s - the Bossa Nova movement was well in the past, and Brazil itself was changing with many people moving and buying land in the interior (of course, there are politics and social class issues that play a part, but won't get into that). With all of this, you had people going to states like Mato Grosso which was rich and abundant in nature's beauty. \r\nThere is little else to say about Tom Jobim - he was IMO one of the greatest composers to ever live and this album is testament to that. (Customer from Amazon)\r\n\r\n \nhttp://i.imgur.com/Te3LMNI.jpg\r\n\r\n\r\n01. Dreamer (Vivo Sonhando)    [3:05]\r\n02. Canta Mais (Sing Once More)    [4:34]\r\n03. Olha Maria (Amparo)    [4:07]\r\n04. One Note Samba    [2:20]\r\n05. Dindi    [4:18]\r\n06. Quiet Nights Of Quiet Stars (Corcovado)    [3:29]\r\n07. Marina    [2:57]\r\n08. Off-Key (Desafinado)    [3:28]\r\n09. Voce Vai Ver (You'll See)    [2:58]\r\n10. Estrada Do Sol (Road To The Sun)    [2:07]\r\n11. The Girl From Ipanema    [4:50]\r\n12. Double Rainbow    [4:06]\r\n13. Triste    [3:07]\r\n14. Wave    [3:40]\r\n15. Someone To Light Up My Life (Se Todos Fossem Iguais A Voce)    [3:07]\r\n16. Falando De Amor (Speaking Of Love)    [3:43]\r\n17. Two Kites    [4:39]\r\n18. Modinha (Serenade)    [3:39]\r\n19. Song Of The Sabia (Sabia)    [4:07]\r\n20. This Happy Madness (Estrada Branca)    [2:49]\r\n\r\n\r\n\r\n\r\nComposed By, Vocals, Keyboards - Antonio Carlos Jobim\r\n\r\nGuitar - Bucky Pizzarelli (tracks: 12), Oscar Castro-Neves, Vinnie Bell\r\nBass - Bob Cranshaw, Mike Moore (tracks: 12, 16, 17, 7)\r\nDrums - Grady Tate (tracks: 12), Pascoal De Souza Meirelles\r\nPercussion - Rubens Bassini\r\n\r\n\r\nProducer - Aloyiso Oliveira\r\nEngineer - Bob Simpson\r\nDesign - Mental Block\r\n\r\nOrchestra arranged and conducted by Claus Ogerman\r\n\r\n\r\nLabel: Warner Bros. Records\r\nReleased: 1995\r\nCatalogue: 7599-23409-2 \r\n\r\nCodec: Flac\r\nCompression Level: 6\r\nQuality: High\r\n\r\n\r\nCD-rip by alekow (EAC and Flac)\r\nCovers Included (600dpi)\r\n\r\nEnjoy, Seed and Share","torrent":{"xt":"urn:btih:6c9ec52482c126ed0f993701793a1ca944b466d2","amp;dn":"Antonio+Carlos+Jobim+-+Terra+Brasilis+%281980%29%40flac","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6c9ec52482c126ed0f993701793a1ca944b466d2","infoHashBuffer":{"type":"Buffer","data":[108,158,197,36,130,193,38,237,15,153,55,1,121,58,28,169,68,180,102,210]},"announce":[],"urlList":[]}}