{"title":"Phil and Frantics 1964-68/ Third Bardo 1967","uid":3390333,"size":93872031,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:6ca900114b4b0d3c1fc894f00dabd98fc65ba409&amp;dn=Phil+and+Frantics+1964-68%2F+Third+Bardo+1967&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"buzzard","files":24,"time":1128105622,"description":"1. Phil and The Frantics - Bacchus Archives 1964-1968 \n\nsize:        65.8 mb\nbitrate:     256\n(rip is not mine)\n\t  \t  \t\n\nPersonnel:\nSTEVE FORMAN \tld gtr \tA\nPHIL KELSEY \tvcls, sax \tA \tB \tC\nJOHN LAMBERT \tbs, vcls \tA \tB\nBILL POWELL \tgtr, vcls \tA \tB\nRICK ROSE \tkeyb'ds \tA \tB\nJOE MARTINEZ \tdrms \t\tB \tC\nSTEVE DODGE \tgtr \t\t\tC\nTED HARCHEK \tkeyb'ds \t\t\tC\nDON SNIDER \tbs \t\t\tC\nFRANK UVEDS \t\t\n \n\nALBUM:\n1(A/B) \tROUGH DIAMONDS: HISTORY OF GARAGE BAND MUSIC, VOL. 3: PHIL AND THE FRANTICS \t(Voxx VXM 200.001) \t1985\n \n\n45s:\n1.She's My Gal/Ko-Ko Joe \t(La Mar 100) \t1964\n2.New Orleans/To Me \t(Sounds Ltd 1216) \t1965\n3.Say That You Will/Till You Get What You Want \t(ARA 1968) \t1965\n4.I Must Run/Pain \t(Rabbit 1219) \t1966\n5.I Must Run/What's Happening \t(Ramco/ARA 1970) \t1966\n \n\nPhil Kelsey was born into a musical environment in Dallas, both his parents had jazz and gospel experience. His family later moved to Phoenix, Arizona where in his last two years of school he fronted The Four Gants, a fifties rock combo. Kelsey put together line-up 'A' of Phil And The Frantics in 1963. Jim Musil discovered the band playing at their own Phoenix club, The Cave, and became their manager and producer. Phil renamed the club The Frantic Den and enlisted his mother's assistance to run it. Their early recordings were much influenced by the British invasion sound. The first 45 made no impact at1 all, the second was a local hit and the third a smash hit in Phoenix. Both sides, particularly the flip, featured haunting minor key melodies making this their best record so far. However, I Must Run, which was produced by Waylon Jennings and largely based on I Must Move, an early Zombies 'B' side, went one better charting in many parts of the country although it was not a national hit. After its success they toured with Peter and Gordon and also played with other big name acts, but the band fell apart when Lambert and Powell left to join Beethoven Soul, a California band who had an album on Dot. Kelsey put together a new lineup (C) but their now dated British invasion sound could not survive the psychedelic era.\n\nThe Voxx compilation traces the band's musical development superbly and has excellent liner notes part of which have been summarised here. The first side concentrates largely on fast R&amp;B rockers, the flip on their British invasion sound. All their 45s are included.\n\nUpon the demise of Phil And The Frantics Phil Kelsey and Steve Dodge drifted between L.A., Las Vegas and Phoenix. They changed their name to Phil Mark Five and then with the addition of Bobby Blood on trumpet to The Babies. An album was recorded after a deal with ABC - Dunhill in 1969. They toured with Three Dog Night, Blues Image and other popular bands of the time but, increasingly beset by drug problems and after three 45s had flopped, they then learnt that their album was shelved. Shortly afterwards, when Phil broke his leg, the band sacked him!\n\nBack in L.A. Phil became an active session musician and songwriter. He worked with Earth Wind and Fire, Billy Preston and Brenton Wood among others. In 1979 he changed his name to Devin Payne and recorded an album, Excuse Me, which was scheduled for release on Casablanca but shelved when the company went bust in 1980. Later he produced a record for Blow-Up, a sixties-inspired new wave band.\n\nCompilation appearances include: I Must Run on Pebbles Vol. 2 (CD) and Pebbles, Vol. 2 (LP); I Must Run and Til You Get What You Want on Pebbles Box (4-LP), Acid Dreams - The Complete 3 LP Set (3-LP), Acid Dreams Epitaph (CD) and Trash Box (5-CD); Pain on Garage Music For Psych Heads, Vol. 1. \n\n\n\nFrom &quot;THE ARIZONA '60s SCENE&quot; (http://www.dionysusrecords.com/bacchus/arizona.html)\nPhil And The Frantics gained their widespread notoriety over a decade after they disbanded by being one of the bands to have their regional Arizona hit single &quot;I Must Run&quot; included on one of the best-known '60s garage compilations, Pebbles Volume 1(first released in 1978). In 1980, an entire Phil And The Frantics album was released on the Voxx label as a vinyl LP. The Bacchus Archives release of Phil and the Frantics on CD includes some of the same tracks, re-mastered from all the original '64-'68 tapes, including bonus never before released stereo mixes of &quot;I Must Run&quot; and three others. Detailed liner notes supplied by none other than the number one expert on Arizona Music, Johnny D. Cool photos included too!\n\n*****\nWhat set Phil &amp; The Frantics appart from most of their Arizona contemporaries was their ability to pull off strong original material, as exemplified by excellent songs like &quot;Pain&quot;, &quot;Where Am I Running to&quot; and &quot;Till You get What You Want&quot;. With their penchant for minor keys, winsome vocal leads and organ-driven arrangements, the Frantics owe a heavy debt to the Zombies. No further proof of that is needed than &quot;I Must Run&quot;, a shameless rewrite of that group's &quot;I Must Move&quot; - except the Frantics track actually surpasses the original in atmosphere and emotional hurt. (Ugly Things)\n\nA top draw in their native Phoenix, Phil and the Frantics were basically unknown elsewhere until a 1966 side called &quot;I Must Run&quot; appeared on Pebbles Volume 2 a decade and a half later. Without question, the song is one of the greatest garage ballads ever made. Using the Zombies' &quot;I Must Move&quot; as its blueprint, &quot;I Must Run&quot; coalesces that band's minor-key drama with teenage naivete and a dreamy vocal-organ interplay that recalls the under-the-street-light aura of doo-wop (Trivia note: Waylon Jennings plays the 12-string guitar on this masterpiece). The good news for anyone who loves &quot;I Must Run&quot; is that Phil and the Frantics were the purveyors of several more evocative ballads... (Discoveries) \n\n\n1. Theme  (2:10)\n2. New Orleans  (3:06)\n3. What's Happening  (2:21)\n4. Say That You Will  (2:32)\n5. Pain  (2:15)\n6. I Must Run  (2:38)\n7. Till You Get What You Want  (2:40)\n8. I'm High  (3:00)\n9. Where Am I Running To?  (2:10)\n10. To Me  (2:39)\n11. The Last Time  (2:47)\n12. Act Naturally  (2:24)\n13. Pain [Stereo Mix]  (2:08)\n14. I Must Run [Stereo Mix]  (2:39)\n15. Till You Get What You Want [Stereo Mix]  (2:40)\n16. Theme [Stereo Mix]  (2:10)\n\nBA1139 1999\n\n2. The Third Bardo - The Third Bardo (I'm Five Years Ahead Of My Time) EP\n\nsize:        23.7 mb\nbitrate:     192\n(rip is not mine)\n\t\n\nPersonnel:\nBRUCE GINSBERG \tdrms \tA\nRICKY GOLDCLANG \tld gtr \tA\nDAMIAN KELLY \tbs \tA\nJEFFREY MOON (real name: NEUFELD) \tvcls, gtr \tA\nRICHY SESLOWE \tgtr \tA\n \n\nEPs:\n1(A) \tLOSE YOUR MIND (7&quot;) \t(Sundazed SEP 106) \t1993\n2(A) \tTHE THIRD BARDO (10&quot;) \t(Sundazed SEP 10-160) \t2000\n\nNB: (1) contains Five Years Ahead Of My Time, Lose Your Mind, I Can't Understand Your Problem and Dawn Of Tomorrow. The latter three are previously unreleased. The EP was released on yellow vinyl. (2) gathers all their 1967 recordings - essentially adding two versions of My Rainbow Life (one previously unheard) to the 7&quot; EP tracks.  \n\n45:\n1(A) \tI'm Five Years Ahead Of My Time/My Rainbow Life \t(Roulette 4742) \t1967\n \n\nA New York outfit. Their name, chosen by lead singer Jeffrey Monn and extracted from the 'The Tibetan Book of the Dead', refers to a &quot;return to reality&quot;. The inclusion of I'm Five Years Ahead Of My Time on Pebbles, Vol. 3 (LP) has made it something of a classic among collectors of psychedelic punk. Deservedly so in view of its haunting intro and fine fuzztone guitar work. Subsequently it has resurfaced on other compilations:- Born Bad (The Songs The Cramps Taught Us), Songs We Taught The Cramps, Nuggets Box (4-CD), Pebbles Vol. 3 (CD), Trash Box (5-CD) and Best of Pebbles, Vol. 1 (LP &amp; CD). Rusty Evans of The Deep/Freak Scene wrote the 45 for The Third Bardo along with songwriter Victoria Pike, who was married to The Third Bardo's producer Teddy Randazzo (of Roulette Records) at the time. The excellent flip side of the 45 can also be heard on Vile Vinyl, Vol. 2 (LP) and Magic Carpet Ride (LP) whilst another version of it appears on Freak Scene's Psychedelic Psoul LP. If that wasn't enough, David Walters (author of the excellent &quot;Children of Nuggets&quot; book) has pointed out that the version of My Rainbow Life on Glimpses, Vol. 4 (LP) is an acetate version, 20 seconds shorter than the final single and with a different mix! Both sides of the 45 can also be now heard on Psychedelic Microdots Of The Sixties, Vol. 3 (CD).\n\nIn the early seventies, their lead singer Neufeld released an album under another pseudonym, Chris Moon. In the 1980s The Nomads did a fine cover version of I'm Five Years Ahead Of My Time and Kenne Highland's Majestic Gizmos reworked it into He's Five Beers Ahead Of Your Time (!) on the LP of that name.\n\nIn 1999, Rusty Evans has helped re-record I'm Five Years Ahead Of My Time, My Rainbow Life and a number of other tracks with his son's band Kaos. Although currently unreleased, the new recordings are great, capturing the spirit of the originals. Rusty may also be writing some new material for The Third Bardo themselves, who played live again on May 16th 1999 with a line-up of Jeff Moon aka Neufeld, Damian Kelly and Ricky GoldClang from the original band. As for former drummer Bruce Ginsburg, his whereabouts are unknown - somewhere in California, whilst Richie Seslowe sadly died of a drug overdose in the eighties.\n\nTRACK LISTING\nI'm Five Years Ahead Of My Time\nRainbow Life\nDawn Of Tomorrow\nLose Your Mind\nRainbow Life (alternate version)*\nI Can Understand Your Problem\n\n*previously unissued\n\nSundazed SEP 10-160","torrent":{"xt":"urn:btih:6ca900114b4b0d3c1fc894f00dabd98fc65ba409","amp;dn":"Phil+and+Frantics+1964-68%2F+Third+Bardo+1967","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6ca900114b4b0d3c1fc894f00dabd98fc65ba409","infoHashBuffer":{"type":"Buffer","data":[108,169,0,17,75,75,13,60,31,200,148,240,13,171,217,143,198,91,164,9]},"announce":[],"urlList":[]}}