{"title":"Solar Energy An Introduction","uid":11995518,"size":8231153,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6ce4b2e9268f82cf6b5651d12b19fb2681a4bc23&amp;dn=Solar+Energy+An+Introduction&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1433623813,"description":"ISBN 9780199652105\n\n\nSolar Energy presents an introduction to all aspects of solar energy, from photovoltaic devices to active and passive solar thermal energy conversion, giving both a detailed and broad perspective of the field. It is aimed at the beginner involved in solar energy or a related field, or for someone wanting to gain a broader perspective of solar energy technologies.\n\nA chapter considering solar radiation, basic principles applied to solar energy, semiconductor physics, and light absorption brings the reader on equal footing with the technology of either solar generated electrical current or useful heat. Details of how a solar cell works and then production of current from a photovoltaic device is discussed. Characterization of a solar cell is examined, allowing one the ability to interpret the current-voltage relation, followed by discussion of parameter extraction from this relation. This information can be used to understand what limits the performance of a given solar cell with the potential to optimize its performance. Applications of solar thermal energy are reviewed in detail from passive applications, for example the solar chimney, to active, such as the solar (power) tower, flat plate water heater, and solar thermal electricity generation. Consistency of analysis between the solar thermal applications is used enabling the reader to fully appreciate similarities and dissimilarities between these technologies. Ultimately, the scientist or engineer can understand existing systems, either photovoltaic or solar thermal devices, and design their own technology given the information in this book","torrent":{"xt":"urn:btih:6ce4b2e9268f82cf6b5651d12b19fb2681a4bc23","amp;dn":"Solar+Energy+An+Introduction","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6ce4b2e9268f82cf6b5651d12b19fb2681a4bc23","infoHashBuffer":{"type":"Buffer","data":[108,228,178,233,38,143,130,207,107,86,81,209,43,25,251,38,129,164,188,35]},"announce":[],"urlList":[]}}