{"title":"Signs of Life","uid":9562752,"size":269997139,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:6e4b69957eb23551a556fa951915ba423c845bf0&amp;dn=Signs+of+Life&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Betelo","files":1,"time":1391466329,"description":"About the Game \n\nSigns of Life is a sci-fi survival sandbox platformer with a combination of procedurally generated and hand-crafted content. You'll explore mysterious locations, Mine blocks for resources, and meet strange (and some familiar) creatures, some of which don't even want to kill you and eat your corpse. Along the way, you'll be able to craft armor, weapons, gadgets and more to assist you in surviving in an inhospitable environment. \n\nChange Log \n\nVersion 0.17 \n- Mobs should no longer spawn anywhere that has a player-placed background. \n- Scissors and saw now require copper instead of iron \n\nVersion 0.16 \n- Changed behavior of some mobs to stop them from piling up quite so much. \n- Fixed a bug that would dupe tiles with the firestarter \n- Spitter spit no longer affects spitters \n- You can now drop items on containers to put them inside \n- Made gems stackable \n- Added a bunch of craftable tiles (Wood, stone, iron, steel) \n- Fixed an issue with saving impaler spikes on some systems \n\nVersion 0.15 \n- Hotfix for right clicking objects, broke with the equippable torch patch \n\nVersion 0.14 \n- Fixed a crash introduced in the last patch with clubs \n- Made it so you can scroll through the scroll slots by clicking the appropriate number repeatedly \n- Added back in the small font, there are now 3, small/medium/large, if you notice any issues let us know","torrent":{"xt":"urn:btih:6e4b69957eb23551a556fa951915ba423c845bf0","amp;dn":"Signs+of+Life","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6e4b69957eb23551a556fa951915ba423c845bf0","infoHashBuffer":{"type":"Buffer","data":[110,75,105,149,126,178,53,81,165,86,250,149,25,21,186,66,60,132,91,240]},"announce":[],"urlList":[]}}