{"title":"The Rough Guide to Bottleneck Blues","uid":7760766,"size":66631147,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:6e81eda2f4d80b2547d2cfb8cb6fba915786f14b&amp;dn=The+Rough+Guide+to+Bottleneck+Blues&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Christian93","files":23,"time":1351220058,"description":"The eerie sound of the bottleneck guitar -- an acoustic guitar played with a glass or metal slide worn over one of the fingers of the left hand -- is closely identified with Delta blues, the rawer, folkier cousin of the louder, more electric, and horn-heavy Chicago school. It's a sound steeped in poverty and humidity, and some of the spookiest and most frightening blues songs in history were written to be played on bottleneck guitar. This collection offers a good cross-section of old and modern bottleneck blues songs by an admirably diverse selection of artists including early masters of the genre (Robert Johnson, Blind Willie McTell, Bukka White) as well as current students of the masters (Bob Brozman, Stefan Grossman, Martin Simpson). Unfortunately, not all of these artists are represented by their finest work; it's hard to imagine that this rough recording of &quot;Jack O'Diamonds&quot; was the best Pete Harris performance available (though the slide playing itself is impressive), or that the compilers couldn't have come up with a better example of Charley Patton's work than the lackluster rendition of &quot;A Spoonful Blues&quot; presented here. But just about everything else borders on the definitive, whether it's Bukka White's amazing &quot;Sic 'Em Dogs On&quot;; Blind Willie Johnson's hair-raising &quot;God Moves on the Water&quot;; or the jaunty, jazzy &quot;You Just as Well Let Her Go&quot; by Casey Bill Weldon.\n\nTaken from: http://www.allmusic.com/album/the-rough-guide-to-bottleneck-blues-mw0000655362","torrent":{"xt":"urn:btih:6e81eda2f4d80b2547d2cfb8cb6fba915786f14b","amp;dn":"The+Rough+Guide+to+Bottleneck+Blues","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6e81eda2f4d80b2547d2cfb8cb6fba915786f14b","infoHashBuffer":{"type":"Buffer","data":[110,129,237,162,244,216,11,37,71,210,207,184,203,111,186,145,87,134,241,75]},"announce":[],"urlList":[]}}