{"title":"How to Become a Deadly Chess Tactician (David LeMoir)","uid":8741240,"size":8824896,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6e957005d1a3a33c7ad6261e6eb6162df33cdd26&amp;dn=How+to+Become+a+Deadly+Chess+Tactician+%28David+LeMoir%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"OmeGa15","files":-1,"time":1374792415,"description":"A guide for chess-players to help them spot unlikely-looking tactical tricks and launch cunning attacks. Readers are shown how to hunt the enemy king and how to seize the initiative with surprising sacrifices. LeMoir shows that the key factors in becoming a deadly tactician are motivation (having the willingness to sacrifice and to consider tactical ideas during play), imagination (being aware of tactical concepts that lead to ideas which other players might miss) and calculation (being able to analyse and calculate effectively).\n\nThis user-friendly and humorously written book contains many outstanding examples of seized opportunities, together with guidance on how to spot surprising tactics and handle positions of material imbalance. Throughout, there are exercises for the reader to tackle.\n\n\n-- About the Author --\n\nDavid LeMoir is an experienced chess player and writer. He twice won the championship of the West of England and was runner-up on four occasions. In 2000, he was Champion of the English county of Norfolk. In a successful career as a business strategy consultant, he has made good use of the strategic and decision-making skills that are developed by playing chess.","torrent":{"xt":"urn:btih:6e957005d1a3a33c7ad6261e6eb6162df33cdd26","amp;dn":"How+to+Become+a+Deadly+Chess+Tactician+%28David+LeMoir%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6e957005d1a3a33c7ad6261e6eb6162df33cdd26","infoHashBuffer":{"type":"Buffer","data":[110,149,112,5,209,163,163,60,122,214,38,30,110,182,22,45,243,60,221,38]},"announce":[],"urlList":[]}}