{"title":"Writing Centers and the New Racism: A Call for Sustainable Dialo","uid":8792959,"size":1405788,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6f1e22ee9ad0eb46dba737bf0a0be03a82260dda&amp;dn=Writing+Centers+and+the+New+Racism%3A+A+Call+for+Sustainable+Dialo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"blackatk","files":-1,"time":1375998834,"description":"Publication Date: October 16, 2011 | ISBN-10: 0874218616 | ISBN-13: 978-0874218619 | Edition: 1 | With A special thanks to &quot;wetworx12&quot; - The bitter, race-baiting troll who inspired this upload. | filetype: pdf |\n\n\nNoting a lack of sustained and productive dialogue about race in university writing center scholarship, the editors of this volume have created a rich resource for writing center tutors, administrators, and scholars. Motivated by a scholarly interest in race and whiteness studies, and by an ethical commitment to anti-racism work, contributors address a series of related questions: How does institutionalized racism in American education shape the culture of literacy and language education in the writing center? How does racism operate in the discourses of writing center scholarship/lore, and how may writing centers be unwittingly complicit in racist practices? How can they meaningfully operationalize anti-racist work? How do they persevere through the difficulty and messiness of negotiating race and racism in their daily practice? The conscientious, nuanced attention to race in this volume is meant to model what it means to be bold in engagement with these hard questions and to spur the kind of sustained, productive, multi-vocal, and challenging dialogue that, with a few significant exceptions, has been absent from the field.\n\n\n\nPaperback: 256 pages\nPublisher: Utah State University Press; 1 edition (October 16, 2011)\nLanguage: English\nISBN-10: 0874218616\nISBN-13: 978-0874218619\n\n\n\nwww.amazon.com/Writing-Centers-New-Racism-Sustainable/dp/0874218616/\n\n\n\nTags: race, racism, stereotypes, literature, writing, author, education, higher education, diction, white narrative, usa, america, united states, oppression, exclusion, ","torrent":{"xt":"urn:btih:6f1e22ee9ad0eb46dba737bf0a0be03a82260dda","amp;dn":"Writing+Centers+and+the+New+Racism%3A+A+Call+for+Sustainable+Dialo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6f1e22ee9ad0eb46dba737bf0a0be03a82260dda","infoHashBuffer":{"type":"Buffer","data":[111,30,34,238,154,208,235,70,219,167,55,191,10,11,224,58,130,38,13,218]},"announce":[],"urlList":[]}}