{"title":"The Collected Works of St. John of the Cross (pdf)","uid":8192895,"size":6449257,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6f3875495a6f9244f5f3f9dbe4e6fae9f895a5ad&amp;dn=The+Collected+Works+of+St.+John+of+the+Cross+%28pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pharmakate","files":-1,"time":1361867335,"description":"The Collected Works of Saint John of the Cross (Kieran Kavanaugh and Otilio Rodriguez, translators). (Institute of Carmelite Studies, 1991). 815 pages.\n\nNew scan. Searchable pdf (clearscan) with contents in bookmarks, accurate pagination and metadata, etc.\n\nShort description:\n\nAll the writings of one of the world's great mystics in one volume. This is the best English translation of the the complete works currently available.\n\nDescription:\n\nThe fourth centenary of the death of St. John of the Cross inspired this revised edition of the English translation of his writings. The result is an edition that preserves the true meaning of the great mystic's writings, presents them as clearly as possible, and at the same time gives the reader the doctrinal and historical information that will lead to a deeper understanding and appreciation of the teachings of the Mystical Doctor. Included in The Collected Works are St. John's poetry, The Ascent of Mount Carmel, The Dark Night, The Spiritual Canticle, and The Living Flame of Love, as well as his letters and other counsels. There is a general introduction for the entire work and brief, enlightening introductions for each specific work, explaining theme and structure. Enhancing these are the new footnotes, glossary of terms, and index.\n\nReviews\n\nAn excellent and practical edition. --Studium\n\nThis is an extremely worthwhile and classic resource for cultivating a deeper inner life. --Theological Students Fellowship\n\nThe Institute of Carmelite Studies publishes excellent works at very inexpensive prices; its exemplary edition of The Collected Works of Saint John of the Cross, for instance, would get my vote as one of the best theological buys of all time. --Lawrence Cunningham, U.S. Catholic\n\n","torrent":{"xt":"urn:btih:6f3875495a6f9244f5f3f9dbe4e6fae9f895a5ad","amp;dn":"The+Collected+Works+of+St.+John+of+the+Cross+%28pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6f3875495a6f9244f5f3f9dbe4e6fae9f895a5ad","infoHashBuffer":{"type":"Buffer","data":[111,56,117,73,90,111,146,68,245,243,249,219,228,230,250,233,248,149,165,173]},"announce":[],"urlList":[]}}