{"title":"Ibn Warraq - Why the West is Best (mobi, epub)","uid":6926976,"size":1421216,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6f4281b3b5d8cb9094124479e11c379d1905481d&amp;dn=Ibn+Warraq+-+Why+the+West+is+Best+%28mobi%2C+epub%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":2,"time":1325542436,"description":"Why the West is Best: A Muslim Apostate's Defense of Liberal Democracy\n\nWe, in the West in general, and the United States in particular, have witnessed over the last twenty years a slow erosion of our civilizational self-confidence. Under the influence of intellectuals and academics in Western universities, intellectuals such as Gore Vidal, Susan Sontag, Edward Said, and Noam Chomsky, and destructive intellectual fashions such as post-modernism, moral relativism, and mulitculturalism, the West has lost all self-confidence in its own values, and seems incapable and unwilling to defend those values. By contrast, resurgent Islam, in all its forms, is supremely confident, and is able to exploit the West's moral weakness and cultural confusion to demand ever more concessions from her. The growing political and demographic power of Muslim communities in the West, aided and abetted by Western apologists of Islam, not to mention a compliant, pro-Islamic US Administration, has resulted in an ever-increasing demand for the implementation of Islamic law--the Sharia--into the fabric of Western law, and Western constitutions. There is an urgent need to examine why the Sharia is totally incompatible with Human Rights and the US Constitution. This book, the first of its kind, proposes to examine the Sharia and its potential and actual threat to democratic principles.\n\nThis book defines and defends Western values, strengths and freedoms often taken for granted. This book also tackles the taboo subjects of racism in Asian culture, Arab slavery, and Islamic Imperialism. It begins with a homage to New York City, as a metaphor for all we hold dear in Western culture--pluralism, individualism, freedom of expression and thought, the complete freedom to pursue life, liberty and happiness unhampered by totalitarian regimes, and theocratic doctrines.\n\nIbn Warraq, Islamic scholar and a leading figure in Koranic criticism, is a visiting fellow at the Center for Law and Counterterrorism, a project of the Foundation for Defense of Democracies. Warraq's op-ed pieces have appeared in the Wall Street Journal in America and The Guardiann, and he has addressed distinguished governing bodies all over the world, including the United Nations in Geneva, and Members of the Dutch Parliament, at The Hague. Mr. Ibn Warraq completed in 2007, a critical study of the thought of Edward Said, Defending the West, which Paul Berman, author of Terror and Liberalism, described as &quot;a glorious work of scholarship, and it is going to contribute mightily to modernising the way we think about Western civilisation and the rest of the world.&quot;\n\nAuthor: Ibn Warraq\nPublisher: Encounter Books\nPublication Date: December 13, 2011\n\nFormats:\n.epub (compatible with Sony Reader, Cruz Reader, iPad, iPodTouch/iPhone, etc.)\n.mobi (compatible with Amazon Kindle, etc.)\n\nFree Calibre eBook reader: &lt;a href=&quot;\nhttp://calibre-ebook.com/download&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://calibre-ebook.com/download&lt;/a&gt;\n","torrent":{"xt":"urn:btih:6f4281b3b5d8cb9094124479e11c379d1905481d","amp;dn":"Ibn+Warraq+-+Why+the+West+is+Best+%28mobi%2C+epub%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6f4281b3b5d8cb9094124479e11c379d1905481d","infoHashBuffer":{"type":"Buffer","data":[111,66,129,179,181,216,203,144,148,18,68,121,225,28,55,157,25,5,72,29]},"announce":[],"urlList":[]}}