{"title":"Go West - King Of Wishful Thinking","uid":4657788,"size":144244740,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:6f465c9531a8a0a237387d37cd4a3e2237e1a5f3&amp;dn=Go+West+-+King+Of+Wishful+Thinking&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1232272967,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\n&quot;King of Wishful Thinking&quot; is a 1990 hit song by the British pop band Go West. It came from the movie Pretty Woman, which starred Julia Roberts and Richard Gere. The single was a #8 hit in the United States during the summer of 1990, and Go West's biggest hit ever. It charted inside the UK Top 20, reaching #18. The song is covered on New Found Glory's album From the Screen to Your Stereo Part II, where the pop-punk band covers more songs from popular film soundtracks. Also it was covered by Olga TaÃƒÂ±ÃƒÂ³n on her album Te AcordarÃƒÂ¡s de MÃƒÂ­; this version was titled &quot;Voy a Sacarte de Mi Mente&quot; (&quot;I Am Going to Get You Out of My Mind&quot;).\n\nIt has also found popular use as the closing logo for Gracie Films, as seen at the end of the popular animated series The Simpsons, as well as at San Francisco Giants home games.\n\nGo West is an English pop duo, formed in 1982, by Peter Cox (born 17 November 1955, in Kingston, Surrey, England); and Richard Drummie (born 20 March 1959, in Twickenham, London, England). While they have had many successful singles in their native England, they are generally best known in America for their hits &quot;King of Wishful Thinking&quot; and &quot;Faithful.&quot;\n\nIn 1990, Go West finally broke through to American audiences in a big way, when they scored a Top 10 U.S. hit with the song &quot;King of Wishful Thinking&quot; from the movie, Pretty Woman. Unlike many hits from soundtracks of major movies that are written by outside songwriters and merely performed by a musical artist, &quot;King of Wishful Thinking&quot; was actually written by Cox and Drummie themselves (in collaboration with Martin Page). In 1991, the song received an ASCAP award for being one of the most played songs in America the previous year.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:6f465c9531a8a0a237387d37cd4a3e2237e1a5f3","amp;dn":"Go+West+-+King+Of+Wishful+Thinking","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6f465c9531a8a0a237387d37cd4a3e2237e1a5f3","infoHashBuffer":{"type":"Buffer","data":[111,70,92,149,49,168,160,162,55,56,125,55,205,74,62,34,55,225,165,243]},"announce":[],"urlList":[]}}