{"title":"Dragon Quest VIII v1.0.9 mod and data","uid":13573757,"size":1563829892,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:6fb25d75fe83c885b41ce0107a47f71f6a035e6a&amp;dn=Dragon+Quest+VIII+v1.0.9+mod+and+data&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"tiropitaki","files":3,"time":1455689989,"description":"The 8th instalment in the legendary DRAGON QUEST series is now even easier to enjoy!\r\n\r\nThe phenomenally popular DRAGON QUEST VIII has sold 4.9 million units worldwide, and now it's coming to the Android for the first time!\r\n\r\nThis was the first title in the series to be presented in full 3D, and its exquisitely detailed world has to be seen to be believed!\r\n\r\nSet off on an unforgettable adventure with Yangus, the bandit with a heart of gold, Jessica, the high-born magical minx, and Angelo, knight and lothario, by your side!\r\n\r\nEverything you need is here in a single package!\r\n\r\nOnce the app is downloaded, there's no more to pay, as every last shred of content is yours to enjoy.\r\n\r\nSo get ready to play the epic that is DRAGON QUEST VIII from beginning to end—and far beyond!\r\n\r\n*************************\r\n\r\nPrologue\r\nLegends tell of an ancient sceptre, within which is sealed a fearsome power...\r\n\r\nWhen the relic's long-dormant magics are awoken by the treachery of a malign magician, an entire kingdom falls into a cursed slumber, prompting a young soldier to embark on an unforgettable journey...\r\n\r\nGame Features\r\n\r\n– Simple, Accessible Controls\r\nThe control system has been streamlined to work perfectly with modern touch interfaces. The position of the directional pad can be adjusted freely, enabling players to switch between one-handed and two-handed play with a tap of the screen. The combat system has also been reworked, allowing for one-tap battles as well as more complex play.\r\n\r\n– The Tension System\r\nDuring battle, you can select 'Psyche Up' to give your next attack some extra oomph! The more you psyche a character up, the higher their tension will rise, until they finally reach an insane state known as super-high tension!\r\n\r\n– Skill Points\r\nSkill points are earned when your characters level up, and can be assigned to various skills in order to learn new spells and abilities. This system allows you to perfectly tailor your team to your liking.\r\n\r\n– Monster Teams\r\nCertain monsters found in the field can be scouted for your monster team – if you're tough enough to beat them, that is! Once assembled, your crack squad can take part in the fiercely-contested tournaments held at the monster arena, and can even come to your aid in battle!\r\n\r\n– The Alchemy Pot\r\nCombine existing items to create entirely new ones! Even the most unassuming objects could be ingredients for the greatest items of all! Seek out the recipes hidden all over the world, and see if you can cook up something truly special!\r\n\r\n– The Casino\r\nFans of the series will be pleased to learn that the casino is back, and fully-equipped for fun! This time around, there are three exciting activities to enjoy: bingo, slot machines and roulette! Just don't get so caught up in the action that you forget your adventure entirely!\r\n_____________\r\n\r\n[Supported Devices]\r\nDevices running Android 4.0 or higher (some devices not supported).\r\n\r\n[Warning]\r\nDevices running Android 4.4 may experience problems initialising the app under ART, but as ART is not selected by default, this should not affect the majority of users. The game will be validated the first time it is loaded, and at predetermined intervals afterwards, and therefore cannot be initialised while offline. Please make sure you have a data connection before running the app. Once the game is initialised however, it can be played offline (except for online features).\r\n\r\nWhat’s new:\r\nBug fix.\r\n\r\nMod Info: \r\n1. Unlimited gold\r\n2. Enemy has low health\r\n3. Enemy has low attack\r\n\r\nInstall APK,Place data folder in SDCard/Android/Obb/ and play.\r\nRequires Android: 2.3 and up","torrent":{"xt":"urn:btih:6fb25d75fe83c885b41ce0107a47f71f6a035e6a","amp;dn":"Dragon+Quest+VIII+v1.0.9+mod+and+data","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6fb25d75fe83c885b41ce0107a47f71f6a035e6a","infoHashBuffer":{"type":"Buffer","data":[111,178,93,117,254,131,200,133,180,28,224,16,122,71,247,31,106,3,94,106]},"announce":[],"urlList":[]}}