{"title":"ASL Starter Kit Expansion Pack #1","uid":10456187,"size":56500901,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:70e8091e990d1f9b4e29322c3caa0e79a642d3ef&amp;dn=ASL+Starter+Kit+Expansion+Pack+%231&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":-1,"time":1404077701,"description":"Advanced Squad Leader: Starter Kit Expansion Pack #1\n\nMMP presents the 4th installment of it successful Advanced Squad Leader Starter Kit line, The Advanced Squad Leader Starter Kit Expansion Pack #1. The Expansion Pack has been designed with all levels of Starter Kit players in mind and includes something for everyone.\n\nThe Expansion Pack includes three new boards; q, r, and s consisting of a small city board, a village/woods board, and a rural woods/hill board.\n\nIn addition, the Pack comes with 8 new scenarios set in locations such as Poland 1939, Finland 1942, Sicily 1943, France 1944, and Germany 1944. The Expansion Pack includes actions pitting the Poles against the Slovakian army, Russians advancing against Germans, Americans in their struggle against the Italians, and the Free French forces defending against a sudden German counterattack.\n\nThe Expansion Pack is completely standalone providing everything you need to play the game (except dice) including new counters and updated rules and charts addressing known errata!\n\nThis product is a must have for Advanced Squad Leader Starter Kit enthusiasts everywhere.\n\nThe Expansion Pack covers actions that allow any level of Starter Kit player from Starter Kit 1 to Starter Kit 3 with 2 Infantry only (Starter Kit 1) scenarios, 2 Infantry and Guns (Starter Kit 2) scenarios, and 4 scenarios with Tanks (Starter Kit 3) of which 2 have tanks on one side only.\n\nFight your way across the tactical battlefields of World War 2 using the men and equipment available historically. Only this time you can determine the outcome!\n\nASL Starter Kit Expansion Pack #1 contains:\n- 3 8&quot;x22&quot; geomorphic mapboards (q,r,s)\n- 1 sheet of 1/2&quot; counters\n- 1 sheet of 5/8&quot; counters\n- Fully illustrated (in color) rulebook incorporating all known errata\n- New charts (QRDC, etc.)\n- 8 new scenarios!","torrent":{"xt":"urn:btih:70e8091e990d1f9b4e29322c3caa0e79a642d3ef","amp;dn":"ASL+Starter+Kit+Expansion+Pack+%231","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"70e8091e990d1f9b4e29322c3caa0e79a642d3ef","infoHashBuffer":{"type":"Buffer","data":[112,232,9,30,153,13,31,155,78,41,50,44,60,170,14,121,166,66,211,239]},"announce":[],"urlList":[]}}