{"title":"Klezmer Pioneers: European and American Recordings 1905-1952","uid":5978753,"size":73026730,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:71c97664ab6abff389d5f936b0fe56d345d353c3&amp;dn=Klezmer+Pioneers%3A+European+and+American+Recordings+1905-1952&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ill88eagle","files":-1,"time":1290527304,"description":"Klezmer Pioneers: European and American Recordings 1905-1952\nMP3 128 kbps\n\nFrom Amazon.com:\nSpirit triumphs handily over fidelity on this generous, informatively annotated package. And with a klezmer revival in full swing, it's fascinating to return as near as possible to its source to listen to what the Eastern European klezmorim thought the Yiddish community ought to hear on the first 78s full of this vital and joyous music. What first hits you are the unexpectedly sophisticated arrangements of the several klezmer orchestras represented here. The ensembles looked to American ragtime, jazz, and even military marches for inspiration after crossing the ocean. Vaudeville provided an excuse to add exotic theatrical elements to klezmer, while clarinets (played by virtuosos Dave Tarras and Naftule Brandwein, among others) gradually replaced fiddles with the advent of the swing era. Treading a fascinating balance between folk music and jazz, this vintage music seems to thrive in a world all its own. --Richard Gehr\n\nFrom Sonicnet.com \nThis is the first modern studio recording of the klezmer music of Europe, performed with the original European instrumentation - first violin, cimbal (hammer dulcimer), sekund (contra-fiddle), and bass. Half of these compositions were recorded here for the first time. This CD features haunting instrumentals by the great klezmer composers of the 19th century, such as Mikhl Guzikow and Avram Moyshe Kholodenko. The Khevrisa ensemble is led by Steven Greenman (violin) and Zev Feldman (cimbal ), and includes some of the finest musicians of the contemporary klezmer revival - Alicia Svigals (sekund), Michael Alpert (sekund), and Stuart Brotman (bass). 36-page booklet contains extensive notes, bibliography, glossary. 70 minutes. &quot;.It (Khevrisa: European Klezmer Music) is an essential album if one wants to understand where klezmer music comes from.&quot; -Jewish Herald Voice, Jewish Jukebox&quot; &quot;.The passion of Khevrisa shines through in impassioned playing that illuminates an otherwise underlit piece of the past.&quot; \n\nTracklist:\n\n1. The Rabbi's Dance - Art Shryer's Orchestra\n2. Revery Dream-Jewish Fantasy - Art Shryer's Yiddish Orchestra\n3. From The Wedding - Abe Elenkrig's Yidishe Orchestra\n4. A Homey Bulgar - Sam Musiker And His Orchestra\n5. How Beautiful - Belf's Rumanian Orchestra\n6. Greek Dance - Mishka Tsiganoff\n7. Liebes Tanz - Orchestra Romaneasca (Abe Schwartz's Orchestra)\n8. A Dance For Everyone - Abe Schwartz's Orchestra\n9. The Bridal Serenade And Congradulations - Joseph Cherniavsky And His Yiddish-American Jazz Band\n10. The Chasidium Visit The Rabbi - Kandel's Orchestra\n11. Doina Un Sirba - Mihal Viteazul\n12. One Glance At You - Alexander Olshanetsky Und Zein Orkestrer\n13. Dance A Freilachs - Abe Schwartz's Orchestra\n14. Orientalishe Motive II - Josef Solinski\n15. A Lively Honga - Kandel's Orchestra\n16. Odessa-Burlgar - Mishka Ziganoff\n17. The Hot One-Tater Dance - Naftule Brandwein's Orchestrer\n18. The Hassid From Bessarabia - Isreal J. Hochman's Jewish Orchestra\n19. Doina - Joseph Moskowitz\n20. Bessarabian Hora - Belf's Rumanian Orchestra\n21. Dancing With The Bride - Art Shryer's Modern Jewish Orchestra\n22. The Disciple Of The Rabbi From Trisk - Dave Terras\n23. Memories Of Kirshenev - Abe Katzman's Bessarabian Orchestra\n24. Uncle Max's Bulgar - Sam Musiker And His Orchestra ","torrent":{"xt":"urn:btih:71c97664ab6abff389d5f936b0fe56d345d353c3","amp;dn":"Klezmer+Pioneers%3A+European+and+American+Recordings+1905-1952","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"71c97664ab6abff389d5f936b0fe56d345d353c3","infoHashBuffer":{"type":"Buffer","data":[113,201,118,100,171,106,191,243,137,213,249,54,176,254,86,211,69,211,83,195]},"announce":[],"urlList":[]}}