{"title":"Diary of a Grumpy Old Git - Tim Collins","uid":14513529,"size":3529678,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:71e4511ee14f204be9f4583a87da0f68a809e878&amp;dn=Diary+of+a+Grumpy+Old+Git+-+Tim+Collins&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1462314309,"description":"If Adrian Mole had grown up to be a grumpy old git who had to cope with failed marriage and a life-sucking job, and worse, whose colleagues actually thought he was a miserable old git, he might be a bit like Dave Cross. Diary of a Grumpy Old Git is the laugh-out-loud diary of Dave Cross, a man who thought he was reasonably cheerful until someone from his office bought him a &quot;Grumpy Old Man&quot; diary for Christmas. Determined to prove them wrong, he resolves to be positive for an entire year. But it's not easy when your wife has run off with an estate agent called Brad and you've got a young, ambitious new boss who is determined to make you actually do some work. Add to this the everyday horrors of public transport, shopping, technology, popular culture and dating, and a sunny outlook is too much to ask. But with his 50th birthday fast approaching, Dave is determined to make his life less shambolic. Fantastically witty and painfully accurate, Diary of a Grumpy Old Git will appeal to anyone, grumpy old git or otherwise","torrent":{"xt":"urn:btih:71e4511ee14f204be9f4583a87da0f68a809e878","amp;dn":"Diary+of+a+Grumpy+Old+Git+-+Tim+Collins","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"71e4511ee14f204be9f4583a87da0f68a809e878","infoHashBuffer":{"type":"Buffer","data":[113,228,81,30,225,79,32,75,233,244,88,58,135,218,15,104,168,9,232,120]},"announce":[],"urlList":[]}}