{"title":"The neverending story 3 (NLsubs) 2Lions-Team","uid":5888126,"size":4470203680,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:745e83759211f9127f00ab35ccea678a02e826f1&amp;dn=The+neverending+story+3+%28NLsubs%29+2Lions-Team&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"juutje","files":-1,"time":1287134394,"description":"The NeverEnding Story III\nDuitsland / Verenigde Staten\nAvontuur / Fantasy\n95 minuten\n\ngeregisseerd door Peter MacDonald\nmet Jason James Richter, Melody Kay en Jack Black\n\nDutch:\n\nBastian heeft er altijd van gedroomd een broertje of zusje te hebben, en als zijn vader eindelijk hetrouwt, gaat zijn wens in vervulling. De nieuwe vrouw van zijn vader heeft namelijk een dochtertje, en Bastian en Nicole kunnen het samen uitstekend vinden. Op een dag wordt Nicole echter vreselijk gepest door een groepje kwajongens, en als het tweetal de boekenwinkel van Karl Konrad Koreander invluchten, ontdekken ze het boek met het Ondeindige Verhaal en vluchten ze naar Fantasia. Helaas komt het boek per toeval in de handen van bendeleider Slip terecht, die eveneens naar Fantasia reist en daar met opzet de hele boel op stelten zet.\n\nEnglish:\n\nWhile the first two movies were based on the novel by Michael Ende, this one is only based &quot;on the characters.&quot; It transfers Fantasia into the &quot;real&quot; world. Bastian's dream to get a sibling becomes true when his father re-marries, but soon he has trouble with his new step sister Nicole and with a gang of school bullies, the Nasties. Hiding in the school library, Bastian finds his favorite book of THE NEVERENDING STORY, where it is later found by Slip, the gang leader. The latter recognizes the power of the book and begins to form Fantasia after his bad intentions. When the chaos becomes worse the Child-like Empress requests Bastian to move back to the real world, get the book back and save Fantasia. Accidentally some Fantasia characters travel with him to reality, but get lost in different places. Meanwhile Slip and the other Nasties spread anarchy. Finally, Bastian gets support from Nicole, who begins to believe in the power of Fantasia. Together they are able to solve the situation and become friends.\n\nBron : originele DVD's\nFormaat:  DVD5\nBeeldformaat: 16:9\nAudio: DD\nMenu: Ja\nExtra's:Nee\nCover &amp; label : Ja\nTaalkeuze: Engels\nOndertiteling: Nederlands\n\n \nGenre : Fantasiefilm\n \nWeblink : http://www.moviemeter.nl/film/1475 \nWeblink : http://www.imdb.com/title/tt0110647/\n\n\n\n*****************************************\n\nBrought to you by Juultje\n2Lions Team\n\nmeer zien??\nKom dan eens kijken op ons forum \n\n                          &lt;a href=&quot;\nhttp://www.2lions-site.nl/index.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.2lions-site.nl/index.php&lt;/a&gt;\n\n2Lions the site to be for all your Dutch MOVIES and more\n\n\nDON T HIT AND RUN Niet gelijk afhaken als de FILM binnen is blijf seeden. \n\nDon`t quit after you finished the download, but keep seeding\n\nPlease check our site !!!\nNEW SITE &lt;a href=&quot;\nhttp://www.2lions-site.nl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.2lions-site.nl&lt;/a&gt; \n\n*****************************************\nThere are fake torrents from uploaders who use our team name.\nThose are not ours, or members from our team.\nWe 2Lions-Team are not responsible for the fake posts on our name\n\nWij 2Lions-Team zijn niet verantwoordelijk voor die zieke FAKE posten die op onze naam worden gedaan\n\nPlease check our site !!!\n\nto the fakers , get a life !!!\n\t\t\n\n\n\n\n\n","torrent":{"xt":"urn:btih:745e83759211f9127f00ab35ccea678a02e826f1","amp;dn":"The+neverending+story+3+%28NLsubs%29+2Lions-Team","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"745e83759211f9127f00ab35ccea678a02e826f1","infoHashBuffer":{"type":"Buffer","data":[116,94,131,117,146,17,249,18,127,0,171,53,204,234,103,138,2,232,38,241]},"announce":[],"urlList":[]}}