{"title":"EnigmaT Set Rips { Cuts } - July 11th, 2014","uid":10526847,"size":938260438,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:74db9a5736e7a255f7defc9c9fc6c094260ddfb8&amp;dn=EnigmaT+Set+Rips+%7B+Cuts+%7D+-+July+11th%2C+2014&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"EnigmaT","files":104,"time":1405055909,"description":"Adam Sobiech - Above The Sky (Napalm Remix) (Cut From Jerom Set)-enTc\nAirwave Vs Rising Star - Sunspot (Angel Ace 2014 Rework) (Cut From Angel Ace Set)-enTc\nAlexander Popov - Eternal Flame (ASOT 671 Rip)-enTc\nAlfida - Alisha (Fire Flame &amp; Andy Horizont Remix) (Cut From Young Free Set)-enTc\nAlfida - B.B. Habibi (THMoy Remix) (Cut From Young Free Set)-enTc\nAmir Hussain - Presence of Mind (Cut From A&amp;F Set)-enTc\nAndromedha - Azure (Darragh Burke Remix) (Cut From Tucandeo Set)-enTc\naran - Golden Yellow (Cut From Kenji Set)-enTc\naran - Golden Yellow (Nhato Remix) (Cut From Nhato Set)-enTc\nAruna - Start a Fire (Mr. Fijiwiji Remix) (Cut From Tritonal Set)-enTc\nBastian Salbart - Don't Forget To Remember (Cut From Feel Set)-enTc\nBeatsole - Headwaters (Cut From MIKE Set)-enTc\nBluSkay - Colours (Original Mix) (Cut From tranzLift Set)-enTc\nCiro Visone - Waiting You (Original Mix) (Cut From Angel Ace Set)-enTc\nColdplay - A Sky Full Of Stars (Oliver Heldens Remix) (-SHORT- Cut From W&amp;W Set)-enTc\nColdplay - A Sky Full Of Stars (Paul Webster Bootleg) (ASOT 671 Rip)-enTc\nConstant Drift feat. Tanya Walker - Deeper (Constant Drift Club Mix) (Cut From Young Free Set)-enTc\nDany Dazano - Outerself (Original Mix) (Cut From Romel Set)-enTc\nDash Berlin &amp; Jay Cosmic feat. Collin McLoughlin - Here Tonight (Carita La Nina Remix) (Cut From W&amp;W Set)-enTc\nDash Berlin &amp; Jay Cosmic feat. Collin Mcoughlin - Here Tonight (Lush &amp; Simon Remix) (ASOT 671 Rip)-enTc\nDenise Rivera &amp; Dennis Pedersen - For You To Wake Up (UDM Remix) (Cut From Allen &amp; Envy Set)-enTc\nDennis Cartier - OMFG (-SHORT- Cut From W&amp;W Set)-enTc\nDennis Sheperd feat. Chloe Langley - Bring You Home (Original Mix) (Cut From Sheperd Set)-enTc\nDisco Fries feat. Niko The Kid - The Light (Club Mix) (Cut From Armada Set)-enTc\nDisco Fries feat. Niko the Kid - The Light (Original Mix) (Cut From Tritonal Set)-enTc\nDJ Kim - Jetlag (Space Raven 2014 Remix) (Cut From Romel Set)-enTc\nDJ Noise - Strings Of Infinity (Matti Mars Remix) (Cut From Pledger Set)-enTc\nDon Diablo - AnyTime (Cut From W&amp;W Set)-enTc\nDriftmoon - The Inquisitor (Original Mix) (Cut From Feel Set)-enTc\nDuke Dumont featuring Jax Jones - I Got U (Markus Schulz Big Room Reconstruction) (GDJB Rip)-enTc\nFergie &amp; Sadrian - Just Coming (Cut From Bluehawk Set)-enTc\nFerrin &amp; Morris feat Hysteria! - Changes (Dub Mix) (Cut From Angel Ace Set)-enTc\nFisherman &amp; Hawkins - Underworld (GDJB Rip)-enTc\nFocus One - Without You (Original Mix) (Cut From Feel Set)-enTc\nGiuseppe Ottaviani - Liverpool (Extended Mix) (Cut From Jem Lang Set)-enTc\nHardwell - Spaceman (Nikolarn feat. Joey Acero Orchestral Intro Booty) (Cut From Purple Stories Set)-enTc\nHazem Beltagui feat. Jennifer Rene - The Wonder (Bjorn Akesson Remix) (ASOT 671 Rip)-enTc\nHazem Beltagui Feat. Jennifer Rene - The Wonder (Bjorn Akesson Remix) (Cut From A&amp;F Set)-enTc\nJessy Feat. Ward Palmen - Sweet Moments (Romeo Quenn Remix) (Cut From Pledger Set)-enTc\nJohn Askew - The Witch (Mark Van Ray Remix) (Cut From Allen &amp; Envy Set)-enTc\nJon Medina - The Joy Of Living (Cut From Boom Jinx Set)-enTc\nJoonas Hahmo - Diamond Stash (Original Mix) (Cut From Feel Set)-enTc\nKhazm - Waiting For (Lirrik Remix) (Cut From Feel Set)-enTc\nKheiro &amp; Medi Feat. Danny Claire - When You're Home (Cut From A&amp;F Set)-enTc\nKhoMha - Elektrikute (GDJB Rip)-enTc\nKinetica - Acid Angel (Liam Nicklin Remix) (Cut From Allen &amp; Envy Set)-enTc\nKinetica - Acid Angel (Original Mix) (Cut From Suzy Set)-enTc\nKyohei Akagawa - Abendrot (Nhato Remix) (Cut From Nhato Set)-enTc\nLana Del Rey - Ultraviolence (Nurettin Colak Remix) (Cut From Faruk Set)-enTc\nLana Del Rey - Ultraviolence (Nurettin Colak Remix) (Cut From W&amp;W Set)-enTc\nLele Troniq &amp; Bilal El Aly - Synthetizers (Cut From Pledger Set)-enTc\nLeon 78 - Get Down, Get High! (Club Mix) (Cut From Vintisky Set)-enTc\nM.E.D.O. - Burning (Eddie Lung Remix) (Cut From Romel Set)-enTc\nM.I.K.E. Push - ID -July 2014- (Cut From MIKE Set)-enTc\nManuel Rocca - Neblina (Cut From A&amp;F Set)-enTc\nMario Ayuda &amp; Tiff Lacey - Suncatcher (Cut From Pledger Set)-enTc\nMarkus Schulz &amp; Venom One feat. Chris Madin - Revolution (Mike Shiver Remix) (Cut From Faruk Set)-enTc\nMarkus Schulz - Remember This (Mark Sherry Remix) (GDJB Rip)-enTc\nMarten Horger &amp; Sangers and Ra - Out Of Our Minds (Club Mix) (Cut From Claessen Set)-enTc\nMassai One - Supersphere (Cut From MIKE Set)-enTc\nMatt Holiday - Frigid (Cut From Bluehawk Set)-enTc\nMauro Picotto - Iguana (Organ Donors Subground Rework) (Cut From Pledger Set)-enTc\nMemoryLoss - Doppler Effect (Cut From Pledger Set)-enTc\nMhammed El Alami &amp; Illitheas - Horizon (Cut From Bjorn Set)-enTc\nMonoverse &amp; Adam Shornys - Recoil (Cut From Pledger Set)-enTc\nMonoverse &amp; Adam Shornys - Recoil (Original Mix) (Cut From Bjorn Set)-enTc\nNicholson - Electric (Original Mix) (Cut From Kaeno Set)-enTc\nNoise Force - Hope in Sorrow (Cut From Uplift Set)-enTc\nOzo Effy - Ria (Eximinds Remix) (Cut From Bjorn Set)-enTc\nPhil Dinner - Talk To Me (The Cloudy Day Vocal Remix) (Cut From tranzLift Set)-enTc\nPhiller Music - Lost World (Silvernova Remix) (Cut From Allen &amp; Envy Set)-enTc\nPurple Rays - Tranceformation (Cut From Uplift Set)-enTc\nRageVision - No Fear (Original Mix) (Cut From Above Clouds Set)-enTc\nRaphael Mayers - Mysterious Coast (AlexZideyn Remix) (Cut From Romel Set)-enTc\nReOrder &amp; Darren Porter - The Void (ASOT 671 Rip)-enTc\nSebastian Brushwood Feat. Anthya - Lead Me On (Dub Mix) (Cut From Angel Ace Set)-enTc\nSergy Casttle - Night Vision (Original Mix) (Cut From MIKE Set)-enTc\nSetrise feat. Saskia Kabel - Behind These Walls (Cut From Pledger Set)-enTc\nShanahan feat. Jackie Mohr &amp; Vegas - Only You (Original Mix) (Cut From Armada Set)-enTc\nSolarstone &amp; Orkidea - Slowmotion III (Markus Schulz Big Room Reconstruction) (GDJB Rip)-enTc\nSolis &amp; Sean Truby - Racoon (Chris Metcalfe Remix) (Cut From Lazarus Set)-enTc\nStoneface &amp; Terminal - Alive (ASOT 671 Rip)-enTc\nStoneface &amp; Terminal - Alive (Cut From A&amp;F Set)-enTc\nSunset feat. Diana Leah - In Your Dreams (Original Mix) (Cut From Allen &amp; Envy Set)-enTc\nTasso Feat. Eliza Doe - Crystal Clear (Dub Mix) (Cut From Angel Ace Set)-enTc\nTasso feat. Eliza Doe - Crystal Clear (Dub Mix) (Cut From tranzLift Set)-enTc\nThe Brig - Never Stop (Cut From Nhato Set)-enTc\nTillmann Uhrmacher - On The Run (Dreamy &amp; Kinetica Remake) (Cut From Angel Ace Set)-enTc\nToucan, Mauricio Lage feat. Ellie Ka - By My Side (Original Mix) (Cut From Armada Set)-enTc\nTucandeo &amp; Esmee Bor Stotijn - Northern Lights (Original Mix) (Cut From Tucandeo Set)-enTc\nTucandeo feat. Sopheary - Let Me In (Sensetive5 Remix) (Cut From Tucandeo Set)-enTc\nUDM - Entrance To Eternity (Cut From A&amp;F Set)-enTc\nUDM - Entrance To Eternity (Original Mix) (Cut From tranzLift Set)-enTc\nUla - The Six Paths of Pain (Hypaethrame Remix) (Cut From Kaeno Set)-enTc\nUla - The Six Paths of Pain (Original Mix) (Cut From tranzLift Set)-enTc\nVee Zed - Love (Soarsweep Remix) (Cut From Super8 Set)-enTc\nVenom One feat. Jon Mendelsohn - Earthquake (Purple Stories Remix) (Set Rip)-enTc\nVeselin Tasev - Need You (Uplifting Mix) (Cut From Tasev Set)-enTc\nVictoria Mussi &amp; Zonik The Flame feat. Priscila Vega - Cloudy Days (Takaki Matsuda Remix) (Set Rip)-enTc\nVlad Markus - Follow You (Hypaethrame Remix) (Cut From Above Clouds Set)-enTc\nVolmax - Phospene (Original Mix) (Cut From Sheperd Set)-enTc\nYakooza - Cocaine (Scot Project Remix - Kaeno 2014 Edit) (Cut From Kaeno Set)-enTc\nYusef Kifah - Dinotauria (Abandoned Rainbow Remix) (Cut From tranzLift Set)-enTc\nYves de Lacroix feat. Marell - Destroyves (Purple Stories Remix) (Cut From Pledger Set)-enTc\n","torrent":{"xt":"urn:btih:74db9a5736e7a255f7defc9c9fc6c094260ddfb8","amp;dn":"EnigmaT+Set+Rips+%7B+Cuts+%7D+-+July+11th%2C+2014","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"74db9a5736e7a255f7defc9c9fc6c094260ddfb8","infoHashBuffer":{"type":"Buffer","data":[116,219,154,87,54,231,162,85,247,222,252,156,159,198,192,148,38,13,223,184]},"announce":[],"urlList":[]}}