{"title":"Mind, Matter and Quantum Mechanics, 3rd Edition (The Frontiers C","uid":4724610,"size":2606392,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7522d8843d5ca55eba0d3b341b44c779d2d76be4&amp;dn=Mind%2C+Matter+and+Quantum+Mechanics%2C+3rd+Edition+%28The+Frontiers+C&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"VasiaZozulia","files":1,"time":1234690277,"description":"&quot;Scientists other than quantum physicists often fail to comprehend the enormity of the conceptual change wrought by quantum theory in our basic conception of the nature of matter,&quot; writes Henry Stapp. Stapp is a leading quantum physicist who has given particularly careful thought to the implications of the theory that lies at the heart of modern physics. In this book, which contains several of his key papers as well as new material, he focuses on the problem of consciousness and explains how quantum mechanics allows causally effective conscious thought to be combined in a natural way with the physical brain made of neurons and atoms. The book is divided into four sections. The first consists of an extended introduction. Key foundational and somewhat more technical papers are included in the second part, together with a clear exposition of the &quot;orthodox&quot; interpretation of quantum mechanics. The third part addresses, in a non-technical fashion, the implications of the theory for some of the most profound questions that mankind has contemplated: How does the world come to be just what it is and not something else? How should humans view themselves in a quantum universe? What will be the impact on society of the revised scientific image of the nature of man? The final part contains a mathematical appendix for the specialist and a glossary of important terms and ideas for the interested layman. This third edition has been significantly expanded with two new chapters covering the author's most recent work. ","torrent":{"xt":"urn:btih:7522d8843d5ca55eba0d3b341b44c779d2d76be4","amp;dn":"Mind%2C+Matter+and+Quantum+Mechanics%2C+3rd+Edition+%28The+Frontiers+C","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7522d8843d5ca55eba0d3b341b44c779d2d76be4","infoHashBuffer":{"type":"Buffer","data":[117,34,216,132,61,92,165,94,186,13,59,52,27,68,199,121,210,215,107,228]},"announce":[],"urlList":[]}}