{"title":"Mrs, Presumed Dead - Simon Brett  (Unabridged)","uid":6029178,"size":78856521,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:766f2dcdf46d59e8a3eeffeeefe62bacde2c9a00&amp;dn=Mrs%2C+Presumed+Dead+-+Simon+Brett++%28Unabridged%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Lucy1948","files":14,"time":1292013706,"description":"Unabridged and read by Simon Brett. 5 hours 28 mins duration.(Fhg CBR 32 kbit/s 22050 Hz Mono)\n\n\n\nBritish author Brett introduced Mrs. Melita Pargeter in A Nice Class of Corpse . With her &quot;armoury&quot; of mink coats, an oenophile's palate and her weakness for an occasional weekend at the Savoy, the widow Pargeter brings a distinct touch of class to the sleuthing scene. It is 18 months since the death of Mr. Pargeter (whose mysterious and lucrative business dealings left his wife with devoted contacts among such shady characters as &quot;Rewind&quot; Wilson, in the used car business, and Keyhole Crabbe), and Mrs. P. has just moved to a new home in a small development of upwardly mobile families in Surrey. But she quickly determines that something decidedly fishy has happened to the former mistress of the house, Theresa Cotton. Remaining quintessentially ladylike, Mrs. Pargeter--dare we say it?--snoops, uncovering clues that lead to Theresa's body and point the finger of guilt at any one of the other women of the houses in Smithy's Loam. Further investigation leads to a suspicious religious organization, The Church of Utter Simplicity, to the ruined career of Rod Cotton, and to real danger for Mrs. P. at the hands of a woman who has killed before. As with his Charles Paris stories, Brett here delivers solid mystery, deft characterization and delightful entertainment.","torrent":{"xt":"urn:btih:766f2dcdf46d59e8a3eeffeeefe62bacde2c9a00","amp;dn":"Mrs%2C+Presumed+Dead+-+Simon+Brett++%28Unabridged%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"766f2dcdf46d59e8a3eeffeeefe62bacde2c9a00","infoHashBuffer":{"type":"Buffer","data":[118,111,45,205,244,109,89,232,163,238,255,238,239,230,43,172,222,44,154,0]},"announce":[],"urlList":[]}}