{"title":"{TeamSkeet - TeensLoveAnal} Dakota Skye - Anal Superstar (27 Ma","uid":14706556,"size":640458312,"categoryP":"porn","categoryS":"other","magnet":"?xt=urn:btih:76b3c8d9bf37f9ea92c54588757a2b3932659470&amp;dn=+%7BTeamSkeet+-+TeensLoveAnal%7D+Dakota+Skye+-+Anal+Superstar+%2827+Ma&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"porn4u","files":1,"time":1464367200,"description":"{TeamSkeet - TeensLoveAnal} Dakota Skye - Anal Superstar (27 May 2016) 540p\r\n\r\n\r\n\r\nGeneral info:\r\n\r\nSize: 610 Mb,\r\nDuration: 00: 29: 40,\r\nStreams: 2,\r\nFull bitrate: 0 kb/s\r\nVideo: H264, 960x540, 29.97 fps\r\nAudio: AAC, STEREO, 48 kHz\r\n\r\nTags:\r\n\r\n, 18, 18 Year, Adorable, Big Ass, Big Dicks, Blonde, Booty, Bubble Butt, Butt, Casual, Caucasian, Cowgirl, Crazy, Cute, Doggystyle, Easy, Facial, Handjob, Hardcore, Indoor, Missionary, Natural Tits, No Condom, Petite, Reality, Rough Sex, Sexy, Shaved Pussy, Short, Short Hair, Skinny, Slim, Slutty, Straight, Teen, Tiny, White, Wild,\r\n\r\nScreenshoot:\r\n \nhttp://imgdone.com/viewer.php?file=33591192298724843645.jpg \r\n\r\nShes back! The incredibly itsy bitsy Dakota Skye has finally returned for a Team Skeet shoot. Its been a long time since we saw her, back when her career had just started. Since then, she has been a top grossing star on the circuit, doing plenty of shoots, but never forgetting where she came from. She owes a lot of credit to Team Skeet, but we will consider her debt to be settled after this astounding anal shoot. Off the bat, she admits its something she lusts for. She gets warmed up with a hot pink dildo, which slides in and out of her perfect asshole with ease. You can tell shes a pro. Once she lubes up or studs cock with some saliva, that dick is ready for some deep anal insertion. Dakota is super vocal and her facial expressions show us how much she truly digs getting butt fucked. Her being super flexible gives her the title of an anal acrobat, being able to contort into anal positions one would not think is even possible until you see it. Although shes totally about anal creampies, she would always rather suck cum down her stomach. It supposedly does something for the digestive system and makes hardcore anal that much more of a breeze. Keep an eye out for her upcoming novel, BACKSTAGE PASSES: A GUIDE TO ALTERNATIVE SEX","torrent":{"xt":"urn:btih:76b3c8d9bf37f9ea92c54588757a2b3932659470","amp;dn":"+%7BTeamSkeet+-+TeensLoveAnal%7D+Dakota+Skye+-+Anal+Superstar+%2827+Ma","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"76b3c8d9bf37f9ea92c54588757a2b3932659470","infoHashBuffer":{"type":"Buffer","data":[118,179,200,217,191,55,249,234,146,197,69,136,117,122,43,57,50,101,148,112]},"announce":[],"urlList":[]}}