{"title":"WW2 Battles DVD 7 Arnhem NL Subs","uid":9046651,"size":4208427008,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:7711d385a5b96a5aa8183873f2f20adc6438ed64&amp;dn=WW2+Battles+DVD+7+Arnhem+NL+Subs&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mpkeuter","files":1,"time":1381770155,"description":"September 1944\n\nIn September 1944, after the victorious end of the Normandy campaign, Field Marshal Bernard Montgomery devised a daring operation to open the way to the Ruhr by seizing a bridgehead north of the Rhine, at Arnhem. On September 17, Operation Market, the largest airborne and glider operation in history (five thousand aircraft) was carried out by three Allied airborne divisions. Operation Garden was the ground side in which the Thirtieth (British) Corps was to link up with the British First Airborne at Arnhem by thrusting north along a narrow corridor opened by the U.S. Eighty-second and 101st Airborne Divisions. Then, the remainder of British Second Army would rapidly assault the Ruhr, thus hastening the collapse of the Third Reich and likely ending the war in 1944.\n\nAlthough the airborne landings initially went well, Allied intelligence had failed to heed reports from the Dutch underground that a German panzer corps was bivouacked nearby. The Second Parachute Battalion was the only First Airborne unit to reach the key Arnhem bridge over the Rhine. The remainder of the division was soon pinned down by the panzer corps in and around Arnhem.\n\nCongestion and German resistance along the single narrow road to Nijmegen and Arnhem delayed the British ground advance. The attempt to relieve Arnhem failed even though Lieutenant Colonel John Frost's gallant paratroopers held the northern end of the Arnhem bridge against the Ninth SS Panzer Division for four days before finally being overrun and captured.\n\nOf the ten thousand men who had landed at Arnhem, fourteen hundred were killed and over six thousand captured; only twenty-four hundred paratroopers safely crossed to the south bank of the Rhine in small rubber boats.\n\nMarket-Garden was a military disaster during which the ground force was unable to breach the River Waal at Nijmegen in time to establish a bridgehead north of the Rhine in what became popularly known as &quot;a bridge too far.&quot;\n\nAudio - English\nSubs - NL","torrent":{"xt":"urn:btih:7711d385a5b96a5aa8183873f2f20adc6438ed64","amp;dn":"WW2+Battles+DVD+7+Arnhem+NL+Subs","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7711d385a5b96a5aa8183873f2f20adc6438ed64","infoHashBuffer":{"type":"Buffer","data":[119,17,211,133,165,185,106,90,168,24,56,115,242,242,10,220,100,56,237,100]},"announce":[],"urlList":[]}}