{"title":"A Dictionary Of English Folklore By Jacqueline Simpson, Steve Ro","uid":9328254,"size":3452453,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7721674232475e2619f1d02ccd38aa0b92f93beb&amp;dn=A+Dictionary+Of+English+Folklore+By+Jacqueline+Simpson%2C+Steve+Ro&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"The_Abee","files":3,"time":1386682910,"description":"A Dictionary Of English Folklore By Jacqueline Simpson, Steve Roud ABEE\n__\n &lt;a href=&quot;\nhttp://beeimg.com/images/o29917711021.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://beeimg.com/images/o29917711021.jpg&lt;/a&gt;\n\n[Oxford University Press]\n\nAbout:\n__\n\nWith 1250 entries ranging from dragons to Mother Goose, May Day to Michaelmas, this enchanting dictionary unfurls the colorful history behind the holidays, customs, legends, and superstitious beliefs of England.\nEver wonder why we kiss under the mistletoe at Christmas or think a rabbit's foot brings good luck? Two folklore authorities provide reliable and often surprising answers to these and other curiosities that have shaped daily life in England for centuries. They explore the festivals and past celebrations of the English calendar, from St. Andrews Day and its tradition of drunkenness and cross-dressing to Twelfth Night and its king and queen cake. They also provide concise portraits of real and legendary characters that populate the public memory, including Robin Hood, The Brothers Grimm, Lady Godiva, Puck, and The Sandman. Fairies, mermaids, hobgoblins, and changelings are but a few of the supernatural forces surveyed here. However, as folklore encompasses the mundane as well as the fantastic, numerous other entries illuminate the significance of colors, numbers, flowers, animals, and household objects. Learn the curious history behind our distrust of the &quot;black sheep,&quot; popular credence in &quot;wishbone&quot; wishes, folk cures for nosebleeds and warts, and persistent old wives' tales. In addition to ancient and medieval folklore, you will find many contemporary urban legends, e.g., the vanishing hitchhiker--a spooky figure seen ominously by travelers in Britain and the United States--and the Tooth Fairy. \nAn entertaining resource, The Dictionary of English Folklore will be a fascinating companion for readers of English literature, history, cultural studies, and fantasy.\n\nHardcover: 411 pages\nPublisher: Oxford University Press, USA; First Edition edition (November 2, 2000)\nLanguage: English\nISBN-10: 019210019X\nISBN-13: 978-0192100191\n\n\nSee a tiny collection of my torrents. And, find your favorite books there.  ;)\n_____________________________________\n                                                                                                                                                          &lt;a href=&quot;\nhttp://thepiratebay.se/user/The_Abee/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/The_Abee/&lt;/a&gt;\n_____________________________________\n\n\n `~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~`\n   SEED PLEASE , LET OTHERS GET IT TOO. \n `~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~`\n \n\n\n                                                      (:__Abee \t\t","torrent":{"xt":"urn:btih:7721674232475e2619f1d02ccd38aa0b92f93beb","amp;dn":"A+Dictionary+Of+English+Folklore+By+Jacqueline+Simpson%2C+Steve+Ro","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7721674232475e2619f1d02ccd38aa0b92f93beb","infoHashBuffer":{"type":"Buffer","data":[119,33,103,66,50,71,94,38,25,241,208,44,205,56,170,11,146,249,59,235]},"announce":[],"urlList":[]}}