{"title":"Underbelly S2 E12      Oh, Lucky Man","uid":4871296,"size":367053336,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:773e3d95724fc7762e1a19ae80f2f6bffcd00f2a&amp;dn=Underbelly+S2+E12++++++Oh%2C+Lucky+Man&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bobo66","files":-1,"time":1240854481,"description":"Underbelly S2 E12  Oh, Lucky Man\n\n\nWith Kiwi Terry on trial in England and Aussie Bob on the run abroad, the &quot;Mr Asia&quot; drug syndicate has collapsed, which means the Australian heroin business is up for grabs. And there are plenty of people ready and willing to plug the gaps. It seems like every ambitious drug dealer, crime figure and corrupt cop is jostling for a slice of the lucrative drug market.\n\nSensing this unrest could be good for business, Chris &quot;Mr Rent-a-Kill&quot; Flannery moves to Sydney to take advantage of the expected demand for good hit men. He quickly makes friends with the people that matter, including the corrupt NSW detectives and the big man himself, George Freeman. Despite his obvious craziness and unsettling eagerness, there's no doubt Chris is a good hit man; maybe too good.\n\nIn the UK, Terry Clark is awaiting trial for the murder of Marty Johnstone. While on remand, he proposes to his lover, Karen Soich. Could it be that Terry has finally learned how to love? Meanwhile, Terry's former lover and 2IC Allison Dine faces the reality of testifying against Terry. But despite the support of the Australian Federal Police (AFP), she's terrified of coming face to face with Terry in an open courtroom.\n\nIn Ireland, Bob Trimbole uses his gift of the gab to dive into the illegal arms trade. But for all his industriousness, he's a sick man, one whose body clock is ticking loudly.\n\nBack in Australia, the AFP set up a sting operation to flush out the mole within its ranks. But while it means risking the success of a major drug bust, the operation has an unexpected benefit: the chance arrest of Frank Tizzoni, a confidante of Bob Trimbole. Tizzoni is willing to cut a deal to protect himself, and provides the AFP with information that cracks open the mystery of Donald Mackay's disappearance. ","torrent":{"xt":"urn:btih:773e3d95724fc7762e1a19ae80f2f6bffcd00f2a","amp;dn":"Underbelly+S2+E12++++++Oh%2C+Lucky+Man","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"773e3d95724fc7762e1a19ae80f2f6bffcd00f2a","infoHashBuffer":{"type":"Buffer","data":[119,62,61,149,114,79,199,118,46,26,25,174,128,242,246,191,252,208,15,42]},"announce":[],"urlList":[]}}