{"title":"Hunting Unlimited 1","uid":9464956,"size":229160960,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:7816fd469aff8877927ccc605edb38ef9f69f112&amp;dn=Hunting+Unlimited+1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"twfh","files":-1,"time":1389400906,"description":"Hunting Unlimited is a whole new twist on hunting games. With a focus on action and hunting skill, you will be tested in multiple scenarios from working your way in close to grazing deer for a good shot, to a heart-pounding, escape-with-your life attack by two Bull Moose.\n\n    Stalk your trophy prize--White-tailed Deer, Mule Deer, Elk, Moose and Brown (Grizzly) Bear.\n    Track your quarry through 175 different expeditions.\n    Spot your prey quickly, then get into position for the ultimate hunting action.\n    Explore the rugged terrain of Colorado, Texas, Alaska, Arizona and British Columbia, watching out for fast-forming rain and snowstorms.\n    Start each action-packed hunt with the right selection of 30+ firearms, bows and accessories.\n    Practice on moving targets and shatter bottles at the most advanced Target Range available\n    Witness ultra-realistic animal behaviours--watch rutting bucks chasing does, bears defending their kill, aggressive bulls challenging each other and more\n    Immerse yourself in the richest hunting environment yet, with slithering snakes, soaring eagles, wild wolves and buzzards, rabbits and other creatures\n    Stalk your quarry through the massive mountain ranges, streams, fields and forests\n    Use Hunting Unlimited's Animal Database to learn your prey's typical behaviours, scientific names, and observe each animal in their natural habitat\n    Each hunting mission drops you in the heart of the backwoods with a specific goal in mind and your prey nearby\n","torrent":{"xt":"urn:btih:7816fd469aff8877927ccc605edb38ef9f69f112","amp;dn":"Hunting+Unlimited+1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7816fd469aff8877927ccc605edb38ef9f69f112","infoHashBuffer":{"type":"Buffer","data":[120,22,253,70,154,255,136,119,146,124,204,96,94,219,56,239,159,105,241,18]},"announce":[],"urlList":[]}}