{"title":"Salubrious Living","uid":11824513,"size":1116028,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:782b4157c8e281afb719f142f1bf2d2a00b5e363&amp;dn=Salubrious+Living&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"HowdyDooDoo","files":2,"time":1429431332,"description":"The term &quot;Salubrious Living&quot; is a nomenclature I have coined as part and parcel of a very important facet of our religious creed and program set forth by the CHURCH OF THE CREATOR. The word &quot;salubrious&quot; comes from the Latin word &quot;salubris&quot; meaning &quot;healthy; wholesome; sound; useful; vigorous&quot;. Webster's dictionary defines the English derivative &quot;salubrious&quot; as: 1. favorable to, or promoting health or well being; invigorating; 2. spiritually wholesome; conducive to good results&quot;. It is in this context of fully promoting the health and well being of the White Race that we use this term in its true literal meaning.\n\nWe of the CHURCH OF THE CREATOR want to differentiate this term from &quot;Natural Hygiene popularly used for many decades by health practitioners devoted to this worthy art and science. The two practices are in large part similar, but we prefer to use the term Salubrious Living for two reasons (a) we go one step further than Natural Hygiene and include Eugenics as a vital part of our philosophy and, (b) as I explain in the WHITE MAN'S BIBLE, &quot;Natural Hygiene&quot; is not the best choice of words in describing what this subject is all about. Nevertheless we want to hereby acknowledge a large debt and deep gratitude to the study of Natural Hygiene and its illustrious contributors who, together, have built this most valuable of all health philosophies","torrent":{"xt":"urn:btih:782b4157c8e281afb719f142f1bf2d2a00b5e363","amp;dn":"Salubrious+Living","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"782b4157c8e281afb719f142f1bf2d2a00b5e363","infoHashBuffer":{"type":"Buffer","data":[120,43,65,87,200,226,129,175,183,25,241,66,241,191,45,42,0,181,227,99]},"announce":[],"urlList":[]}}