{"title":"Pietro Aretino - Sei giornate [PDF - Ita] [Tntvillage]","uid":5165688,"size":834342,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7830411cdb459df980d9c8addfb936c68d833494&amp;dn=Pietro+Aretino+-+Sei+giornate+%5BPDF+-+Ita%5D+%5BTntvillage%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"darayava","files":2,"time":1258394027,"description":"PIETRO ARETINO\n\nSEI GIORNATE\n\nRAGIONAMENTO DELLA NANNA E DELLA ANTONIA \nFATTO IN ROMA SOTTO UNA FICAIA \nCOMPOSTO DAL DIVINO ARETINO \nPER SUO CAPRICCIO \nA CORREZIONE DEI TRE STATI DELLE DONNE.\n\nNel Ragionamento Nanna, sollecitata da Antonia, rivive le vicende che l'hanno vista giovanissima monaca, la sua iniziazione sessuale in conformitÃƒÂ  ai costumi di gran parte delle monache; la madre la tolse poi dal convento, la maritÃƒÂ² a un uomo ricco ma poco accorto; Nanna si sofferma sui tradimenti delle mogli in generale e sui suoi, conclusi con l'uccisione del marito e la fuga a Roma; il suo ingresso nel mondo cortigiano, l'inserimento progressivo, proposto a magistero ideale, nell'ÃƒÂ©lite puttanesca.\n\n\nDIALOGO NEL QUALE LA NANNA IL PRIMO GIORNO \nINSEGNA A LA PIPPA SUA FIGLIUOLA \nA ESSER PUTTANA, \nNEL SECONDO GLI CONTA I TRADIMENTI \nCHE FANNO GLI UOMINI \nA LE MESCHINE CHE GLI CREDANO, \nNEL TERZO E ULTIMO \nLA NANNA E LA PIPPA SEDENDO NE L'ORTO \nASCOLTANO LA COMARE E LA BALIA \nCHE RAGIONANO DE LA RUFFIANIA.\n\nEsce di scena Antonia, entra Pippa, figlia di Nanna, che vuol diventare cortigiana: il Dialogo tratta dei segreti di quest'arte: discrezione, buone maniere, risolutezza; illustra le insidie degli uomini emblematizzata nella parodia della vicenda di Didone e Enea. Alla fine la Comare parla della ruffianÃƒÂ¬a e della accortezza su cui si fonda quest'arte complementare a quella delle puttane. In Pietro ÃƒÂ¨ l'esigenza di essere costantemente presente, di annullare ogni momento di pausa e di vuoto: di qui il poligrafismo, la sperimentazione continua, la varietÃƒÂ  di registro con l'alternanza di comico, epico, osceno, religioso, laudatorio, ricattatorio. La sua poetica, formulata nelle lettere e nei prologhi alle opere maggiori, ÃƒÂ¨ quella anticlassicista del ghiribizzo, del capriccio, l'ispirazione come furore, l'esaltazione del primato della natura e della sua imprevedibilitÃƒÂ  rispetto alla fissitÃƒÂ  dei canoni estetici. La scrittura di Pietro non ÃƒÂ¨ istintiva, ma possiede una stratificazione calcolata, gli effetti di naturalezza sono costruiti su una fitta rete di riferimenti ad altre opere, di citazioni, di calchi, in cui talvolta ÃƒÂ¨ la volontÃƒÂ  di dissacrare i modelli del passato.\n\n\n\nNato ad Arezzo nel 1492, Pietro Aretino non si denominÃƒÂ² mai col suo patronimico (del padre Luca, un calzolaio, sappiamo ben poco) ma sempre col nome della sua cittÃƒÂ .\n\nDella sua infanzia quasi nulla ÃƒÂ¨ noto, ma si sa che nell'adolescenza visse e a Perugia sia per frequentare l'universitÃƒÂ  sia per studiare pittura, e come pittore si firmÃƒÂ² per qualche tempo.\n\nNel 1517 fu a Roma, alla corte di Leone X; qui assistette al conclave del 1522, in occasione del quale compose delle pasquinate, ovvero dei poemetti satirici. Con l'ascesa al soglio pontificio del fiammingo Adriano VI (o, come lo chiamÃƒÂ² l'Aretino, la tedesca tigna) prese a viaggiare per la penisola e lavorÃƒÂ² a Mantova, al servizio di Giovanni dalle Bande Nere. TornÃƒÂ² a Roma nel '23 e, sotto papa Clemente VII, riacquistÃƒÂ² notorietÃƒÂ  e benevolenza popolare.\n\nIn questo periodo compone i Sonetti Lussuriosi, ispiratigli dalle tavole pornografiche di M. A. Raimondi sui disegni di Giulio Romano, e scrisse la Cortigiana. Ma l'invidia e la malevolenza del datario pontificio, mons. Giberti, interruppero questo periodo felice: alla fine del luglio 1525 viene accoltellato da un sicario del monsignore.\n\nL'Aretino lasciÃƒÂ² cosÃƒÂ¬ Roma e, dal 25 marzo 1527, si trasferÃƒÂ¬ a Venezia, la cittÃƒÂ  anticortigiana per eccellenza, l'unica, a detta di lui, totalmente opposta a Roma, sede di tutti i vizi. Qui scrisse e diede alle stampe la maggior parte delle sue opere e qui morÃƒÂ¬, probabilmente di apoplessia, il 21 ottobre 1556.\n\nAutore:  Pietro Aretino\nTitolo: Ragionamento\nCuratore: Angelo Romano\nAnno: 1534\nLingua:  Italiano \nGenere:  Ragionamenti\nNumero di pagine:  74\nDimensione del file:  352 KB su disco (351.964 byte)\nFormato del file:  Pdf\n\nAutore:  Pietro Aretino\nTitolo: Dialogo\nCuratore: Angelo Romano\nAnno: 1536\nLingua:  Italiano \nGenere:  Ragionamenti\nNumero di pagine:  109\nDimensione del file:  483 KB su disco (482.378 byte)\nFormato del file:  Pdf\n\nVisit http://www.tntvillage.scambioetico.org/","torrent":{"xt":"urn:btih:7830411cdb459df980d9c8addfb936c68d833494","amp;dn":"Pietro+Aretino+-+Sei+giornate+%5BPDF+-+Ita%5D+%5BTntvillage%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7830411cdb459df980d9c8addfb936c68d833494","infoHashBuffer":{"type":"Buffer","data":[120,48,65,28,219,69,157,249,128,217,200,173,223,185,54,198,141,131,52,148]},"announce":[],"urlList":[]}}