{"title":"The Obama Deception(real DVD ISO)","uid":4820608,"size":4596072924,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:7915e6bc60143f7cd014e6402569b00335392dd2&amp;dn=The+Obama+Deception%28real+DVD+ISO%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"ricintoxin","files":2,"time":1238752565,"description":"Alex Jones' The Obama Deception DVD @ http://www.hollywoodinsiders.net\n\nThis is the ISO from the real &quot;The Obama Deception&quot; DVD [4.3 Gig ISO]\n__\nThe Obama Deception is a hard-hitting film that completely destroys the myth that Barack Obama is working for the best interests of the American people. The Obama phenomenon is a hoax carefully crafted by the captains of the New World Order. He is being pushed as savior in an attempt to con the American people into accepting global slavery. We have reached a critical juncture in the New World Order's plans. It's not about Left or Right: it's about a One World Government. The international banks plan to loot the people of the United States and turn them into slaves on a Global Plantation.\n__\n\nhollywood insiders fallen angels dark stars illuminati movie music new world government order conspiracy occult free mason nwo 911 trade center symbolism synchronicity predictive programming alex jones freemason barack obama deception 2012 mayan calender alien reptilian ufo age anti christ satan devil economic dollar crisis collapse bank cia nsa federal reserve v vendetta alan moore bilderberg aleister clowley jewish vatican catholic church jesuit zionism zionist israel george bush wtc wtc7 jordan maxwell cooper jeff rense watt shape shifter martial law 666 9/11 terrorstorm endgame mark beast antichrist rfid subliminal messages daniel revelation enoch book they live demon dajjal islam nuclear american chicago bird flu michael tsarion bible jesus magic worship witchcraft tyranny america abduction iraq war film ghost documentary iran comic books paranormal usa false flag loose change attack internet internet2 lucas pakistan india china russia all seeing eye patriot wars england atlantis lucifer possession freedom fascism jfk germany nouvel ordre mondial weltordnung neue welt ordnung komplott nuovo orden ordine mondo cospirazione franc-maÃƒÂ§on occultes antÃƒÂ©christ maurer freimaurer finanzkrise weltregierung globalisierung massoneria nytt vÃƒÂ¤rld bestÃƒÂ¤lla regering frimurare ockult nasa one north union group warren trilateral commission elite nau amero superhighway council on foreign relations cfr fbi campaign liberty we are organization un united nationsprisonplanet.com port authority department homeland security france eu the fed wall street ron paul maya serpent rope","torrent":{"xt":"urn:btih:7915e6bc60143f7cd014e6402569b00335392dd2","amp;dn":"The+Obama+Deception%28real+DVD+ISO%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7915e6bc60143f7cd014e6402569b00335392dd2","infoHashBuffer":{"type":"Buffer","data":[121,21,230,188,96,20,63,124,208,20,230,64,37,105,176,3,53,57,45,210]},"announce":[],"urlList":[]}}