{"title":"Justin C. Vovk - Imperial Requiem. Four Royal Women and the Fall","uid":10012793,"size":10447387,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7933fbeb9357aaaff925f1f1276a724786e52740&amp;dn=Justin+C.+Vovk+-+Imperial+Requiem.+Four+Royal+Women+and+the+Fall&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Anette14","files":-1,"time":1398119727,"description":"Description\nProduct Details\nBook Title: Imperial Requiem: Four Royal Women and the Fall of the Age of Empires\t\nBook Author: Justin C. Vovk (Author)\nPaperback: 640 pages\nPublisher: iUniverse (August 20, 2012)\nLanguage: English\nISBN-10: 147591749X\nISBN-13: 978-1475917499\n----------------------\nAttention: The pdf file is converted by me. You will notice major problems with the endnotes, so if you want to check the sources it's almost impossible. I'm sorry about that, but I couldn't fix it. I hope you will still appreciate my effort and not give it a bad rating, because I warned you about this.:)\n----------------------\nBook Description\nAugusta Victoria, Mary, Alexandra, and Zita were four women who were born to rule. In Imperial Requiem, Justin C. Vovk narrates the epic story of four women who were married to the reigning monarchs of Europe's last empires during the late nineteenth and early twentieth centuries. Using a diverse array of primary and secondary sources, letters, diary entries, and interviews with descendants, Vovk provides an in-depth look into the lives of four extraordinary women who stayed faithfully at their husbands' sides throughout the cataclysm of the First World War and the tumultuous years that followed. At the centers of these four great monarchies were Augusta Victoria, Germany's revered empress whose unwavering commitment to her bombastic husband made her a national icon; Mary, whose Cinderella story and immense personal strength made her the soul of the British monarchy through some of its greatest crises; Alexandra, the ill-fated tsarina who helped topple the Russian monarchy through her ineffective rule; and Zita, the resolute empress of Austria whose story of loss and exile captivated the world's attention for seven decades. Imperial Requiem shares the fascinating story of four princesses who married for love, graced imperial thrones, and watched as their beloved worlds were torn apart by war, revolution, heartache, and loss.\n----------------------\nAbout the Author\nJustin C. Vovk is the author of In Destiny's Hands: Five Tragic Rulers, Children of Maria Theresa. He is an independent journalist and historian who resides in Hamilton, Ontario.\n","torrent":{"xt":"urn:btih:7933fbeb9357aaaff925f1f1276a724786e52740","amp;dn":"Justin+C.+Vovk+-+Imperial+Requiem.+Four+Royal+Women+and+the+Fall","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7933fbeb9357aaaff925f1f1276a724786e52740","infoHashBuffer":{"type":"Buffer","data":[121,51,251,235,147,87,170,175,249,37,241,241,39,106,114,71,134,229,39,64]},"announce":[],"urlList":[]}}