{"title":"Spectrum Series - Destination Unknown ft Kyle Partridge","uid":13163128,"size":1261900185,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:7a049dc8af76de396798f5c82e37abff70bb0717&amp;dn=Spectrum+Series+-+Destination+Unknown+ft+Kyle+Partridge&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"MOTOFilm","files":1,"time":1452178898,"description":"The season finale of The Spectrum Series has finally arrived and, we saved the best for the last. Episode VIII, Destination Unknown, features former factory rider, privateer, and father, Kyle Partridge. Joining Partridge is amateur racer and now soon-to-be-professional, Zac Commans.\r\nPartridge was a top amateur star in the 1990s and early 2000s. And, by star, we are not exaggerating. Partridge was one of only three other amateur racers in the world to be signed to factory American Suzuki's amateur program (joining Partridge was Davi Millsaps and Josh Lichtle). However, after going pro, Kyle's career proceeded to turn into one an almost hellish roller coaster ride and only just came to its unfortunate conclusion late this year. Kyle opens up in grave detail about his amateur success, professional and personal failures during his professional racing tenure, the passing of his father, birth of his son, and betrayal from a longtime family friend. Kyle holds nothing back, laying it all out there for everybody to know.\r\nMeanwhile, Zac Commans was on the cusp of turning pro in 2015 before a serious injury put him into an induced coma and left his parents and older sister questioning if the risk was truly worth the reward. Zac and his family open up in detail about the accident, his recovery process, and what the future holds.\r\nAnd, it being our season finale, we decided to give you a 45-minute episode instead of our usual 20 to 30-minute episodes. We hope all enjoy our season finale! We will see you in 2016 for season two of The Spectrum Series!","torrent":{"xt":"urn:btih:7a049dc8af76de396798f5c82e37abff70bb0717","amp;dn":"Spectrum+Series+-+Destination+Unknown+ft+Kyle+Partridge","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7a049dc8af76de396798f5c82e37abff70bb0717","infoHashBuffer":{"type":"Buffer","data":[122,4,157,200,175,118,222,57,103,152,245,200,46,55,171,255,112,187,7,23]},"announce":[],"urlList":[]}}