{"title":"Seven Deadliest Social Network Attack{BBS}","uid":6624896,"size":4782474,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7babb534ad5a1eda5038084443fe7f7e323588f4&amp;dn=Seven+Deadliest+Social+Network+Attack%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"bigbluesea","files":-1,"time":1314123225,"description":"Do you need to keep up with the latest hacks, attacks, and exploits effecting social networks? Then you need Seven Deadliest Social Network Attacks. This book pinpoints the most dangerous hacks and exploits specific to social networks like Facebook, Twitter, and MySpace, laying out the anatomy of these attacks including how to make your system more secure. You will discover the best ways to defend against these vicious hacks with step-by-step instruction and learn techniques to make your computer and network impenetrable.\n\nAttacks detailed in this book include:\n\n   1. Social Networking Infrastructure Attacks\n   2. Malware Attacks\n   3. Phishing Attacks\n   4. Evil Twin Attacks\n   5. Identity Theft\n   6. Cyber Bullying\n   7. Physical Threats\n\n\n    * Knowledge is power, find out about the most dominant attacks currently waging war on computers and networks globally\n\n    * Discover the best ways to defend against these vicious attacks; step-by-step instruction shows you how\n\n    * Institute countermeasures, don't be caught defenseless again, learn techniques to make your computer and network impenetrable\n\nAbout the Author\nCarl Timm is the Regional Director of Security for Savvis, Inc. As Regional Director of Security, Mr. Timm is responsible for keeping up-to-date on security threats businesses experience and finding solutions that mitigate the threats. Mr. Timm has worked in the Information Security area for over 16 years providing security and IT governance consulting services for fortune 500 companies. Mr. Timm is also an industry recognized author, having authored multiple books on the topics of security and networking. Mr. Timm holds multiple industry certifications including the CCIE and PMP.\n\n\n\n    * Paperback: 192 pages\n    * Publisher: Syngress (May 6, 2010)\n    * Language: English\n    * ISBN-10: 159749545X\n    * ISBN-13: 978-1597495455","torrent":{"xt":"urn:btih:7babb534ad5a1eda5038084443fe7f7e323588f4","amp;dn":"Seven+Deadliest+Social+Network+Attack%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7babb534ad5a1eda5038084443fe7f7e323588f4","infoHashBuffer":{"type":"Buffer","data":[123,171,181,52,173,90,30,218,80,56,8,68,67,254,127,126,50,53,136,244]},"announce":[],"urlList":[]}}