{"title":"Sin city,Ciudad del pecado[XviD.AC3.HDRip][Torrentmas.com]","uid":4870776,"size":2409424896,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:7db7cc5dd7210cd2b2fc15a59afe2981b3b014ad&amp;dn=Sin+city%2CCiudad+del+pecado%5BXviD.AC3.HDRip%5D%5BTorrentmas.com%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"nahla","files":1,"time":1240791115,"description":"  cartel\n\nAmpliar cartel\n\tDirecciÃƒÂ³n: Robert Rodriguez &amp; Frank Miller, con la colaboraciÃƒÂ³n especial de Quentin Tarantino.\nPaÃƒÂ­s: USA.\nAÃƒÂ±o: 2005.\nDuraciÃƒÂ³n: 129 min.\nGÃƒÂ©nero: Thriller.\nInterpretaciÃƒÂ³n: Jessica Alba (Nancy), Benicio Del Toro (Jackie Boy), Brittany Murphy (Shellie), Clive Owen (Dwight), Mickey Rourke (Marv), Bruce Willis (Hartigan), Elijah Wood (Kevin), Rosario Dawson (Gail), Michael Clarke Duncan (Manute), Michael Madsen (Bob), Josh Hartnett (El Hombre), Carla Gugino (Lucille), Jaime King (Goldie), Nick Stahl (Roarke Jr/Bastardo amarillo), Devon Aoki (Miho), Alexis Bledel (Becky), Rutger Hauer (Cardenal Roark).\nGuiÃƒÂ³n: Frank Miller; basado en sus cÃƒÂ³mics.\nProducciÃƒÂ³n: Elizabeth AvellÃƒÂ¡n, Frank Miller y Robert Rodriguez.\nMÃƒÂºsica: Robert Rodriguez, John Debney y Graeme Revell.\nFotografÃƒÂ­a: Robert Rodriguez.\nMontaje: Robert Rodriguez.\nEstreno en USA: 1 Abril 2005.\nEstreno en EspaÃƒÂ±a: 12 Agosto 2005.\n\nSINOPSIS\n\nBienvenido a Sin City. Una ciudad que atrae a los tipos duros, a los corruptos y los solitarios. Para algunos es un lugar oscuro. Insensible. Para otros es su hogar. PolicÃƒÂ­as corruptos. Mujeres sensuales. Vigilantes desesperados. Muchos quieren vengarse. Otros redimir sus pecados. Y tambiÃƒÂ©n hay quien espera conseguir un poco de las dos cosas. Un universo de hÃƒÂ©roes extraÃƒÂ±os y reticentes que intentan hacer lo correcto en una ciudad que rechaza el bien. La historia central se centra en Marv (Mickey Rourke), un matÃƒÂ³n callejero de toda la vida. Cuando Marv acoge en su casa a una diosa de la belleza llamada Goldie (Jaime King), sÃƒÂ³lo para conservar su cadÃƒÂ¡ver en la cama, peinÃƒÂ³ la ciudad para vengarse de la pÃƒÂ©rdida del ÃƒÂºnico amor que habÃƒÂ­a senti-do en su corazÃƒÂ³n. Otra de las historias es la de Dwight (Clive Owen), un investigador privado que se empeÃƒÂ±a una y otra vez en dejar atrÃƒÂ¡s los problemas a pesar de que no consigue deshacerse de ellos. DespuÃƒÂ©s de que muera un policÃƒÂ­a en el casco antiguo de la ciudad, Dwight no se detiene ante nada para proteger a sus ami-gos entre las damas de la noche. Y finalmente, estÃƒÂ¡ la historia de John Hartigan (Bruce Willis), el ÃƒÂºltimo policÃƒÂ­a honrado de Sin City. Su vida profesional estÃƒÂ¡ a punto de terminar. En su ÃƒÂºltimo caso tra-ta de salvar a una niÃƒÂ±a de 11 aÃƒÂ±os de las manos del sÃƒÂ¡dico hijo de un senador... con sorprendentes resultados.","torrent":{"xt":"urn:btih:7db7cc5dd7210cd2b2fc15a59afe2981b3b014ad","amp;dn":"Sin+city%2CCiudad+del+pecado%5BXviD.AC3.HDRip%5D%5BTorrentmas.com%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7db7cc5dd7210cd2b2fc15a59afe2981b3b014ad","infoHashBuffer":{"type":"Buffer","data":[125,183,204,93,215,33,12,210,178,252,21,165,154,254,41,129,179,176,20,173]},"announce":[],"urlList":[]}}