{"title":"People Take Warning! Murder Ballads &amp; Disaster Songs 1913-19","uid":11037824,"size":1376605239,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:7e17c2bb58e622f9d690e235de6be5e14dc89bc5&amp;dn=People+Take+Warning%21+Murder+Ballads+%26amp%3B+Disaster+Songs+1913-19&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"uradumfuk","files":132,"time":1410816708,"description":"Review by Steve Leggett  [-]\n\nThis three-disc, 70-track (30 of them new to the CD era) collection of murder ballads and disaster songs originally released on commercial 78s between 1913 and 1938 is, in spite of the archaic song structures and often crude sonic qualities on display, strangely contemporary in tone and feel, maybe because we've always been drawn to the scene of the accident, and even in this 21st century world of the Internet and all-day, all-night news channels, that's still as true as it ever was. We just don't write songs about such things so much anymore, and since one can just flip on the TV to get up to speed on the latest round of personal, local, and global tragedies, that's probably understandable. A quaint view of why these old songs were so popular back in the day is to say that's how the news traveled back then, but that wouldn't be true. The news media in the early 1900s in America was every bit as dogged and sensational as it is now, and these tragic songs didn't carry the news so much as give it a community focus, good or bad, functioning as street-corner sermons, cautionary tales, or just plain gossip given melody. Some of these songs are straight observational narratives, but some of them have definite agendas. There's a big difference here, for instance, between Charley Patton's two-part personal epic &quot;High Water Everywhere,&quot; recorded in 1929 and containing Patton's chilling appraisal of the Mississippi flood from two years earlier, and Elder Curry's sanctified &quot;Memphis Flu&quot; from 1930, which determines the influenza epidemic of that same year was God's stern judgment on the moral paucity of the human species. Both songs carry news, and news that is deeply tragic, but to quite different ends and purposes.\n\nThere are easily a dozen songs here about the sinking of the Titanic in 1912, an event that could be said to metaphorically carry the Victorian era with it to the bottom of the sea and usher in a world where industrial disasters, whether they be sinking ships, derailing trains, or cars wrecking on the highway, became central symbols in a seemingly endless procession of misfortune. Then there are the murder ballads that make up most of disc three here (the first disc contains songs about the crashing, sinking, and wrecking of various machines and motor vehicles while the second covers floods, hurricanes, tornadoes, droughts, and other natural world-related calamities, and the third, easily the creepiest, deals with violence between people), many of which have to do with the murders of young and unmarried pregnant women and end with no discernible moral position being taken, and one realizes that tragedies like the sinking of the Titanic are full of terror while the very real murders of Laura Foster (as chronicled by Grayson &amp; Whitter in their 1929 &quot;Tom Dooley&quot;), Naomi Wise (Clarence Ashley's &quot;Naomi Wise,&quot; also recorded in 1929), and Ellen Smith (&quot;Poor Ellen Smith,&quot; tracked by the Dykes Magic City Trio in 1927) are full of something closer to pure horror and have to be viewed as cautionary tales, or else there is nothing spiritually or emotionally redemptive in them at all.\n\nIs this kind of a morbid collection? Yes, it is, but it is also fascinating for what it reveals about our concepts of mortality, an afterlife, redemption, survival, and abstract looks at things like bravery, heroism, and even a kind of powerful fatalism. In guitarist Frank Hutchison's version of the Titanic disaster, &quot;Last Scene of the Titanic,&quot; recorded in 1927, he has people below decks dancing to the sound of fiddles as the ship goes down. Life is full of unexpected tragedies, he seems to be saying, but nothing is really lost by dancing because fate will do what fate always does anyway. If there's an overriding moral point to all of these old songs, that might be it. Take warning, but don't stop dancing as long as the fiddles are still playing. Thanks to Tompkins Square for assembling this marvelous collection. It may be dour and morbid on the surface, full of floods, shipwrecks, hurricanes, suicides, murders, and uncountable disasters, but it is somehow strangely redemptive, too, reminding us that we are all survivors even as it also reminds us that when the music stops, we all have to sit down.\n","torrent":{"xt":"urn:btih:7e17c2bb58e622f9d690e235de6be5e14dc89bc5","amp;dn":"People+Take+Warning%21+Murder+Ballads+%26amp%3B+Disaster+Songs+1913-19","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7e17c2bb58e622f9d690e235de6be5e14dc89bc5","infoHashBuffer":{"type":"Buffer","data":[126,23,194,187,88,230,34,249,214,144,226,53,222,107,229,225,77,200,155,197]},"announce":[],"urlList":[]}}