{"title":"iStat Menus 5.10 (Mac OSX)","uid":12466812,"size":29406494,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:7ea96a97f4f2de523335aaf2f1f5b48b37c1bf1a&amp;dn=iStat+Menus+5.10+%28Mac+OSX%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":3,"time":1442864464,"description":"From MacTake.com\n\niStat Menus lets you monitor your system right from the menubar. Included are 8 menu extras that let you monitor every aspect of your system.\nSome features:\n\n- CPU -- Monitor cpu usage. 7 display modes, multiple core support.\n- Memory -- Monitor memory usage. 4 display modes, page ins/outs and swap usage display.\n- Disks -- Monitor disk usage and activity. 6 display modes, ability to hide disks you dont want to see.\n- Network -- Monitor current and total bandwidth, peak bandwidth, IP addresses, and the ability to hide network connections you don't want to see.\n- Temps -- Monitor the temperature of your Mac. 2 display modes, ability to hide sensors you don't want to see.\n- Fans -- Monitor the fan speeds in your Mac. 2 display modes, ability to hide sensors you don't want to see.\n- Bluetooth -- Control bluetooth status plus monitor the battery level of your Apple wireless keyboard or mouse.\n- Date &amp; Time -- Date and time in your menubar. World clock display lets you see the time in multiple locations around the world.\n\n\n\nWHAT'S NEW\nVersion 5.10:\n\n- Improved performance and reduced memory usage.\n- Improved support for 5k iMac.\n- Added support for 2015 MacBook Airs.\n- Added support for 2015 13-inch MacBook Pro.\n- Added ability to have different skin settings for light and dark menu bar modes in Yosemite.\n- Added more memory details when using Memory Pressure mode.\n- Added an option to show activity for individual disks in the menubar.\n- Added an option to show activity for each disk in a fusion drive in the disks dropdown.\n- Added ability to rename cities.\n- Added an option to only show MB/s or Mb/s for bandwidth in the menubar.\n- Added new hardware info to network connection submenus.\n- Fixed some issues where disk activity was missing for some disks.\n- Fixed an issue with disk activity not working with SoftRAID disks.\n- Fixed an issue where disks could show 0KB free.\n- Fixed an issue with 12 hour time formats if system is set to 24 hour time.\n- Fixed an issue in the network extra where the primary interface setting may not have been working correctly in the menubar.\n- Improved per app network monitoring on Yosemite.\n- Improved GPU monitoring.\n- Improved disk activity monitoring.\n- Improved layout in disks dropdown when a disk has multiple partitions.\n- Improved display of some menubar text modes in Yosemite.\n- Improved event dots in calendar.\n- Improved moon item display when using Simple city layout.\n- Improved city database","torrent":{"xt":"urn:btih:7ea96a97f4f2de523335aaf2f1f5b48b37c1bf1a","amp;dn":"iStat+Menus+5.10+%28Mac+OSX%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7ea96a97f4f2de523335aaf2f1f5b48b37c1bf1a","infoHashBuffer":{"type":"Buffer","data":[126,169,106,151,244,242,222,82,51,53,170,242,241,245,180,139,55,193,191,26]},"announce":[],"urlList":[]}}