{"title":"RedMILF - 1672 - Mother's Solution","uid":14755961,"size":114763605,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:7f77b7c8fccfc3873b82bb41132b9dffe78f2958&amp;dn=RedMILF+-+1672+-+Mother%27s+Solution&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"distinc","files":2,"time":1464813685,"description":"...::ScreenShots::...\r\n \nhttp://imagedisco.net/?v=3825746304\r\n \nhttp://imagedisco.net/?g=8078702776\r\n\r\n\r\nPlot:\r\n\r\nSexy mom Rachel is unhappy with the recent behavior of her son Blake. He has been very moody, ceased doing his chores, slacked off at school, and stopped eating right. Wearing a tight, low-cut dress that shows off her luscious figure and a tantalizing amount of cleavage, she enters the young man's room and finds him moping on his bed. A lecture ensures in which Rachel suggests Blake is suffering sexual frustration and feelings of insecurity. She imagines it must have something do with seeing so many hot young women at school. Unfortunately, Blake is not the jock type - so he does not get much attention from them. But Rachel has discovered over clues as to what's troubling him. She found pornographic MILF content on his computer, and cum stains in his boxers. Evidently the young man has a thing for older women. As a broad-minded mom with unorthodox ideas on how to raise a son, Rachel knows just what she can do to help him out. Within moments she has pulled Blake's cock from his pants, applied lotion to it, and commenced to stroke it off. Blake is stunned by his mother's actions. He lies looking up at her as her hand works skilfully and lovingly up and down his length. Her voice is soft and encouraging, yet also instructive. Teasingly she plays up her position as Blake's mommie - reminding of all she's done for him over the years, and what he needs to do to repay her. Keeping his cock close to the flesh of her cleavage, she milks his cock again and again. Several times she leans her beautiful face down and touches her tongue to his helmet. It is only a matter of time before Blake blasts a load of cum up and over his mother's clenching hand. Afterwards, he lies breathless. Rachel is pleased. She has relieved her for son for the time being. However, speaking firmly, she informs him that she will do it again - whenever and wherever his behavior makes it necessary","torrent":{"xt":"urn:btih:7f77b7c8fccfc3873b82bb41132b9dffe78f2958","amp;dn":"RedMILF+-+1672+-+Mother%27s+Solution","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7f77b7c8fccfc3873b82bb41132b9dffe78f2958","infoHashBuffer":{"type":"Buffer","data":[127,119,183,200,252,207,195,135,59,130,187,65,19,43,157,255,231,143,41,88]},"announce":[],"urlList":[]}}