{"title":"Niall Ferguson and Peter Schwartz on Human Progress","uid":4576894,"size":317077680,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:7f8fc722dbf2b10ab6876b9cae5244c75eadca6a&amp;dn=Niall+Ferguson+and+Peter+Schwartz+on+Human+Progress&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"the_Phyrexian","files":-1,"time":1229269986,"description":"The Long Now Foundation\nSan Francisco, CA\nApr 28th, 2008\n\nNiall Ferguson and Peter Schwartz present Historian vs. Futurist on Human Progress \n\nas part of The Long Now Foundation's Seminars about Long-term Thinking.\n\n\nStewart Brand is a co-founder and managing director of  Global Business Network, founded and runs the GBN Book Club, and is the president of The Long Now Foundation. Brand is well known for founding, editing and publishing the Whole Earth Catalog (01968-85), which received a National Book Award for the 01972 issue. In 01984, he founded The WELL (Whole Earth 'Lectronic Link), a computer teleconference system for the San Francisco Bay Area. It now has 11,000 active users worldwide and is considered a bellwether of the genre.Brand has been a member of the Board of Trustees of the Santa Fe Institute, an interdisciplinary center studying the sciences of complexity, since 01989. He received the Golden Gadfly Lifetime Achievement Award from the Media Alliance, San Francisco in the same year. He was a founding member of the Board of Directors of the Electronic Frontier Foundation, an organization which supports civil rights and responsibilities in electronic media, and is an acting adviser to Ecotrust, Portland-based preservers of temperate rain forest from Alaska to San Francisco.Brand is the author of many pioneering books including The Clock Of The Long Now in 01999, How Buildings Learn: What Happens After They're Built in 01994, The Media Lab: Inventing the Future at MIT in 01987, and Two Cybernetic Frontiers on Gregory Bateson and cutting-edge computer science in 01974. It had the first use of the term &quot;personal computer&quot; in print and was the first book to report on computer hackers.\n\n\nNiall Ferguson, MA, D.Phil., is the Laurence A. Tisch Professor of History at Harvard University. He is a resident faculty member of the Minda de Gunzburg Center for European Studies. He is also a Senior Research Fellow of Jesus College, Oxford University, and a Senior Fellow of the Hoover Institution, Stanford University.\n\nA member of the The Long Now Foundation board of directors.Peter Schwartz is cofounder and chairman of Global Business Network (GBN), a unique membership organization and worldwide network of strategists, business executives, scientists, and artists based in Emeryville, California. Established in 01988, GBN specializes in corporate scenario planning and research on the future of the business environment. From 01982 to 01986, Peter headed scenario planning for the Royal Dutch/Shell Group of Companies in London. His team conducted comprehensive analyses of the global business and political environment and worked with senior management to create successful strategies. Before joining Royal Dutch/Shell, Peter directed the Strategic Environment Center at SRI International. The Center researched the business milieu, lifestyles, and consumer values, and conducted scenario planning for corporate and government clients.Schwartz is the co-author of both the 01999 books The Long Boom, and When Good Companies Do Bad Things: Responsibility and Risk in an Age of Globalization, and is the author of the 01991 book, The Art of the Long View: Planning for the Future in an Uncertain World. This seminal publication on scenario planning has been translated into Dutch, Portuguese, and Chinese. Peter also co-authored Seven Tomorrows: Toward a Voluntary History with James Ogilvy and Paul Hawken in 01982, and The Emergent Paradigm: Changing Patterns of Thought and Belie with James Ogilvy in 01979. He has published and lectured widely and served as a script consultant on the films War Games and Sneakers. He received a BS in aeronautical engineering and astronautics from Rensselaer Polytechnic Institute.\n\n\nplease leave a comment if you want, this is just to show what is out there...\nAnd before you go and spam, dl it watch it and make up your own mind...\ncheers the_phyrexian\n\nAre you a British citizen? Click here! (Petition to stop Sharia Law) &lt;a href=&quot;\nhttp://petitions.number10.gov.uk/shariastop/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://petitions.number10.gov.uk/shariastop/&lt;/a&gt;\t\n\nthere is a reseed section, read it / use it... &lt;a href=&quot;\nhttp://suprbay.org/forumdisplay.php?f=35&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://suprbay.org/forumdisplay.php?f=35&lt;/a&gt;\n\nor visit my blog... &lt;a href=&quot;\nhttp://thephyrexian.tk/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thephyrexian.tk/&lt;/a&gt;","torrent":{"xt":"urn:btih:7f8fc722dbf2b10ab6876b9cae5244c75eadca6a","amp;dn":"Niall+Ferguson+and+Peter+Schwartz+on+Human+Progress","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7f8fc722dbf2b10ab6876b9cae5244c75eadca6a","infoHashBuffer":{"type":"Buffer","data":[127,143,199,34,219,242,177,10,182,135,107,156,174,82,68,199,94,173,202,106]},"announce":[],"urlList":[]}}