{"title":"Eve 6 - It's All In Your Head (2003) [FLAC]","uid":5561985,"size":336386564,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:7fe1de6107d262533da4be03e5b0950d69ef344d&amp;dn=Eve+6+-+It%5C%27s+All+In+Your+Head+%282003%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"EzzaBee","files":-1,"time":1273859234,"description":"Artist: Eve 6\nAlbum: It's All In Your Head\nYear: 2003\nLabel: RCA\n\nRipped with foobar2000 (v1.0.1) on 14/05/2010 as FLAC (q8) directly from retail CD. Replaygain also calculated with foobar2000.\n\n\nAlbum Bio (from Wikipedia):\nIt's All in Your Head is Eve 6's third and last studio album before they were dropped from RCA Records and subsequently disbanded in 2004. It is considered an experimental album, which may explain the lackluster sales that led to the release from their RCA contract.\n\n\nBand Bio (from Wikipedia):\nEve 6 (sometimes typeset as EVÃ†Å½ 6) is an American rock  band from Southern California who are most well known for their hits &quot;Inside Out&quot;, &quot;Leech&quot;, and the slow anthem &quot;Here's to the Night&quot;. They disbanded in 2004 and reunited with two of the three original members in October 2007.\n\nEve 6's basic rock trio (guitar/bass/drums) sound is augmented on their later studio recordings with many interesting studio techniques. For example, &quot;Bang&quot; (from Horrorscope) culminates in a section constructed entirely from repeated, overdubbed layers. Eve 6 also made liberal use of overdubbed vocals and other studio polish, such as the vocoded filigree directly preceding the breakdown section of &quot;On the Roof Again&quot; (from Horrorscope). Eve 6 has also made heavy use of a trochee  meter.\n\nEve 6 is perhaps best known for its lyrics however, which feature vivid imagery and inventive wordplay: two of the group's hits, &quot;Inside Out&quot; (from their self-titled album) and &quot;Promise&quot; (from Horrorscope), are good examples of this style. Romance and angst are common themes, but the band also explores issues of gender identity (&quot;Jet Pack,&quot; or &quot;Sunset Strip Bitch,&quot; both from Horrorscope), and suicide (&quot;Friend of Mine,&quot; from It's All in Your Head), among others.","torrent":{"xt":"urn:btih:7fe1de6107d262533da4be03e5b0950d69ef344d","amp;dn":"Eve+6+-+It%5C%27s+All+In+Your+Head+%282003%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7fe1de6107d262533da4be03e5b0950d69ef344d","infoHashBuffer":{"type":"Buffer","data":[127,225,222,97,7,210,98,83,61,164,190,3,229,176,149,13,105,239,52,77]},"announce":[],"urlList":[]}}