{"title":"Community Reader by Tapatalk 4 v.1.4.3 HD.apk","uid":8906107,"size":11528482,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:8189f76760c6a1379174de1e30b24d8775639c3f&amp;dn=Community+Reader+by+Tapatalk+4+v.1.4.3+HD.apk&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"legdem","files":1,"time":1378908969,"description":"FOR TABLETS\n\nIntroducing a new, completely rewritten version of Tapatalk for Android. Looks great on newer Android phone running Ice Cream Sandwich and Jelly Beans. Android Developer building great Android app :)\n\nGreat new features\n- 100% Android native look and feel\n- Super-fast navigation with sliding menu to join to different sections and forums\n- Swipe to change pages - reading long posts has never been easier!\n- Great photo and video experience with in-app YouTube Player\n- New Photo Editor powered by Aviary - add filter, resize and crop photos before you post\n- One-click photo sharing with Tapatalk, no more attachment or upload to other third party websites\n- Save battery power with Push Notification service - get notified of forum updates\n- Many Advanced Settings for forum junkies\n- And many many more!\n\nWhat is Tapatalk?\n\nDiscover great internet communities or stay connected with your favourites community on-the-go with this award-winning mobile app. Tapatalk is the only mobile app combing over 50,000+ internet communities with a streamlined mobile experience, allowing you to share and follow thoughts, photos, opinions to all your communities within a single mobile app.\n\nTapatalk aggregates content from network of communities of common interests, from automotive to parenting, from gardening to horse-riding - You will meet passionate people who share the same interest and participate in great discussions on topic only you and the like-minded members truly appreciated.","torrent":{"xt":"urn:btih:8189f76760c6a1379174de1e30b24d8775639c3f","amp;dn":"Community+Reader+by+Tapatalk+4+v.1.4.3+HD.apk","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8189f76760c6a1379174de1e30b24d8775639c3f","infoHashBuffer":{"type":"Buffer","data":[129,137,247,103,96,198,161,55,145,116,222,30,48,178,77,135,117,99,156,63]},"announce":[],"urlList":[]}}