{"title":"Jamie Brockett - Legend of the USS Titanic","uid":6783870,"size":16300943,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:8218782c4b20dbbedac0bf9de7c39b9d49a11a84&amp;dn=Jamie+Brockett+-+Legend+of+the+USS+Titanic&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"meda1","files":1,"time":1320013808,"description":"This is a very fast paced, wacky look at the world of wacky tobaccy in the 60's, please seed seed seed and seed some more, and look up the story behind the song itself, the history of Jamie Brocket too, because this tune is an EPIC of US and WORLD Culture of that time.\n\n\nIt references all the issues of that time in a put down cut comical way that you will be rolling on the floor over laughing so much you'll have to replay it several times to hear everything you missed due to laughing.\n\nI do have the Original LP, from it's days of being banned, and only Jamie himself was selling it, but a few shops picked up copies from him, and sort of had them under the counter.\n\nHe had to travel around with a suitcase full of albums trying to sell them himself since this song go the whole album banned.\n\n\nI do not advocate Pot use, for even medicinal purposes due to it's addictive traits, it's withdraw side effects, and more. Don't think you can prove me wrong, I know all the facts, and the only propaganda I read was that it's not addictive or habit forming, I learned the REAL FACTS on my own. As when you try to quite because your tired of sources drying up, and you get stressed out and think the world is ending or wish you were dead, don't try to kill yourself, because those feelings will fade over the next 60 days and you'll be back to normal. Plus you won't be living your life with face in the bottom of an empty baggie. And you'll have more energy to do a few things, and your MEMORY may improve, maybe not for all of you, you might stay stupid forever. \n\nOk, you've been warned, just enjoy the comedy of the tune, and pay attention to Jack Johnson too... \n\n","torrent":{"xt":"urn:btih:8218782c4b20dbbedac0bf9de7c39b9d49a11a84","amp;dn":"Jamie+Brockett+-+Legend+of+the+USS+Titanic","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8218782c4b20dbbedac0bf9de7c39b9d49a11a84","infoHashBuffer":{"type":"Buffer","data":[130,24,120,44,75,32,219,190,218,192,191,157,231,195,155,157,73,161,26,132]},"announce":[],"urlList":[]}}