{"title":"Sexual Simulation Pack.1 -- I-Doser","uid":4767358,"size":56681240,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:82374ec1c3a1399b9ff7d8266cc01bdaab97222f&amp;dn=Sexual+Simulation+Pack.1+--+I-Doser&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"goodma6","files":1,"time":1236919268,"description":"I-Doser Releases the First Ever Sexual Simulation Pack.\n\nSexual Simulations 1 is a collection of 4 doses: First Love, Ecstasy, Extend, and Orgasm. Each audio track contains our advanced binaural beats that will synchronize your brainwaves to a simulated state. Mixed with our sophisticated auditory pulses are soothing backtracks of soundscapes to help your brain induce of state of warmth, exhilaration, tantrism, and climax. For those seeking Sexual Pleasure and Beyond.\n\nI-Doser Labs is the leading producer of Binaural Brainwave CDs, MP3s, and computer-based Binaural Brainwave Doses. Using proven, scientific, and safe methods of synchronizing your brainwaves; a simulated state can be achieved through the use of our advanced audio CDs, MP3s, or the I-Doser Player Application for Personal Computers. Our Binaural process has been refined with years of research and development. With thousands of satisfied users, the I-Doser Labs CDs, MP3s, and Computer-Based Applications continue to lead the industry as the only safe and effective method to achieve a simulated mood or experience.\n","torrent":{"xt":"urn:btih:82374ec1c3a1399b9ff7d8266cc01bdaab97222f","amp;dn":"Sexual+Simulation+Pack.1+--+I-Doser","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"82374ec1c3a1399b9ff7d8266cc01bdaab97222f","infoHashBuffer":{"type":"Buffer","data":[130,55,78,193,195,161,57,155,159,247,216,38,108,192,27,218,171,151,34,47]},"announce":[],"urlList":[]}}