{"title":"Angel Fire - Andrew M. Greeley, Epub, Mobi, KK","uid":7067264,"size":1151323,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:84b27d371e056a1e9e59c9de56e4e4f6e3839f84&amp;dn=Angel+Fire+-+Andrew+M.+Greeley%2C+Epub%2C+Mobi%2C+KK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"karaokeking123","files":-1,"time":1330557294,"description":"Angel Fire - Andrew M. Greeley, Epub, Mobi\n\n\nA native of Chicago, Reverend Andrew M. Greeley, is a priest, distinguished sociologist and bestselling author. He is professor of social sciences at the University of Chicago and the University of Arizona, as well as Research Associate at the National Opinion Research Center at the University of Chicago. His current sociological research focuses on current issues facing the Catholic Church-including celibacy of priests, ordination of women, religious imagination, and sexual behavior of Catholics.\n \nFather Greeley received the S.T.L. in 1954 from St. Mary of Lake Seminary. His graduate work was done at the University of Chicago, where he received the M.A. Degree in 1961 and the Ph.D. in 1962.\n \nFather Greeley has written scores of books and hundreds of popular and scholarly articles on a variety of issues in sociology, education and religion. His column on political, church and social issues is carried by the carried by the Chicago Sun Times and may other newspapers. He stimulates discussion of neglected issues and often anticipates sociological trends. He is the author of more than thirty bestselling novels and an autobiography, Furthermore!: Confessions of a Parish Priest.\n \n\nEnjoy!","torrent":{"xt":"urn:btih:84b27d371e056a1e9e59c9de56e4e4f6e3839f84","amp;dn":"Angel+Fire+-+Andrew+M.+Greeley%2C+Epub%2C+Mobi%2C+KK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"84b27d371e056a1e9e59c9de56e4e4f6e3839f84","infoHashBuffer":{"type":"Buffer","data":[132,178,125,55,30,5,106,30,158,89,201,222,86,228,228,246,227,131,159,132]},"announce":[],"urlList":[]}}