{"title":"Algal Blooms and Membrane Based Desalination Technology","uid":12450169,"size":15620280,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:857f12496bfffd35a94692b1dced487cfca5f681&amp;dn=Algal+Blooms+and+Membrane+Based+Desalination+Technology&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1442671960,"description":"Algal Blooms and Membrane Based Desalination Technology - Loreen Ople Villacorte (CRC, 2014).pdf\n\nISBN 9781138026261\n\nSeawater desalination is rapidly growing in terms of installed capacity (~80 million m3/day in 2013), plant size and global application. An emerging threat to this technology is the seasonal proliferation of microscopic algae in seawater known as algal blooms. Such blooms have caused operational problems in seawater reverse osmosis (SWRO) plants due to clogging and poor effluent quality of the pre-treatment system which eventually forced the shutdown of the plant to avoid irreversible fouling of downstream SWRO membranes. As more extra large SWRO plants (&gt;500,000 m3/day) are expected to be constructed in the coming years, frequent chemical cleaning (&gt;1/year) of SWRO installations will not be feasible, and more reliable pre-treatment system will be required. To maintain stable operation in SWRO plants during algal bloom periods, pre-treatment using ultrafiltration (UF) membranes has been proposed.\n\nThis thesis addresses the effect of algal blooms on the operation of UF pre-treatment and SWRO. Experimental investigations demonstrated that marine algal blooms can impact the backwashability of UF and can accelerate biological fouling in RO. However, it is unlikely that algae themselves are the main causes of fouling but rather the transparent exopolymer particles (TEPs) that they produce. To better monitor TEPs, a new method capable of measuring TEP as small as 10 kDa was developed and showed that TEPs can be effectively removed by UF pre-treatment prior to SWRO. This work also demonstrated that although TEPs and other algal-derived material (AOM) are very sticky and can adhere to UF and RO membranes, adhesion can be much stronger on membranes already fouled with AOM. Moreover, a model was developed to predict the accumulation of algal cells in capillary UF membranes which further demonstrated that the role of algal cells in UF fouling is not as significant as that of AOM and TEPs. \n\nOverall, this study demonstrates that better analytical methods and tools are essential in elucidating the adverse impacts of algal blooms in seawater on the operation of membrane-based desalination plants (UF-RO). It also highlighted the importance of developing effective pre-treatment processes to remove AOM from the raw water and reduce the membrane fouling potential of the feed water for downstream SWRO membranes","torrent":{"xt":"urn:btih:857f12496bfffd35a94692b1dced487cfca5f681","amp;dn":"Algal+Blooms+and+Membrane+Based+Desalination+Technology","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"857f12496bfffd35a94692b1dced487cfca5f681","infoHashBuffer":{"type":"Buffer","data":[133,127,18,73,107,255,253,53,169,70,146,177,220,237,72,124,252,165,246,129]},"announce":[],"urlList":[]}}