{"title":"How to Hack Computers: how to hack computers, hacking for beginn","uid":12846459,"size":983721,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:860638fbbf7bfcff7e853c4d9e8fba57a83dc80c&amp;dn=How+to+Hack+Computers%3A+how+to+hack+computers%2C+hacking+for+beginn&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"TopShelfBook","files":3,"time":1448559989,"description":"How to Hack Computers: how to hack computers, hacking for beginners, penetration testing, hacking for dummies, computer security, computer hacking, hacking techniques, network scanning\r\n\r\nHackers are shrouded in a cloud of mystery, and most people don't understand who they are, what they do, how they do it, and what motivates them. As a network security engineer, I want to reveal the mysterious world of hackers to beginners so you can get your feet wet hacking. Not only will I teach you the background of hacking, but I will also expose you to some of the latest software and even show you step-by-step how to install it and use it in the demonstrations contained within this guide. \r\n\r\nIn this guide, I am going to teach you a lot of critical information about hacking such as: \r\n\r\n-What hacking is and what hacking isn’t. \r\n-Hacking terminology and hacker culture. \r\n-Types of attacks and the most famous hacks of all time. \r\n-Ethical considerations and fair warnings about becoming a hacker. \r\n-Fundamental concepts that will serve as a foundation to build hacking skills. \r\n-How to install Linux operating systems using VMWare to setup hacking tools. \r\n-Step-by-step guides for ping sweeps and port scanning. \r\n-How to map network topologies and perform reconnaissance techniques. \r\n-How to use advanced software to find security holes. \r\n\r\nYou are cautioned not to try to abuse any of the information you learn within this book. But you are certainly encouraged to run through these demo's in a home environment so you can gain a deeper knowledge of how hackers operate. \r\n\r\nIf you don't have a background in Internet security, take a deep breath and relax. Not only will I teach you about basic hacking tools but I will also provide you with basic network fundamentals so you will have a platform to build your hacking skills upon.\r\n\r\n**PLEASE SEED**","torrent":{"xt":"urn:btih:860638fbbf7bfcff7e853c4d9e8fba57a83dc80c","amp;dn":"How+to+Hack+Computers%3A+how+to+hack+computers%2C+hacking+for+beginn","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"860638fbbf7bfcff7e853c4d9e8fba57a83dc80c","infoHashBuffer":{"type":"Buffer","data":[134,6,56,251,191,123,252,255,126,133,60,77,158,143,186,87,168,61,200,12]},"announce":[],"urlList":[]}}