{"title":"Velazquez (Life and Work of the Artist - Art).pdf","uid":14301819,"size":18166590,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8629d489cf610363666b9b1417704e2de058ff05&amp;dn=Velazquez+%28Life+and+Work+of+the+Artist+-+Art%29.pdf&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"STBGD","files":1,"time":1460498408,"description":"Grosset &amp; Dunlap | 1968 | English | 124 pages | PDF | 17.3 MB\r\n\r\nDiego de Silva Velazquez, usually known by his mother's name, Velazquez, was born in Calle de la Moreira, Seville, in 1399, and baptized in the parish church of San Pedro on 6 June. His father, Don Juan Rodriguez de Silva y Rodriguez, was the son of a Portuguese hidalgo, who may have moved from Seville to Oporto in the mid-sixteenth century; his mother Jeronima Velazquez was from Seville. Like many young men from good families, he probably had a thorough literary education, and all his life kept up his faith in the world of culture, particularly the classical. His library was evidence of this: greatly superior to those of most painters of his time, it was rich in poetry, religion, medicine, engineering and mathematics, and especially in works by Aristotle, Horace, Ovid, Pliny, and by Ariosto, Castiglione, Vasari, Vesalio and Diirer. It seems clear that he developed a special interest in architectural treatises, from Vitruvius to Alberti, Scamozzi, Serlio, Palladio and Vignola. All this suggests that the young Velazquez had a good, rigorous and well-balanced formal education. Perhaps encouraged by his cultivated master, Francisco Pacheco, he formed his roots in the fundamental principles of the Italian Renaissance","torrent":{"xt":"urn:btih:8629d489cf610363666b9b1417704e2de058ff05","amp;dn":"Velazquez+%28Life+and+Work+of+the+Artist+-+Art%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8629d489cf610363666b9b1417704e2de058ff05","infoHashBuffer":{"type":"Buffer","data":[134,41,212,137,207,97,3,99,102,107,155,20,23,112,78,45,224,88,255,5]},"announce":[],"urlList":[]}}