{"title":"Bullet For My Valentine discography","uid":9319036,"size":6951430112,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:872f6f8640257b47329fd98bc0b87a9b8af1aac2&amp;dn=Bullet+For+My+Valentine+discography&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"sidmal","files":-1,"time":1386513914,"description":"Genre : Metalcore , Heavy metal \nCountry : Wales \nAudio Codec : FLAC (*. flac) \nRip type : image +. cue, tracks +. cue \nBitrate : lossless \n\n\nBullet For My Valentine - The Poison (2005)\nBullet For My Valentine / The Poison (Limited Edition) (2005)\nBullet For My Valentine - The Poison (Deluxe Edition) (2007)\nBullet For My Valentine - The Poison (Limited Edition UK) (2006)\nBullet For My Valentine - Scream, Aim, Fire (2008)\nBullet For My Valentine - Scream, Aim, Fire (Japan Edition) (2008)\nBullet For My Valentine - Scream, Aim, Fire (Deluxe Edition) (2008)\nBullet For My Valentine - Fever (2010)\nBullet For My Valentine - Fever (Japan) (2010)\nBullet For My Valentine / Fever (Tour Edition) (2010)\nBullet For My Valentine / Temper Temper (Japanese Deluxe Edition) 2013\nBullet For My Valentine / Temper Temper [Deluxe Edition])\n\nEP \n\nBullet For My Valentine - Bullet For My Valentine (EP) (2004)\nBullet For My Valentine - Bullet For My Valentine (EP) (Japan) (2004)\nBullet For My Valentine - Hand Of Blood (EP) (2005)\nBullet For My Valentine - Tears Don't Fall (EP) (2006)\nBullet For My Valentine - All These Things I Hate (EP) (2006)\nBullet For My Valentine - Rare Cuts (EP) (2007)\n\n4om wiki\nBullet for My Valentine are a Welsh heavy metal band from Bridgend, formed in 1998. The band is composed of Matthew Tuck (lead vocals, rhythm guitar), Michael Paget (lead guitar, backing vocals), Jason James (bass guitar, backing vocals), and Michael Thomas (drums). They were formed under the name Jeff Killed John and started their music career by covering songs by Metallica and Nirvana. Jeff Killed John recorded six songs which were not released; two of these tracks were reworked later in their career as Bullet for My Valentine. Financial difficulties dictated the name change, which was followed by a change in music direction. In 2002, the band secured a five-album deal with Sony BMG. The band has stated that their music is influenced by classic metal acts such as Metallica, Iron Maiden, and Slayer. The band is part of the Cardiff music scene.\n\nBullet for My Valentine's debut album, The Poison, was released on 3 October 2005 in the United Kingdom and on 14 February 2006 in the United States to coincide with Valentine's Day, in a nod to the band's name. The album entered the Billboard 200 in the US at number 128. It was certified Gold by the Recording Industry Association of America. The band made appearances at the Download Festival and Kerrang! XXV, and undertook a US tour with Rob Zombie. Bullet for My Valentine's second studio album, Scream Aim Fire, was released on 29 January 2008 and debuted at number four on the Billboard 200. The band's third album, Fever, was released on 26 April 2010 and debuted at number three on the Billboard 200. On February 8, 2013, the band released their fourth studio album, Temper Temper, which peaked at number 13 on the US Billboard 200. The band has sold over one million albums in the United States and over 3,000,000 albums worldwide and are the most-successful act in the Kerrang! Awards category of &quot;Best British Band&quot; with three wins.\n","torrent":{"xt":"urn:btih:872f6f8640257b47329fd98bc0b87a9b8af1aac2","amp;dn":"Bullet+For+My+Valentine+discography","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"872f6f8640257b47329fd98bc0b87a9b8af1aac2","infoHashBuffer":{"type":"Buffer","data":[135,47,111,134,64,37,123,71,50,159,217,139,192,184,122,155,138,241,170,194]},"announce":[],"urlList":[]}}