{"title":"Nils landgren &amp; Joe Sample Creole Love Call FLAC","uid":4894081,"size":352890596,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:87468814bdf7b865c722207592d00f9d20f48689&amp;dn=Nils+landgren+%26+Joe+Sample+Creole+Love+Call+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"alejandrobeta","files":21,"time":1242221052,"description":"Nils Landgren is an odd one. On the one hand he creates good for the soul, inventive chamber jazz; on the other he turns out touristic blandofunk. Creole Love Call, recorded in New Orleans and including some of the city's musical luminaries, though too far upstage and away from the action, lies about halfway between these two extremes. It's not as good as Landgren's work with Esbjorn Svensson or Tomasz Stanko, nor as unfortunate as last year's Funky Abba, a gelatinous insult both to funk and the tunetastic Stockholm songsters.\n\nJoe Sample, Landgren's collaborator on this latest project, is another loose cannon, his work with the Crusaders and since swinging between the suavely bootylicious and the neutered. Both men have technical facility, but neither wants to frighten the horses, and in that they are well, if for the listener ominously, matched.\n\nSample is, however, a songwriter of old style Brill Building genius, and the upside of Creole Love Call is listening to newly arranged versions of four of his greatest tunes (&quot;Soul Shadows,&quot; &quot;Don't Take Your Love To Hollywood,&quot; &quot;One Day I Fly Away,&quot; and &quot;Same Old Story&quot;) and one of his not quite so great, relatively pedestrian ones (&quot;I Can't Get Enough Of Your Love&quot;). Other top dollar fare along the way includes Ray Charles' &quot;The Brightest Smile In Town,&quot; Stephen Stills' &quot;Love The One You're With,&quot; and Willie Nelson's neon-lit, Edward Hopperish masterpiece &quot;Nightlife.&quot;\n\nLandgren and Sample serve up brief trombone and keyboard solos on most tracks, but the focus of Creole Love Call is vocal. If you can get past Landgren's received Don Covay-like pronounciation, his true-to-the-melody readings of twelve songwriting hightides is enjoyable enough, and he even gets away with Allen Toussaint's &quot;Get Out Of My Life Woman&quot; and Steve Cropper and Otis Redding's &quot;(Sittin' On The) Dock Of The Bay.&quot; Ray Parker Jr and Charmaine Neville duet with Landgren on, respectively, &quot;Dock Of The Bay&quot; and &quot;With You In Mind,&quot; the other Allen Toussaint tune on the album.\n\nThe unqualified successes of Creole Love Call are the two closing tracks, where the band is augmented by a four-piece brass section, including the delightful sousaphone of Kirk Joseph. &quot;Same Old Story,&quot; its knowing lyric a dual triumph of eloquence and brevity, gets a rousing workout, while the arrangement of Ellington's &quot;Creole Love Call&quot; is a mellifluous little treasure (but at under three minutes, far too short).\n\n\nTrack listing: Get Out Of My Life Woman; (Sittin' On The) Dock Of The Bay; Nightlife; Soul Shadows; The Brightest Smile In Town; Don't Take Your Love To Hollywood; One Day I Fly Away; With You In Mind; I Can't Get Enough Of Your Love; Love The One You're With; Same Old Story; Creole Love Call.\n\nPersonnel: Nils Landgren: trombone and vocals; Joe Sample: acoustic piano and Fender Rhodes; Ray Parker Jr: guitar and vocals; Chris Severin: acoustic bass; Raymond Weber: drums; Lenny Castro: percussion; Sammie Williams: trombone (11,12); Leon Brown and Andrew Baham: trumpet (11,12); Kirk Joseph: sousaphone (11,12); Charmaine Neville: vocals (8).","torrent":{"xt":"urn:btih:87468814bdf7b865c722207592d00f9d20f48689","amp;dn":"Nils+landgren+%26+Joe+Sample+Creole+Love+Call+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"87468814bdf7b865c722207592d00f9d20f48689","infoHashBuffer":{"type":"Buffer","data":[135,70,136,20,189,247,184,101,199,34,32,117,146,208,15,157,32,244,134,137]},"announce":[],"urlList":[]}}