{"title":"Mastering AutoCAD 2010 and AutoCAD LT 2010","uid":6499964,"size":21247043,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:87afed6f592d1d2e2ff0f9958205006dbe9edf59&amp;dn=Mastering+AutoCAD+2010+and+AutoCAD+LT+2010&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"_F1_","files":-1,"time":1309212608,"description":"An award-winning author presents a detailed tutorial covering every feature of this popular program\nEach year, Mastering AutoCAD appears at the top of the AutoCAD book sales charts; it's the world's all-time bestselling series on the AutoCAD design software. This revision thoroughly covers all the new features and gives you a complete education in AutoCAD and AutoCAD LT.\n\nWhether you're an architect or drafter, involved in another discipline that uses CAD software, or an AutoCAD instructor, you'll benefit from Omura's comprehensive coverage.\n\nAward-winning Autodesk Authorized Author, George Omura, has written more than 20 books on AutoCAD\nUses concise explanations, focused examples, step-by-step instructions, and hands-on projects to fully cover both AutoCAD and AutoCAD LT\nIntroduces the basics of the interface and drafting tools, then moves into intermediate skills such as effectively using hatches, fields, and tables\nElaborates on the more important skills for real world applications like layouts, plotting, and quick 3D modeling\nShowcases the newest features including parametric design, free-form 3D mesh modeling, and enhanced PDF support\nDetails advanced skills including attributes, dynamic blocks, drawing curves, and macro programming\nExplores 3D modeling and imaging, and discusses customization and integration\nDVD includes video tutorials, a searchable PDF of the book, &quot;before and after&quot; tutorial files, a trial version of AutoCAD 2010, and additional tools and utilities\n\nMastering AutoCAD 2010 and AutoCAD LT 2010 is equally effective as a tutorial and a stand-alone reference for this extremely popular technical drawing software.","torrent":{"xt":"urn:btih:87afed6f592d1d2e2ff0f9958205006dbe9edf59","amp;dn":"Mastering+AutoCAD+2010+and+AutoCAD+LT+2010","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"87afed6f592d1d2e2ff0f9958205006dbe9edf59","infoHashBuffer":{"type":"Buffer","data":[135,175,237,111,89,45,29,46,47,240,249,149,130,5,0,109,190,158,223,89]},"announce":[],"urlList":[]}}