{"title":"RISE AGAINST DISCOGRAPHY [FUDGESOCIETY]","uid":5471873,"size":271711810,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:87fcd42982e2aee46fda04f4c33cef65fa3232fa&amp;dn=RISE+AGAINST+DISCOGRAPHY+%5BFUDGESOCIETY%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"FudgeSociety","files":-1,"time":1269935059,"description":"Rise Against Discography\n\nUnlike the other popular torrent, mine is completely organized.\n\nINCLUDES:::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::\n\nALBUMS:\n-Generation Lost\n-Revolutions Per Minute\n-Siren Song Of The Counter Culture\n-The Sufferer And The Witness\n-The Unraveling\n-Appeal To Reason\n:::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::\n\nRise Against is an American punk rock band from Chicago, Illinois, formed in 1999. Their current lineup consists of Tim McIlrath (vocals, guitar), Joe Principe (bass guitar), Brandon Barnes (drums), and Zach Blair (guitar), all of whom are straight edge (excluding Barnes) PETA supporters and strict vegetarians/vegans. The band is currently signed to Geffen, a record label owned by Universal Music Group. As of 2010, Rise Against has released five studio albums, two EPs, and one DVD.\n\nRise Against spent its first five years signed to the independent record label Fat Wreck Chords, on which it released two studio albums. The band gained mainstream popularity with its first two releases on Geffen, Siren Song of the Counter Culture (2004) and The Sufferer &amp; the Witness (2006), which produced several high-charting singles, including &quot;Swing Life Away&quot;, &quot;Prayer of the Refugee&quot;, and &quot;The Good Left Undone&quot;. Their most recent studio album, Appeal to Reason, was released in North America on October 7, 2008, peaking at number three on the U.S. Billboard 200 and producing the singles, &quot;Re-Education (Through Labor)&quot;, &quot;Audience of One&quot;, and &quot;Savior&quot;.\n\n:::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::\nFUDGESOCIETY NOTE\n:::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::\nI'm personally not a fan of Live albums, and greatest hits. Because it's honestly redundant. Why have more than what you need unless you're a die hard fan. And if you're a die hard fan of a band, you wouldn't be torrenting their music. You would be supporting and buying, which I still support for every band album I upload. I promote torrenting, seeing if the band is good, then going out and buying the album. In no way do I promote the soul use of my torrents without intent to buy the album. Don't ruin the internet for us, these torrents are just a way to see how a band sounds, and find any missing tracks that you might not have.\n\nThank you and please seed. The support of my torrents, will greatly increase the amount of uploading I do. More seeds, more torrents, more smileys! :D","torrent":{"xt":"urn:btih:87fcd42982e2aee46fda04f4c33cef65fa3232fa","amp;dn":"RISE+AGAINST+DISCOGRAPHY+%5BFUDGESOCIETY%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"87fcd42982e2aee46fda04f4c33cef65fa3232fa","infoHashBuffer":{"type":"Buffer","data":[135,252,212,41,130,226,174,228,111,218,4,244,195,60,239,101,250,50,50,250]},"announce":[],"urlList":[]}}