{"title":"The N Word","uid":4542589,"size":859827406,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:8847136f9fb092a27d59f7634aa7fe22c3f2e50f&amp;dn=The+N+Word&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"jose3030","files":1,"time":1227999077,"description":"Synopsis: A documentary look at the cultural significance of the weighty, historically volatile &quot;n word,&quot; this program features interviews with a variety of cultural figures, including Chuck D, Wynton Marsalis, Dr. Todd Boyd, Samuel Jackson,...  A documentary look at the cultural significance of the weighty, historically volatile &quot;n word,&quot; this program features interviews with a variety of cultural figures, including Chuck D, Wynton Marsalis, Dr. Todd Boyd, Samuel Jackson, Bryant Gumbel, Whoopi Goldberg, Talib Kweli, and many others. An enlightening and in-depth look at a crucial topic, the film examines the history of the word and its uses, which range from a term of endearment to an abhorrent insult, as well as the personal experiences of many people.\n\n*****\n\nIt&amp;#039;s one of the English language&amp;#039;s most inflammatory pejoratives and has lingered like a smoldering fire in America&amp;#039;s collective consciousness for more than 100 years. This illuminating documentary looks at the &quot;n&quot; word&amp;#039;s history and ever-changing usage -- which runs the gamut from a repugnant slur to a term of endearment. A slate of celebrities and other familiar figures are interviewed, including Quincy Jones, Samuel L. Jackson and Chris Rock.","torrent":{"xt":"urn:btih:8847136f9fb092a27d59f7634aa7fe22c3f2e50f","amp;dn":"The+N+Word","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8847136f9fb092a27d59f7634aa7fe22c3f2e50f","infoHashBuffer":{"type":"Buffer","data":[136,71,19,111,159,176,146,162,125,89,247,99,74,167,254,34,195,242,229,15]},"announce":[],"urlList":[]}}