{"title":"Learn Raspberry Pi with Linux (Apress, 2012, 1430248211)","uid":8304249,"size":9423802,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:887c0b2c99598bcb2f4b51d99936f8b94310ab4f&amp;dn=Learn+Raspberry+Pi+with+Linux+%28Apress%2C+2012%2C+1430248211%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":1,"time":1364328895,"description":"Length: 280 pages\nPublisher: Apress; 1 edition (December 21, 2012)\nLanguage: English\nISBN-10: 1430248211\nISBN-13: 978-1430248217\n\nLearn Raspberry Pi with Linux will tell you everything you need to know about the Raspberry Pi's GUI and command line so you can get started doing amazing things. You'll learn how to set up your new Raspberry Pi with a monitor, keyboard and mouse, and you'll discover that what may look unfamiliar in Linux is really very familiar. You'll find out how to connect to the internet, change your desktop settings, and you'll get a tour of installed applications.\n\nNext, you'll take your first steps toward being a Raspberry Pi expert by learning how to get around at the Linux command line. You'll learn about different shells, including the bash shell, and commands that will make you a true power user.\n\nFinally, you'll learn how to create your first Raspberry Pi projects:\n* Making a Pi web server: run LAMP on your own network \n* Making your Pi wireless: remove all the cables and retain all the functionality  \n* Making a Raspberry Pi-based security cam and messenger service: find out who's dropping by\n* Making a Pi media center: stream videos and music from your Pi\n\nRaspberry Pi is awesome, and it's Linux. And it's awesome because it's Linux. But if you've never used Linux or worked at the Linux command line before, it can be a bit daunting. Raspberry Pi is an amazing little computer with tons of potential. And Learn Raspberry Pi with Linux can be your first step in unlocking that potential.\n\nWhat youGÃ‡Ã–ll learn\n* How to get online with Raspberry Pi\n* How to customize your Pi's desktop environment\n* Essential commands for putting your Pi to work\n* Basic network services - the power behind what Pi can do\n* How to make your Pi totally wireless by removing all the cables\n* How to turn your Pi into your own personal web server\n* How to turn your Pi into a spy\n* How to turn your Pi into a media center\n\nWho this book is for\n\nRaspberry Pi users who are new to Linux and the Linux command line.\nTable of Contents\n1: Your First Bite of Raspberry Pi\n2: Surveying the Landscape\n3: Getting Comfortable\n4: The File-Paths to Success\n5: Essential Commands\n6: Editing Files on the Command Line\n7: Managing Your Pi\n8: A LAMP of Your Own\n9: WiPi: Wireless Computing\n10: The Raspberry sPi\n11: Pi Media Center\t","torrent":{"xt":"urn:btih:887c0b2c99598bcb2f4b51d99936f8b94310ab4f","amp;dn":"Learn+Raspberry+Pi+with+Linux+%28Apress%2C+2012%2C+1430248211%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"887c0b2c99598bcb2f4b51d99936f8b94310ab4f","infoHashBuffer":{"type":"Buffer","data":[136,124,11,44,153,89,139,203,47,75,81,217,153,54,248,185,67,16,171,79]},"announce":[],"urlList":[]}}