{"title":"Batman:  Shadow Of The Bat (Complete) (No ads)","uid":7849341,"size":748731993,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:899bae77db995df6493735e6ffc541589e1e2152&amp;dn=Batman%3A++Shadow+Of+The+Bat+%28Complete%29+%28No+ads%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SplhcbPrime","files":-1,"time":1353559844,"description":"Batman:  Shadow of the Bat was a comic book series featuring Batman, published by DC Comics. The series ran for 96 issues, from 1992 to 2000. The stories took place in Batman's then-current continuity along with Detective Comics and Batman, in contrast to Batman:  Legends of the Dark Knight, which focused on Batman's early years. Batman:  Shadow of the Bat looked into the [sometimes bizarre] psyche of the various cast members of the Batman comics.\n\nBatman:  Shadow of the Bat was started with the four-part storyline, Batman:  The Last Arkham, which also saw the introduction of several new characters. Issues 73 and 74 were a part of the most cool Batman:  Cataclysm storyline, a top vote-getter for the Comics Buyer's Guide Fan Award for Favorite Story for 1999. Issues 83 through 94 were parts of the No Man's Land storyline that won the Comics Buyer's Guide Fan Award for Favorite Story of 2000. Issue 80 and Azrael 47 comprised a special flip-book, the first of its kind. The 1000000 issue was a part of the DC One Million storyline, which was another top vote-getter for the Comics Buyer's Guide Fan Award for Favorite Story for 1999. Fifty of the series' 96 monthly issues were part of various crossovers with other titles. The majority of the issues were written by writer Alan Grant, notable for his work on Batman, in the 1990s. Batman:  Shadow of the Bat was canceled at the end of the No Man's Land storyline, and was immediately replaced with Batman:  Gotham Knights.\n\nNOTE:  These are not my scans.  All praise and glory to the original scanners (and authors/artists/publishers,) please.\n\nEnjoy, and please seed.\n","torrent":{"xt":"urn:btih:899bae77db995df6493735e6ffc541589e1e2152","amp;dn":"Batman%3A++Shadow+Of+The+Bat+%28Complete%29+%28No+ads%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"899bae77db995df6493735e6ffc541589e1e2152","infoHashBuffer":{"type":"Buffer","data":[137,155,174,119,219,153,93,246,73,55,53,230,255,197,65,88,158,30,33,82]},"announce":[],"urlList":[]}}