{"title":"More than Complete DC from Z to A 002 wz-woo (joshua13","uid":4588665,"size":12721421285,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:8a2656fd014c4c21fa7d318ff767f8bd335c8e26&amp;dn=More+than+Complete+DC+from+Z+to+A+002+wz-woo+%28joshua13&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":4,"uploader":"joshua13","files":471,"time":1229737935,"description":"This second installment is: Wz-Woo\n\n\nOmitted titles are reprints. The stories will appear in the original comics. The covers are included here. As an insane completist I would include them but they tend not to be scanned or shared, being duplicate material. I think some f them have value as &quot;Best of&quot; collections, others are just  collected issues of a story line.\n\nWrath of the Spectre TPB (Omitted).jpg\nWrath of the Spectre (Adventure Comics Reprints)(Early 1970s)\nWow Comics-because of Mary Marvel of the Marvel Family (Fawcett\nWorlds Collide (This is DC/Milestone as part of a crossover event)\nWow Comics 055(i) Mary Marvel (Fawcett UK)\nWorld's Greatest Super-Heroes, The HC (Omitted).jpg\nWorld's Finest-Our Worlds At War (2001)\nWorld's Finest Comics Archives v3 HC (Omitted).jpg\nWorld's Finest TPB\nWorld's Finest (1990)-Covers only but the story matter is in the above TPB\nWorld's Finest Comics Archives v2 HC (Omitted).jpg\nWorld's Finest Comics Archives v1 HC (Omitted).jpg\nWorld's Finest Comics (1941-1985)\nWorld's Best Comics Silver Age Sampler (Omitted).jpg\nWorld's Best Comics Golden Age Sampler (Omitted).jpg\nWorld Without End\nWorld's Best Comics 001 (Fiche)(Spring 1941) - aka World's Finest Comics 001\nWorld Without End\nWorld of Smallville, The (1988)\nWorld of Metropolis, The (1988)\nWorld of Krypton, The (1987)\nWorld of Krypton\n\nAll are complete. The UK WOW issue is just provided as a curiosity as the Mary Marvel stories in the UK were the same one published in the US.\n\nBonus\n\tA collection of reprints scan of batman and superman stories from World's Finest. Some of the old issues are fiche or just not as clear and sharp as they could be so some people like the reprints for reading. I throw in what I have.\n\n\nSeefor full description  and introduction\n\nThe following is a new addition to the intro\n\nGuidelines\nII\n    A\n          2)  Clarification on content of this project based on questions after the first torrent. \n\t        a) The rule for non-DC series (meaning Pre-DC) is loosely this: &quot;Was this title acquired by and then published by DC?&quot; If so issues prior to DC are &quot;Ret-Published&quot; (like Ret-Con) to be DC titles. The perfect example is Blackhawk. Quality Comics published v1 001-107. DC bought it and continued it as a DC title at #108-273. The Quality issues will be incliuded. Any title DC bought  but never published will not be included. The rule for characters, as opposed to titles is loosely &quot;Did this character get absorbed into the DC universe, or did s/he become a regularly published DC character?&quot;. If so comics containing that character published before DC (BDC)  will be included. A perfect example is Plastic Man. DC published him in various titles, so the prior adventures of Plastic Man in non DC comics will be included.\n\t     b) Counter examples. Star Trek. DC licensed the rights to publish Star Trek comics for a time, as have several companies, but no specific tile or character was &quot;acquired&quot; by DC and these characters did not become a part of the DC Universe, so issues BDC and post DC also in this case, will not be included.  Somebody DC did a single mini or one shot with or a couple of guest appearances will also not be included (except for those specific appearances.  Some comics are just guest appearances, or a series &quot;grafted on&quot; for a time other things became &quot;part of the family&quot;\n\nFeel free to cross post this other places if you know how and are so inclined\n\n13\n\nYou can see my other torrents\nat demonoid\n\n\nor  h33t\n\n\nThe lists should be (but aren't) the same.\n\n=======================================================================\nThanks to Scanners, Original Uploaders and Seeders - We need you all!\nBut thanks most of all to the seeders-the thankless anonymous\nchore that make the work of the scanners and uploaders multiply!\nBetter than a thousand thank-you comments is the seeder to me!\nEveryone can seed! \n=======================================================================\n\nSee Yah!\n","torrent":{"xt":"urn:btih:8a2656fd014c4c21fa7d318ff767f8bd335c8e26","amp;dn":"More+than+Complete+DC+from+Z+to+A+002+wz-woo+%28joshua13","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8a2656fd014c4c21fa7d318ff767f8bd335c8e26","infoHashBuffer":{"type":"Buffer","data":[138,38,86,253,1,76,76,33,250,125,49,143,247,103,248,189,51,92,142,38]},"announce":[],"urlList":[]}}