{"title":"Mr. Mister - Welcome to the Real World  (MP3@320) [FrankFoo]","uid":11070840,"size":107437389,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:8a949220ef1ca39a8801b60202e46985aec5f4c6&amp;dn=Mr.+Mister+-+Welcome+to+the+Real+World++%28MP3%40320%29+%5BFrankFoo%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"FrankFoo2","files":-1,"time":1411261702,"description":"\nMr. Mister - Welcome to the Real World (MP3@320)\n\n\nLinage: CD &gt; EAC &gt; flac &gt; dbPoweramp &gt; MP3\n\nIncluded: NFO, PLS, M3U\nCovers: Front \nTags: ID3 v1.1, ID3 v2.3\n\n\nTrack List:\n\n01. Black/White\n02. Uniform Of Youth\n03. Don't Slow Down\n04. Run To Her\n05. Into My Own Hands\n06. Is It Love\n07. Kyrie\n08. Broken Wings\n09. Tangent Tears\n10. Welcome To The Real World\n\nPlaying Time.........: 42:26\n\nReview\n\nFollowing the brisk New Wave/rock of I Wear The Face, with &quot;Hunters Of The Night,&quot; Mr. Mister (creative name, huh?) made their best-known album, which contains a more streamlined version of the hybrid electropop/rock sound, where a grinding guitar was meshed in with airy synths. \n\nWelcome To The Real World yielded their only three Top Ten singles, two of which would hit #1. \n\nThey benefitted from lead vocalist/bassist Richard Page with his tempered but pleading voice, keyboard/vocalist Steve George, who were also sessions vocalists for bigger artists, Steve Farris's fiery guitars, and Pat Mastelotto's power drums. A good combination.\n\n&quot;Black/White&quot; with its meshed keyboards and bombastic guitar and 80's keyboard theatrics, could've been a single. \nActually, it might've been the followup to &quot;Is It Love,&quot; but if it was, it tanked. Shouldn't have, as it's not all bad.\n\nInstead of wearing the face, Mr. Mister sings of wearing the &quot;Uniform Of Youth,&quot; a call to parents from children. \nWith the anthemic drums and lyrics, as well as the skittery keyboards, again, another possible single. \nThere's a resigned feeling in this song, asking to be respected for individuality, \nbut also a request to parents: &quot;no one said the world was fair/all I want is for you to care.&quot;\n\n&quot;Run To Her&quot; could've been another single, as it's a quiet synth ballad emphasizing Page's softer vocals, which is up a register from normal.\n\nClearly enough thought of Page's pleading vocals and those fiery guitar bursts in the moody ballad &quot;Broken Wings,&quot; with its airy synth and bassline. \n\nIt made the #1 spot, but signalled the beginning of their fifteen minutes, something encompassed only within this album.\nBetween the three singles, this is my favourite.\n\nWith &quot;Kyrie&quot;'s power guitars, drums, catchy chorus, Mr. Mister got their second and last #1 hit, on the concept of following one's chosen road. \n\nHowever, any religious themes (kyrie eleison meaning &quot;lord have mercy&quot;) is clearly non-existent, as they clearly used its syllabry as something could be hit-single material.\n\nAs for &quot;Is It Love,&quot; the brisk opening keyboard exercise and the funky bassbeat helped it become one of the more singleworthy tracks. \n\nIt too hit the Top Ten, and it deserved to, but it did so basking in the warmth of &quot;Kyrie.&quot;\n\n&quot;Tangent Tears&quot; is a mixture of pop keyboards with some guitar in parts. \n\nHearing the chorus lends doesn't surprise me that early 80's electropop lasted this long, as it reminds me of Johnny Hates Jazz's &quot;Shattered Dreams.&quot;\n\nThe title track is a throwback to their earlier album, a catchy a-ha-like number, and is sung to a newborn, one-part welcoming, one-part warning that out there, there's so much to learn and that it's &quot;so much colder than your own soft glance.&quot;\n\nThey would have one more album, Go On, with the single &quot;Something Real (Inside Me/Inside You)&quot; and their own rendition of &quot;Watching The World,&quot; done earlier by Chaka Khan. \n\nA good album, but there could've been more singles mined from here. \n\nA FrankFoo Original Rip\n\n\nMultiTracker @ FrankFoo\n","torrent":{"xt":"urn:btih:8a949220ef1ca39a8801b60202e46985aec5f4c6","amp;dn":"Mr.+Mister+-+Welcome+to+the+Real+World++%28MP3%40320%29+%5BFrankFoo%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8a949220ef1ca39a8801b60202e46985aec5f4c6","infoHashBuffer":{"type":"Buffer","data":[138,148,146,32,239,28,163,154,136,1,182,2,2,228,105,133,174,197,244,198]},"announce":[],"urlList":[]}}