{"title":"Allah Is Known Through Reasons","uid":4106880,"size":5068623,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8aab1b3735e443a08fe1718f75b064a2fd479a64&amp;dn=Allah+Is+Known+Through+Reasons&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"AMMAR1111","files":3,"time":1206850132,"description":"Title : ALLAH IS KNOWN THROUGH REASON \nAuthor : HARUN YAHYA \n\nTake a look around you from where you sit. You will notice that everything in the room is ?made?: the walls, the upholstery, the ceiling, the chair where you sit, the book you hold in your hand, the glass on the table and countless other details. None of them happen to exist in your room of their own accord. Even the simple loops of the carpet were made by someone: they did not appear spontaneously or by chance. \n\nA person who is about to read a book knows that it has been written by an author for a specific reason. It would not even occur to him that this book might have come into being by chance. In the same manner, a person who sees a sculpture has no doubt whatsoever that it was made by a sculptor. And not just works of art: even a few bricks resting on top of one another make one think that they must have been brought to rest just so by someone within a certain plan. Therefore, everywhere where there is an order ? either small or big ? a founder and protector of this order must also exist. If, one day, somebody came forward and said that raw iron and coal came together to form steel by chance, which in turn constructed the Eiffel Tower again by chance, would not he and those who believed him be regarded as insane? ","torrent":{"xt":"urn:btih:8aab1b3735e443a08fe1718f75b064a2fd479a64","amp;dn":"Allah+Is+Known+Through+Reasons","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8aab1b3735e443a08fe1718f75b064a2fd479a64","infoHashBuffer":{"type":"Buffer","data":[138,171,27,55,53,228,67,160,143,225,113,143,117,176,100,162,253,71,154,100]},"announce":[],"urlList":[]}}