{"title":"Love Lift Me by Synthia St. Claire","uid":9622141,"size":254219,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8b59baaa10224a2f7f8d403fb3eef80d86e043e5&amp;dn=Love+Lift+Me+by+Synthia+St.+Claire&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"PirateBook","files":1,"time":1392518968,"description":"\n&quot;I couldn't put my finger on it until I saw you sitting on the end of that pier, Kat. It was like...&quot; He pressed his body against mine and his explorations grew more intense. I felt his hot breath tickle at the thin skin behind my ear before his lips closed together and kissed me there. &quot;...like I'd lost someone that made me feel something amazing. Something real...and then I found her all over again. And now, here you are. With me.&quot;\n\n---\n\nKatherine Atwater was about to start her new life, but instead she's headed back. Back home. Back to her cancer-stricken mother. Back to a lover who lied and tore her heart to pieces.\n\nAttorney Shane Logan is going the same way, on the same bus, and preparing to try the biggest case of his career. He didn't expect to find a woman like Kat on this trip. He never imagined he'd be saving her life.\n\nAfter barely surviving the accident, Kat wonders if she'll ever again see Shane, the handsome man with soulful amber eyes who rescued her. A hero was just what she needed. The sound of his voice stirred up the most wonderful, longing ache inside of her she'd ever felt. Somehow, with him, all of her troubles seemed to lift away.\n\nTo Kat's surprise, Shane finds his way to her small town. He's come to risk it all righting the wrongs of a greedy billionaire and his gorgeous, deceitful daughter, but will Shane risk taking a chance with the girl he saved?\n\nGenre: Romance","torrent":{"xt":"urn:btih:8b59baaa10224a2f7f8d403fb3eef80d86e043e5","amp;dn":"Love+Lift+Me+by+Synthia+St.+Claire","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8b59baaa10224a2f7f8d403fb3eef80d86e043e5","infoHashBuffer":{"type":"Buffer","data":[139,89,186,170,16,34,74,47,127,141,64,63,179,238,248,13,134,224,67,229]},"announce":[],"urlList":[]}}