{"title":"Hatsune Miku Live MIKUNOPOLIS 2011 - x264 aac JAP BDrip [tntvill","uid":7009400,"size":4174314368,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:8be9c877a5fe2f29b8ce011f09be8baa3661c18c&amp;dn=Hatsune+Miku+Live+MIKUNOPOLIS+2011+-+x264+aac+JAP+BDrip+%5Btntvill&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"salvoiorfida","files":-1,"time":1328389626,"description":"\n[url]http://i.imgur.com/OYtB4.jpg[/url]\n\nHatsune Miku is a fictional vocaloid character created by Crypton Future Media and popularized by Sega in their PSP, PS3, and arcade console Project Diva games. With literally hundreds of songs and albums created by studios and independent artists using Miku's vocaloid talents, her musical proliferation (and vocaloid in general) in Japan is larger than Elvis, the Beatles, Michael Jackson, Rolling Stones, Madonna, Britney Spears, and Lady Gaga combined!\n\nThis had to be the most unique concert I ever had the pleasure of watching. While showing projections/images on a screen is a not too uncommon occurrence in a concert, this took it to a whole different dimension.\n\nThere is a synergy between Miku, who is projected from behind onto a translucent screen, the band playing live in-time with her energetic motion-captured performance, and the audience's participation and enthusiasm.\n\nThe translucent projection gives Miku a glowing aura making the CG rendering crisp and vivid. The glow sticks from the fans reflect off the screen making it appear she is surrounded in a sea of them. The projection lamps from behind act as spotlights and flares when the cameras are positioned head-on. With the transparent background Miku is given the illusion that she is supporting herself and the laws of physics seem to apply all the more believably; she is no longer a computer generated character in a pixilated world on a black movie screen, but becomes a brief suspension of a living breathing person crossing the proverbial threshold of substance. And when the line between imagination and reality blurs, mesmerization is inevitable.\n\nMiku is treated as though she is real by both the band and the audience. And the presentation does not make it difficult to almost believe that she is. She is the center of attention (along with Luka, Rin, and Len in various appearances). It's admirable how the band members stay back and allow all attention go to a fictitious character while the audience cheers her on and waves their arms and glow sticks in response to her pre-programmed yet life-like performance. \n\n[img]http://s16.postimage.org/4k6p32t79/di_6_ZX6.jpg[/img]\n\n[img]http://s13.postimage.org/gb303ffhz/di_66_O9.jpg[/img]\n\nDettagli:\n\nLingue: Japponese - Inglese\nFormato Video: x264 16:9 1920 x 1080 pixel\nFormato Audio: aac 6 ch Dolby 448 kbs VBR\nDimensione : 4 gigabytes in totale circa\nfps=29.970\n\nFor More , please visit: &lt;a href=&quot;\nhttp://tntvillage.tk&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://tntvillage.tk&lt;/a&gt;\n---------------------------------","torrent":{"xt":"urn:btih:8be9c877a5fe2f29b8ce011f09be8baa3661c18c","amp;dn":"Hatsune+Miku+Live+MIKUNOPOLIS+2011+-+x264+aac+JAP+BDrip+%5Btntvill","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8be9c877a5fe2f29b8ce011f09be8baa3661c18c","infoHashBuffer":{"type":"Buffer","data":[139,233,200,119,165,254,47,41,184,206,1,31,9,190,139,170,54,97,193,140]},"announce":[],"urlList":[]}}