{"title":"RPG Bonds of the Skies v1.0.4g","uid":8752508,"size":33148223,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:8c4db15a9b2d505245866b1e99ecbfcd57e25a90&amp;dn=RPG+Bonds+of+the+Skies+v1.0.4g&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Androider","files":-1,"time":1375064510,"description":"\n'Bonds of the Skies' is now available! Join a range of characters, each with their own distinct personalities, as they travel with the gods through the expansive world of this adventure RPG!\n\nTimes are changing, and the existence of the Grimoas (gods) has become less relevant in everyday life. Eil, the main character of the story, is in the middle of his Coming-of-Age ceremony, conducted by the Priest of his town, when suddenly the town is attacked by a demon and engulfed in flames.\n\nIn the midst of this confusion, Eil enters into a pact with the Air Grimoa, Nogard, in order to save everyone.\nEil and Nogard set off to look for the demon who cast the town into a sea of flames, and to find other Grimoas in order to put a stop to the demon's violence.\nThe game features a wide range of achievements, including quests and collecting items!\n\nBy obtaining Folklore Points (FLP), you can you can buy items to make your progress through the quest smoother, and you can challenge yourself further in extra dungeons.\n\nFeatures:\n\n- Make the characters your own by using skill sets!\nYou can customize the characters as you want by setting their skills- but be aware of the limited 'cost levels'!\n- Make use of more powerful skills by synchronizing the characters with the Grimoas!\nIf the Synchro Gauge with the Grimoas reaches 100% during battle, you can use special skills, more powerful than normal!\n- A daily points lottery\nYou can get one lottery ticket every 24 hours, and take part in the daily lottery!\nThere are gold, silver, bronze and normal prizes. The number of points you will gain depends on the prize you get.\n- The tutorial function makes play easy even for beginners!\nThere are tutorials for how to conduct battles and how to search for items, etc., so you don't have to be an expert to enjoy the game!\n- A wide range of purchasable items!\nThere are many items that can be purchased. Of course there are items to support you on the quest, but there are also many extra items to make the game even more enjoyable!\n\nMore info:\n &lt;a href=&quot;\nhttps://play.google.com/store/apps/details?id=kemco.hitpoint.folklore&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://play.google.com/store/apps/details?id=kemco.hitpoint.folklore&lt;/a&gt;\n","torrent":{"xt":"urn:btih:8c4db15a9b2d505245866b1e99ecbfcd57e25a90","amp;dn":"RPG+Bonds+of+the+Skies+v1.0.4g","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8c4db15a9b2d505245866b1e99ecbfcd57e25a90","infoHashBuffer":{"type":"Buffer","data":[140,77,177,90,155,45,80,82,69,134,107,30,153,236,191,205,87,226,90,144]},"announce":[],"urlList":[]}}