{"title":"Art Text v. 2.4 with Core keygen","uid":6633854,"size":61994756,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:8c5b945763c3d51c6b9c75d83f5a3ba028d14656&amp;dn=Art+Text+v.+2.4+with+Core+keygen&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"polisdavid","files":-1,"time":1314469205,"description":"Official Web Site: &lt;a href=&quot; http://www.belightsoft.com/products/arttext/overview.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.belightsoft.com/products/arttext/overview.php&lt;/a&gt;\n\nWhere Text Becomes an Art\n\nArt Text is a Mac OS X application for creating high quality textual graphics, headings, logos, icons, web site elements and buttons. Thanks to multi layer support creating complex graphics is no sweat. Use the result with Apple iWork, iWeb, Microsoft Office, BeLight applications, and various other text edit and web design programs.\n\nWhy use Art Text?\n\n* Headings and other text graphics created with Art Text will make\n  business presentations catchy.\n\n* Attractive buttons and cool titles will make your web site look stylish\n  and professional.\n\n* Various logos and icons can be easily created to enrich your brochures,\n  flyers and postcards.\n\nCreative Headings\nWhether you're an advertising manager or a small business owner, you'll find Art Text to be a powerful tool. Create compelling text for your advertisements, brochures, letterheads, newsletters and more. Spice up these documents by designing decorative graphics that are sure to impress others.\n\nStriking Web Buttons and Icons\n\nIf you're creating a website for a business or your personal needs, Art Text has all of the tools you need. The 250 editable materials and 600 supplied vector icons and shapes will give you a quick start to getting your site up and running, or create your own web graphics effortlessly with the help of multiple layers.\n\nUnique LogosUnique Logos for Your Business\n\nA logo often creates a strong association with your business in the minds of customers. You want your logo to make a statement. Design your company's logo right in Art Text and make it unique by taking advantage of 100 additional fonts (Extras Pack only) and the large library of shapes included in the program.\n\nWhat's New:\n\n* OS X 10.7 Lion and its features, such as full-screen mode and versions,\n  are now supported;\n\n* 60+ new templates and shading materials;\n\n* Introduced the ability to split or edit shapes consisting of combined\n  layers;\n\n* Added two new transformation types;\n\n* Improved shading materials;\n\n* Improved user experience in Edit as Shape dialog;\n\n* Several assistant issues fixed;\n* Solved the issue with Revert button in Custom shape editor dialog;\n\n* Several issues of Layers Panel dialog has been resolved;\n\n* Fixed the problem with tiled texture fill when an object is rotated.\n\nSystem Requirements:\n\nMac OS X.4.11 and up\n\n--- PLEASE SEED ---","torrent":{"xt":"urn:btih:8c5b945763c3d51c6b9c75d83f5a3ba028d14656","amp;dn":"Art+Text+v.+2.4+with+Core+keygen","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8c5b945763c3d51c6b9c75d83f5a3ba028d14656","infoHashBuffer":{"type":"Buffer","data":[140,91,148,87,99,195,213,28,107,156,117,216,63,90,59,160,40,209,70,86]},"announce":[],"urlList":[]}}