{"title":"Guilty_by_Association-2014-07-07-720p.mp4","uid":10510456,"size":987995984,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:8c93367d798038680bf6a4d9dbeb5f549b3adc1f&amp;dn=Guilty_by_Association-2014-07-07-720p.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"snippersniffer","files":1,"time":1404842281,"description":"Duration: 55 minutes\n\nAlex has been charged with a murder committed by a friend in a spontaneous fight; Wayne has been convicted of possessing a firearm he never touched; Joseph is serving a life sentence for a murder he didn't even see. All of them have been convicted using the law of joint enterprise, under which a person in a group or gang can be held responsible for the criminal acts of others.\n\nJoint enterprise is a 300-year-old law which has been increasingly used in recent years to combat the rise in gang violence. Its supporters argue that it ensures that those who encourage violent crimes are held responsible for their actions and that it deters further violence. It has been used to secure convictions in a number of high-profile murder cases, including two of the killers of Stephen Lawrence and the three murderers of Ben Kinsella. Others argue that it is leading to wrongful convictions of people who were only on the periphery of a crime, but who will, nevertheless, be sentenced to mandatory life sentences.\n\nThis documentary follows the story of Alex's family after his arrest and during his trial for murder at the Old Bailey and also examines the cases of Wayne and Joseph. We speak to defence lawyers, prosecutors and also to the families of victims, including the Kinsellas, who believe that without joint enterprise their children's killers would have walked free. The programme raises questions about how we deal with group violence, what makes a murderer and whether we are locking young people away on life sentences for crimes they did not commit. \n","torrent":{"xt":"urn:btih:8c93367d798038680bf6a4d9dbeb5f549b3adc1f","amp;dn":"Guilty_by_Association-2014-07-07-720p.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8c93367d798038680bf6a4d9dbeb5f549b3adc1f","infoHashBuffer":{"type":"Buffer","data":[140,147,54,125,121,128,56,104,11,246,164,217,219,235,95,84,155,58,220,31]},"announce":[],"urlList":[]}}