{"title":"Karateka v1.0 Portable (registred)","uid":7976317,"size":897178928,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:8e8d4c12ae3f4a264e8bc7de91a34ec4a85fa28b&amp;dn=Karateka+v1.0+Portable+%28registred%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"The_Duck1","files":-1,"time":1356996472,"description":"No need to install,\nNo need to put serials and cracks to get the full version, (already done it for you).\nNo unnecessary registry changes,\nNo boring installation of tool-bars in your browser,\nThis makes a portable version a better version.\n\nFrom PRINCE OF PERSIA creator Jordan Mechner, the original side-scrolling\nkarate classic comes to Steam with art by Jeff Matsuda (The Batman) and\nmusic by Grammy-winning composer Christopher Tin (CIVILIZATION IV\n\nWhether you are a nostalgic Karateka fan or new to the game, Karateka\nwill charm you with its classic love story set in feudal Japan. Fight to\nsave the lovely Mariko from the evil warlord Akuma and reunite her with\nher True Love\n\nFeatures\n\nRhythm-based combat mechanic. Easy to grasp yet challenging to master,\nthe cinematic gameplay seamlessly blends a series of escalating karate\nbattles with a simple human story\n\nThree playable characters. Three endings. Three suitors vie for Mariko's\nlove: A fearsome Brute, a noble Monk, and her brave True Love\n\nHighly replayable. Innovative three suitors system offers a compact\nsingle-playthrough experience, yet challenges advanced players to unlock\nmore difficult achievements and endings as their skill improves\n\nUnique real-time score by Christopher Tin tells the story through the\nmusic. Authentic Japanese instruments and themes let you &quot;hear&quot; the\nonscreen action in real time","torrent":{"xt":"urn:btih:8e8d4c12ae3f4a264e8bc7de91a34ec4a85fa28b","amp;dn":"Karateka+v1.0+Portable+%28registred%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8e8d4c12ae3f4a264e8bc7de91a34ec4a85fa28b","infoHashBuffer":{"type":"Buffer","data":[142,141,76,18,174,63,74,38,78,139,199,222,145,163,78,196,168,95,162,139]},"announce":[],"urlList":[]}}