{"title":"Cartoon - The World of David the Gnome - Disc 2 of 4","uid":4511361,"size":7146264623,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:8ebb5123e12b739d64ae68a49a8cd5fb030d53ed&amp;dn=Cartoon+-+The+World+of+David+the+Gnome+-+Disc+2+of+4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"cowboy23","files":28,"time":1226788335,"description":"There is already a set of DVD rips on Demonoid but figured I&amp;#039;d upload the actual full disc&amp;#039;s if anyone is interested. This disc contains episodes 7-12\n# Format: Region Free thanks to AnyDVD\n# Language English\n# Region: Region 2\n# Aspect Ratio: 1.33:1\n# Number of discs: 4\n\n7 &quot;To Grandfather&amp;#039;s House We Go&quot;\nDavid is expecting a visit from his granddaughter, Susan. In a deep part of the forest lives a real witch with her cat. Once the witch leaves for the day, her cat goes wandering in the woods. Lisa goes to pick up Susan, and they meet a friendly porcupine family. The witch&amp;#039;s cat sees the gnome house, and he knows the gnomes have mice as pets. But when he tries to get into David and Lisa&amp;#039;s house, he falls into the trap designed to catch small animals. Later that evening, David lets the cat out. The cat gets scared of Swift and runs back home. That night the witch comes home and listens to the cat&amp;#039;s adventures. This inspires her to write a story, &quot;Little Red Riding Hood&quot;.\n8 &quot;Ghost of the Black Lake&quot;\nThis episode begins with David explaining how gnomes make glass. Then he is called to the palace, where the king tells him about a little wizard named Tiraland. The wizard stole all of the gold in the castle, and now the trolls have thrown in into the eerie Black Lake. David has to ask permission to go to Black Lake from the ghost of Black Lake Castle. The ghost is a shape shifter, and agrees to let David go for only three days. David locates the gold with the help of an otter. The trolls have tied a rope around the gold bag and are about to pull it up. The otter removed the rope and ties it to a big rock. The trolls chase David and Swift, thinking they have the gold. Finally the trolls get scared by the ghost and give up the chase.\n9 &quot;Kingdom of the Elves&quot;\nThe episode starts out with David telling how gnomes make pottery and candles. When he goes outside, another gnome tells him that a little deer has a barbed wire around his neck and needs help. David calls for Swift, but Swift doesn&amp;#039;t come. He finds the fox a few feet away, but he is sick from eating poisoned food, a trap set by the trolls. David gives Swift some medicine and makes him better. Next David goes and cuts the wire from the deer&amp;#039;s neck. On the way back, David decides to go see Gustav, the king of the elves to help get revenge on the trolls. Gustav sends some of his little elf messengers to the lake and Swift lures the trolls there, by lying down and pretending to be dead. Once the trolls show up, the elves tease them, drag them through the water, and tie their tails together. David reminds the elves not to hurt the trolls, just tease them.\n10 &quot;The Magic Knife&quot;\nLisa&amp;#039;s sister, Julie, comes to visit, and she brings along a copy of a scalpel. Julie says the copy came from the Himalayas. David decides to journey there to find the original knife. When he is in the high mountains, he goes to see his human friend Pondent do Rey. Pondent is a wizard and with the help of his magic mirror, he tells David that the original knife is in the Temple of Meykong, an abandoned structure in India. David and Swift leave the Himalayas and go to the deep jungles of India. Once David enters the temple, he learns that not only was it built over an active volcano, it is guarded by Holler the troll and his army of spiders. Holler has the knife and verbally taunts David while the spiders chase after him. Eventually Holler throws the scalpel into a spider&amp;#039;s web. David gets it, then sprays Holler and the spiders with sneezing powder. While Holler is sneezing uncontrollably, he hits a lever that makes the volcano erupt. David escapes while the Temple of Meykong falls in. Holler gets out, although he is badly burned.\n11 &quot;Young Dr. Gnome&quot;\nDavid&amp;#039;s nephew Jonathan is coming to visit. Jonathan is a city gnome and his parents want him to be a doctor, but he doesn&amp;#039;t want to. On the way to David&amp;#039;s house, Jonathan meets a mischievous gnome named Martin, who asks the boy what&amp;#039;s wrong. When Jonathan tells him, Martin starts telling a rumor that David is sick and Jonathan is taking his place. The word spreads fast, and soon the other gnomes show up at David&amp;#039;s house, asking Lisa if David is sick. She tells them no. The gnomes all share stories about how David helped them in the past, and Jonathan decides he wants to be a doctor after all. Soon David returns home from letting a rabbit out of a trap. The gnomes are all celebrating when they hear a gunshot. They rush outside and learn that a little deer has been shot. While David goes to help the deer, the other gnomes try to scare off the hunter and his dog. Jonathan throws a rock at the dog, and the other gnomes trip the hunter with a rope. The hunter takes off running, but the dog comes back. David uses magic to scare off the dog for good. Once David removes the bullet from the deer, he sees the other gnomes with the hunter&amp;#039;s gun. He sees they will bury the gun so they won&amp;#039;t have to think of this bad time.\n12 &quot;Happy Birthday to You&quot;\nDavid tells about the childhood of gnomes, using his friend Harry and his family as an example. David tells about Harry&amp;#039;s children, Billy and Belle, and the way children grow up. It is also Billy and Belle&amp;#039;s birthday, and David takes Susan to the party. On the way, he helps a mother hen learn how to keep up with her chicks. Then they go to the party. While Susan plays party games with the other children, Harry takes David to the forest nearby and tells how he is sad because the men from the city are cutting down all the trees. When they go back to the party, they learn that the trolls have shown up. The trolls throw apples and sticks at the gnomes, and they all run into Harry&amp;#039;s house. David and Susan go back out and try to think of a way to get even with the trolls. They see the trolls asleep in a tree, and then a bulldozer from the city comes by. Some men take a chainsaw and cut down the tree, sending the trolls crashing to the ground. For once, David is thankful for the men cutting down trees.\n\nFor more information about the series check out Wikipedia http://en.wikipedia.org/wiki/The_World_of_David_the_Gnome\nPeers: 1 seeders, 0 leechers, 1 total","torrent":{"xt":"urn:btih:8ebb5123e12b739d64ae68a49a8cd5fb030d53ed","amp;dn":"Cartoon+-+The+World+of+David+the+Gnome+-+Disc+2+of+4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8ebb5123e12b739d64ae68a49a8cd5fb030d53ed","infoHashBuffer":{"type":"Buffer","data":[142,187,81,35,225,43,115,157,100,174,104,164,154,140,213,251,3,13,83,237]},"announce":[],"urlList":[]}}