{"title":"Enya - The Christmas EP 320cbr (Big Papi) 1994 Adult Contemporar","uid":9387901,"size":40390948,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:8ee21a9066bdf25912946b4619941b3ae58c321f&amp;dn=Enya+-+The+Christmas+EP+320cbr+%28Big+Papi%29+1994+Adult+Contemporar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Big-Papi","files":-1,"time":1387830528,"description":"Source: 1994 CD\n\nNot really that familiar with Enya's work but she must place alot of effort into her music because this release only has a few songs but costs $21 yikes- Big Papi\n\n\nBy Andrew Gallas\nThis &quot;Oiche Chiun&quot; EP is a gorgeous way of celebrating Christmas, and will surely be listened to all year long. There are five songs to this release, and the following will describe each one separately.\n1. &quot;Oiche Chiun (Silent Night)&quot; is the traditional Christmas carol made into an almost a capella song. Her trademark vocal crescendos and layering blend with her solo voice in an extraordinary masterpiece. A key change near the end of the song adds to the ethereal atmosphere.\n\n2. &quot;As Baile&quot; takes the background and melody from _Watermark_'s &quot;Exile&quot; but the vocals are really Gaelic incantation. The original piece &quot;Exile&quot; already gave the sense of winter, and Enya's remake does so even more vividly, showing that real words are unnecessary to create a feeling.\n\n3. &quot;'S Fagaim Mo Bhaile&quot; is a rare song of Enya's, in Irish Gaelic, about leaving home and wanting to return. Although this song may not make you visualize a happy Christmas morning, the hopelessness that can come from winter is conveyed.\n\n4. &quot;Ebudae&quot; is a familiar piece from _Shepherd Moons_ and was featured in the movie _The Toys_. Incantations and bell-like sounds project a more bright feeling.\n\n5. &quot;The Celts,&quot; the first song and title track from both _Enya_ and _The Celts_ is the last song on this album. For some reason, this song always makes me think of people in cloaks marching through the snow. I know that doesn't have much to do with Christmas, but that's what always comes to my mind. The energetic vocals seem to say, &quot;We have survived the winter and will prosper in the year to come!&quot;\n\nBarely over 15 minutes, this EP is quite brief, but is a wonderful CD to own and can be enjoyed year-round. Also, this would make a great Christmas gift for anyone who enjoys Irish Gaelic or any type of cultural music. Very well done!","torrent":{"xt":"urn:btih:8ee21a9066bdf25912946b4619941b3ae58c321f","amp;dn":"Enya+-+The+Christmas+EP+320cbr+%28Big+Papi%29+1994+Adult+Contemporar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8ee21a9066bdf25912946b4619941b3ae58c321f","infoHashBuffer":{"type":"Buffer","data":[142,226,26,144,102,189,242,89,18,148,107,70,25,148,27,58,229,140,50,31]},"announce":[],"urlList":[]}}