{"title":"FS2004 - Imagine Simulation - KLGA New York La Guardia, USA","uid":3682168,"size":13152393,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:8f3f117b10997c501f80e2b0bf31175318fb8d7f&amp;dn=FS2004+-+Imagine+Simulation+-+KLGA+New+York+La+Guardia%2C+USA&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"4X-AXG","files":1,"time":1178467959,"description":"h**p://www.imaginesim.com/klga01.htm\n\nAnother first for FS2004, a fully featured commercial add-on for Flight Simulator featuring New York La Guardia Airport. You will find right across the airport land area literally thousands of objects created with incredible accuracy and placed with the aid of pin-point satellite photography.\n\nThe airport features custom made runways, terminal buildings rendered to 5cm per pixel scale, smoothly operating jetways that dock with your aircraft?s forward door with an interactive docking system to park you right on your mark, taxiways with highly realistic concrete textures, full airport taxiway and runway signage, 3D approach lighting and full ILS navigation. There are hundreds of airport vehicles and ground personnel, aircraft can be found parked at custom textured parking positions, all hangers, cargo and airport auxiliary buildings are modelled,  there is even a perimeter fence - all under the steady gaze of intermittently placed security cameras!\n\nIn addition to all of this, KLGA looks stunning after dark with beautifully lit buildings and parking areas. Complete airport taxiway and runway lighting is also included.\n\n*Installer with serial*","torrent":{"xt":"urn:btih:8f3f117b10997c501f80e2b0bf31175318fb8d7f","amp;dn":"FS2004+-+Imagine+Simulation+-+KLGA+New+York+La+Guardia%2C+USA","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8f3f117b10997c501f80e2b0bf31175318fb8d7f","infoHashBuffer":{"type":"Buffer","data":[143,63,17,123,16,153,124,80,31,128,226,176,191,49,23,83,24,251,141,127]},"announce":[],"urlList":[]}}