{"title":"Jimi Hendrix - Blues (1994)Mp3[CR-Bt]","uid":4633985,"size":114014208,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:8ff323de030a8ffd751ecbba7c967a18abce8151&amp;dn=Jimi+Hendrix+-+Blues+%281994%29Mp3%5BCR-Bt%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"tathiana","files":11,"time":1231491311,"description":"Che Jimi Hendrix sia stato il piÃƒÂ¹ grande chitarrista rock che abbia mai calcato il suolo di questo nostro pianeta fin dalla notte dei tempi, ÃƒÂ¨ cosa ovvia e risaputa e nessuno, credo, oserebbe dubitarne. Ma ÃƒÂ¨ bene ricordarlo, come ÃƒÂ¨ bene ricordare che Jimi Hendrix non ÃƒÂ¨ stato solo il chitarrista rock e psichedelico, che, soprattutto in compagnia dei suoi Experience, ci ha lasciato quel trittico delle delizie, composto in sequenza da &quot;Are You Experienced?&quot;, &quot;Axis Bold As Love&quot; ed &quot;Electric Ladyland&quot;.\nLa formazione musicale di base di Hendrix ÃƒÂ¨ essenzialmente blues e questa splendida compilation, sebbene non ce ne fosse bisogno, lo dimostra ampiamente. Hendrix ha influenzato generazioni su generazioni di musicisti rock, ma anche rock-blues, il suo modo di suonare la chitarra ha fatto scuola, la sua vena compositiva e il suo originalissimo schema interpretativo dei canoni blues, hanno sconvolto per sempre il mondo della musica contemporanea.\n&quot;Blues&quot; raccoglie le esecuzioni piÃƒÂ¹ tendenzialmente blues del chitarrista, spaziando dal 1966 fino al 1970, coprendo, quindi, l'arco dei quattro anni cui si ÃƒÂ¨ sviluppata la sua purtroppo breve, ma intensissima carriera.\nCuriosa la copertina, che, oltre all'immagine stilizzata di Hendrix, riproduce le foto di trentasei celeberrimi bluesmen.\nUndici brani che vanno da composizioni di Hendrix, a cover e traditional.\nL'album inizia e termina con lo stesso brano, &quot;Hear My Train Comin'&quot; dello stesso Hendrix, ma in due versioni diverse. La prima interamente acustica, unica escecuzione di questo tipo in tutta la carriera del chitarrista; la seconda versione, elettrica, e per la durata di circa dodici minuti.\nTra i pezzi a firma di Hendrix, ÃƒÂ¨ da segnalare una versione straordinaria di &quot;Voodoo Chile&quot;, per l'occasione rinominata &quot;Voodo Chile Blues&quot;, e registrata nel 1968 con quello, che oggi si direbbe, un supergruppo: Steve Winwood, organo; Jack Casady, basso; e Mitch Mitchell, batteria.\nI traditional sono: &quot;Catfish Blues&quot; e &quot;Bleeding Heart&quot;, quest'ultimo cavallo di battaglia di Elmore James, il cantante blues preferito da Hendrix.\nLe cover sono: &quot;Born Under A Bad Sign&quot; di Booker T. Jones, ma rimasta famosa per la versione resa da Albert King; ma soprattutto, &quot;Mannish Boy&quot; di Muddy Waters. Qui Hendrix non si limita a riproporre la canzone attraverso la sua personale interpretazione, ma la miscela con un altro classico, &quot;I'm A Man&quot; di Steve Winwood e J. Miller, regalandoci un sensazionale ibrido musicale.\nPlay on Jimi!!!!","torrent":{"xt":"urn:btih:8ff323de030a8ffd751ecbba7c967a18abce8151","amp;dn":"Jimi+Hendrix+-+Blues+%281994%29Mp3%5BCR-Bt%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8ff323de030a8ffd751ecbba7c967a18abce8151","infoHashBuffer":{"type":"Buffer","data":[143,243,35,222,3,10,143,253,117,30,203,186,124,150,122,24,171,206,129,81]},"announce":[],"urlList":[]}}