{"title":"The Prime Ministers - An Intimate Narrative of Israeli Leadershi","uid":8943739,"size":2046703,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9050a6f18c905630249b74f9539d9b39c129051c&amp;dn=The+Prime+Ministers+-+An+Intimate+Narrative+of+Israeli+Leadershi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Mohammad_AT","files":1,"time":1379724887,"description":"This intimate narrative takes the reader behind the scenes into the chambers of Prime Ministers Levi Eshkol, Golda Meir, Yitzchak Rabin, and Menachem Begin on whose personal staffs the author served. Employing time-honored literary devices of scene-setting, impressionistic description, and characterization, he restores to life episodes of war and peace as these amazing individuals, early leaders of Israel, grappled with one another and with the life-and-death decisions they were often called upon to make. In the author's eyes, Menachem Begin emerges as most exceptional, and much of the book is devoted to him. Based largely on personal notes, as well as on actual transcripts and correspondence, some of which are revealed here for the first time, the narrative reenacts how each of the leaders responded under conditions of acute stress - be it terror or war- and how their respective relationships unfolded with Presidents Johnson, Nixon, Ford and Carter.","torrent":{"xt":"urn:btih:9050a6f18c905630249b74f9539d9b39c129051c","amp;dn":"The+Prime+Ministers+-+An+Intimate+Narrative+of+Israeli+Leadershi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9050a6f18c905630249b74f9539d9b39c129051c","infoHashBuffer":{"type":"Buffer","data":[144,80,166,241,140,144,86,48,36,155,116,249,83,157,155,57,193,41,5,28]},"announce":[],"urlList":[]}}