{"title":"The Story of Canada-Brown, Harman, Jeanneret [1950]","uid":9515132,"size":35642346,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:92085a848a125c9ea9b770edf92635deeeff60f1&amp;dn=The+Story+of+Canada-Brown%2C+Harman%2C+Jeanneret+%5B1950%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"xofokim","files":2,"time":1390506841,"description":"This schoolbook is no longer in print and getting hard to find.\nGreat Canadian history book, perfect for home-schooling or anyone who longs for the history books of their youth. Nicely illustrated.\n\nSearchable PDF from single cleaned up JPG scans.\n\nI'm on a low bandwidth connection, so please be patient and continue to share if you have the capacity.\n\n\nFrom the Forword\n\nTHIS book was begun in the classrooms which the authors have visited in each province of Canada, from British Columbia to Newfoundland. Frequently, teachers described with enthusiasm supplementary books-most of which were story-books-admitting their inadequacies, but pointing out how powerfully they impressed their contents upon the minds of boys and girls. The usual textbook narratives were, of course, intended to be read and remembered; stories were always read, and remembered.\nCould a basic elementary history be written in story form and still maintain historical perspective throughout? The authors decided to try. -The task has been a labour of love from beginning to end.\nThe decision to use stories complicated the problem of writing for two reasons All the units had to be closely woven together into a clear historical pattern; and every story had to be a good story as well as good history. The historical outline, therefore, became a framework into which the stories were made\tto fit; this framework is shown in the table of contents. The stories themselves were tested in the classroom, where they were read by pupils and played from special gramophone recordings.\nThere are many kinds of stories, and many ways of telling them. A story can be told as a third-person narrative, or as an eye-witness account by a person who might have been on the scene or might even have participated in the action.\tIt can also be related in a series of letters or entries in a diary, or even in dramatized form so that it may be re-enacted by its readers.\nAlmost any of the stories in this book might be rewritten in two or three ways. It is intended that pupils be encouraged to try such experiments of rewriting. Fictional characters and imaginative settings might be added, and the vividness of the history enhanced thereby. This has already been\ndone with some of the stories, as teachers will easily recognize, but no real liberties have been taken with the original source materials on which the stories are based.\nThe topics have been selected carefully, in an attempt to picture impartially the people of Canada yesterday and to-day in all provinces of the nation. At the same time a serious attempt has been made to correlate the story of our own country with that of the United States, and to impart a sympathetic understanding of our relations with our neighbour.\nThe book is divided into thirty-seven units-approximately the number of weeks in the school year. The units vary in length according to the kind of presentation selected. Although the stories reflect the contemporary idiom as far as possible, the vocabulary has been restricted (for the greater part to the fifth-year level according to the Lorge scale), with a moderate and uniform increase in difficulty towards the end of the book.\nMuch of the customary constitutional terminology of a history textbook does not appear in this book. Instead, the authors have sought to develop important concepts through the stories, providing labels only where labels seemed really helpful, and only after the idea had been made sufficiently clear. The official names of some Acts of Parliament and peace treaties, the multiplication of which can confuse and discourage young students, have also been avoided. However, in order that such topics may be readily located by teachers, they have been included in the index, to be found by those who look for them.\nThe arrangement of the text is chronological, and events have been related to contemporary history whenever this seemed likely to orient the pupil better than mere dates.\nMaterial for the pictures has been obtained from contemporary drawings, portraits, photographs, and prints; from historical reconstructions; and from personal observation by the authors at historic places. The authors are greatly indebted to the Public Archives of Canada, to the governments of all the provinces, and to many industrial organizations, for assistance in securing prints and photostats to guide the artists in preparing the illustrations and maps.\nThe very warm thanks of the authors go also to the teachers, and to the pupils, who experimented with much of the material in this volume.\nA special note of thanks is due the Directors of the Copp Clark Co. Limited, who asked the authors to help them produce a story history of Canada &quot;that will always open at a picture&quot;, and who have agreed to every suggestion for technical improvement during the several years of preparation.\nG.WB. E.H. M.J.\n\n","torrent":{"xt":"urn:btih:92085a848a125c9ea9b770edf92635deeeff60f1","amp;dn":"The+Story+of+Canada-Brown%2C+Harman%2C+Jeanneret+%5B1950%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"92085a848a125c9ea9b770edf92635deeeff60f1","infoHashBuffer":{"type":"Buffer","data":[146,8,90,132,138,18,92,158,169,183,112,237,249,38,53,222,238,255,96,241]},"announce":[],"urlList":[]}}