{"title":"Ti.Stramo.2008.iTALiAN.DVDRip.XviD-Republic [volpebianca]","uid":4746618,"size":734337024,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:938fab4e165dc058ace546b1592fe089cc1bc2a9&amp;dn=Ti.Stramo.2008.iTALiAN.DVDRip.XviD-Republic+%5Bvolpebianca%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Volpebianca","files":1,"time":1235918685,"description":"\nBambi ÃƒÂ¨ una liceale alle prese con l'imminente esame di maturitÃƒÂ . A una festa a cui partecipa fanno irruzione Stram e la sua banda. E' l'inizio di una possibile storia d'amore che non manca di ostacoli. Da un lato Bambi deve vedersela con la professoressa Marta Cartuccia che ÃƒÂ¨ ossessionata dalla sua presenza e dall'altro Stram ÃƒÂ¨ cosÃƒÂ¬ innamorato della moto quanto ÃƒÂ¨ incapace di gestire un rapporto che metta insieme sensualitÃƒÂ  e tenerezza. Riusciranno i due a divenire una coppia?\nLa parodia ÃƒÂ¨ un sottogenere a cui la televisione e il cinema italiani degli anni Sessanta/inizio Settanta (ricordate il mitico Quartetto Cetra o Franchi e Ingrassia?) ci avevano abituato. Poi il filone sembrava essere svanito per cedere il passo ai vari Hot Shots! e Scary Movie di Oltreoceano. Dobbiamo dire grazie a Insegno e Sodaro se possiamo (e soprattutto i giovani possono) concederci il lusso di una presa in giro non cattiva ma sempre precisa e puntuale cosÃƒÂ¬ come al cinema non le si vedeva dal secolo scorso. Non si comprende infatti l'irritazione di Riccardo Scamarcio sulla storpiatura del suo cognome. La star nostrana dovrebbe avere una sufficiente conoscenza delle dinamiche narrative per sapere che si fa la parodia solo di ciÃƒÂ² che ha grande successo e che quindi divenire oggetto di una presa in giro mediatica come questa ÃƒÂ¨ solo una medaglia in piÃƒÂ¹ da appuntare sul petto della fama.","torrent":{"xt":"urn:btih:938fab4e165dc058ace546b1592fe089cc1bc2a9","amp;dn":"Ti.Stramo.2008.iTALiAN.DVDRip.XviD-Republic+%5Bvolpebianca%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"938fab4e165dc058ace546b1592fe089cc1bc2a9","infoHashBuffer":{"type":"Buffer","data":[147,143,171,78,22,93,192,88,172,229,70,177,89,47,224,137,204,27,194,169]},"announce":[],"urlList":[]}}