{"title":"The Sand Men - Christopher Fowler","uid":12761985,"size":846788,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:945d14eb903d05a8614dbfaac59f868a690440e9&amp;dn=The+Sand+Men+-+Christopher+Fowler&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1447541418,"description":"A brand new contemporary thriller from bestselling crime and horror author Chris Fowler.\r\n\r\nIn Dubai there’s a new world of high-luxury resorts emerging for the super-rich – but at what price to everyone else?\r\n\r\nLea, Roy and their 15 year-old daughter Cara live in a gated community reserved for foreign workers. Roy has been hired to deal with teething problems at Dream World, a futuristic beach complex. In the oppressive heat, the wives appear happy to follow behind their husbands, cooking and arranging tea parties, but Lea finds herself a virtual prisoner in a land where Western women are regarded with indifference and suspicion.\r\n\r\nAt least there are a few friendly outsiders who don’t enjoy the conformity of the ex-pat community - until one night, when the most outspoken one dies in a suspicious accident. It’s the first in a string of terrible occurrences that divide the foreign workers. Lea’s neighbours start to blame migrants, locals and even each other.\r\n\r\nLea is convinced that deliberate acts of cruelty are being committed – but is there a real threat to her life, or is she becoming paranoid? And what if the thing she fears most is really happening? What happens in a world where only the rich are important? Welcome to a future that’s five minutes away, where rebellion against conformity can lead to the unthinkable …","torrent":{"xt":"urn:btih:945d14eb903d05a8614dbfaac59f868a690440e9","amp;dn":"The+Sand+Men+-+Christopher+Fowler","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"945d14eb903d05a8614dbfaac59f868a690440e9","infoHashBuffer":{"type":"Buffer","data":[148,93,20,235,144,61,5,168,97,77,191,170,197,159,134,138,105,4,64,233]},"announce":[],"urlList":[]}}