{"title":"Jonatha Brooke - Back in the Circus [2004] [EAC,log,cue. FLAC]","uid":8860538,"size":266144827,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:953c26aae0b5c834e6aba968159ed9c045bbe613&amp;dn=Jonatha+Brooke+-+Back+in+the+Circus+%5B2004%5D+%5BEAC%2Clog%2Ccue.+FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dickspic","files":14,"time":1377763420,"description":"Artist: Jonatha Brooke\nRelease: Back in the Circus\nReleased: 2004\nLabel: Bad Dog Records/Verve\nCatalog#: 0001754\nFormat: FLAC / Lossless / Log (100%) / Cue\n[color=blue]Country: USA\nStyle: pop,rock\n\n1\t Back in the Circus\t4:20\n2\t Better After All\t2:42\n3\t It Matters Now\t3:58\n4\t Sleeping with the Light On\t3:13\n5\t Fire and Rain\t4:14\n6\t Everything I Wanted\t4:11\n7\t God Only Knows\t3:00\n8\t Less Than Love Is Nothing\t3:47\n9\t Sally\t 3:59\n10\t No Net Below\t3:21\n11\t Eye in the Sky\t4:53\n\n\nJonatha Brooke's perseverance has paid off. Like Aimee Mann, she's maneuvered a broken staircase of fluctuating acceptance, band breakups, and record label shakeups with nimble feet and a consistent songwriting vision. Now, she's arrived on the top floor landing with Back in the Circus, a typically audacious effort that showcases her singing and writing even as it flirts with new musical directions. Good timing -- Circus is the third release for her Bad Dog imprint, but the first to benefit from Verve's distribution, suggesting that its nods to accessibility will find plenty of willing ears. Another first -- Brooke served as her own producer. Who better to know just when -- or when not to -- accentuate Back in the Circus' expressive vocals, pointed lyrics, and intriguing story arc with subtle programming or bits of modernist instrumental sampling? Sure, Brooke and principal collaborators Eric Bazilian and Ryan Freeland get a bit carried away sometimes. &quot;Less Than Love Is Nothing&quot;'s push-button percussion stippling and synth washes sidle too closely to being simply satisfactory in the electronic-organic world of 21st century adult alternative music. Likewise, the breezy keys and treated, three-prong glitches of her run through &quot;Fire and Rain&quot; make it pleasant but tentative -- too preoccupied with converting the casual fan searching for a gimmick. Covers of &quot;God Only Knows&quot; and Alan Parsons' &quot;Eye in the Sky&quot; fare much better. The scratchy electronics and acoustic tatters of the former are a cool exercise in deconstruction, while the latter is remade as a classic Jonatha Brooke folk song, full of gorgeously wavering vocal phrasing and tasteful twinges of mandolin over its melancholy piano rhythms. Brooke's originals overwhelmingly benefit from Circus' digital organics. The title track is an unbalanced and dizzying cocktail, with accordion, keys, guitar, and laptops all joining in the fray. &quot;Back in the circus/But at least I know the routine,&quot; she sings. &quot;Got back to back matinees/Me and the drag queens.&quot; Is the roller coaster ride a reference to her career, or life in general? &quot;Better After All&quot; renews her love of light folk-pop, but &quot;It Matters Now&quot; and &quot;Sleeping With the Light On&quot; are probably the best representation of today's Jonatha Brooke. They hybrid electronics, acoustics, and intelligent songwriting differently -- one's hopeful, the other is intimate and spine-tingling. But they're examples of a veteran artist challenging her sound without losing her voice.","torrent":{"xt":"urn:btih:953c26aae0b5c834e6aba968159ed9c045bbe613","amp;dn":"Jonatha+Brooke+-+Back+in+the+Circus+%5B2004%5D+%5BEAC%2Clog%2Ccue.+FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"953c26aae0b5c834e6aba968159ed9c045bbe613","infoHashBuffer":{"type":"Buffer","data":[149,60,38,170,224,181,200,52,230,171,169,104,21,158,217,192,69,187,230,19]},"announce":[],"urlList":[]}}