{"title":"UDEMY PHOTO EDITING MADE SIMPLE FREE TOOLS TO GREAT PICTURES TUT","uid":12489341,"size":433547876,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:965580a77260b33f5d32169ee4504cf15e7925db&amp;dn=UDEMY+PHOTO+EDITING+MADE+SIMPLE+FREE+TOOLS+TO+GREAT+PICTURES+TUT&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mackweet","files":10,"time":1443141980,"description":"\nCourse Description\r\n\r\nA photograph can often look great when it's being taken but is disappointing when finally printed or looked at on a computer monitor. Many beginner photographers assume that they are not photographing well or that they need a better or newer camera but often all that the picture needs is some enhancement and editing. Nearly every professional picture you have ever seen has been manipulated in some way and this course will show you how to do the same using FREE tools and some easy and quick techniques.\r\n\r\nEnhance your photographs using FREE software\r\n\r\n    Learn how to select, catalogue and archive your images quickly and efficiently\r\n\r\n    Make basic corrections using free software to make your images stand out.\r\n\r\n    Discover the free software that you can use to enhance and shape your photographs to achieve a professional finish\r\n\r\n\r\nIn the course I show you exactly where to download the free software that you will need and also how to use it to achieve a smooth and time efficient workflow. We start by selecting the pictures to work on using software to quickly and efficiently save and catalogue images. We then go on to make basic corrections that will lift your images up a level before finally moving on to shaping and enhancing the photographs in exactly the same way as a professional photographer to achieve a final high quality finish","torrent":{"xt":"urn:btih:965580a77260b33f5d32169ee4504cf15e7925db","amp;dn":"UDEMY+PHOTO+EDITING+MADE+SIMPLE+FREE+TOOLS+TO+GREAT+PICTURES+TUT","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"965580a77260b33f5d32169ee4504cf15e7925db","infoHashBuffer":{"type":"Buffer","data":[150,85,128,167,114,96,179,63,93,50,22,158,228,80,76,241,94,121,37,219]},"announce":[],"urlList":[]}}