{"title":"Ar Raheeq Al Makhtum (Tamil) - Sealed Nectar Life Of Muhammad (s","uid":9965440,"size":1490130294,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:966a975b51ba8a294df4f179f5ed1fb578973e6a&amp;dn=Ar+Raheeq+Al+Makhtum+%28Tamil%29+-+Sealed+Nectar+Life+Of+Muhammad+%28s&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ismayil7","files":2,"time":1397562287,"description":"This is a Tamil Translation of Sealed Nectar\n\nA complete authoritative book on the life of Prophet Muhammad (S) by Sheikh Safi-ur-Rahman al-Mubarkpuri. It was honored by the World Muslim League as first prize winner book. Whoever wants to know the whole life style of the Prophet in detail must read this book.\n\nMuhammad (S) is the Messenger of Allah, and those who are with him, are severe against the disbelievers, and merciful among themselves. You see them bowing and falling down prostrate (in prayer), seeking bounty from Allah and (His) Good Pleasure. The mark of them (i.e. of their Faith) is on their faces (fore heads) from the traces of prostration (during prayers). This is their description in the Taurah (Torah). But their description in the Injeel (Gospel) is like a (sown) seed which sends forth its shoot, then makes it strong, and becomes thick and it stands straight on its stem, delighting the sowers, that He may enrage the disbelievers with them. Allah has promised those among them who believe and do righteous good deeds, forgiveness and a mighty reward (Paradise). (Al-Fath: 29)\n\nThe Prophet Muhammad (S) said: &quot;The example of guidance and knowledge with which Allah has sent me is like abundant rain falling on the earth. Some of which was fertile soil that absorbed rain-water and brought forth vegetation and grass in abundance. (And) another portion of it was hard and held the rain-water and Allah benefited the people with it and they utilized it for drinking (making their animals drink from it) and to irrigate the land for cultivation. (And) a portion of it was barren which could neither hold the water nor bring forth vegetation (then that land gave no benefits). The first is the example of the person who comprehends Allah's Religion (Islam) and gets benefit (from the knowledge) which Allah (Azawajal) has revealed through me (the Prophet) and learns and then teaches it to others. The (last example is that of a) person who does not care for it and does not take Allah's Guidance revealed through me (he is like that barren land).&quot; (Al-Mukarramah)","torrent":{"xt":"urn:btih:966a975b51ba8a294df4f179f5ed1fb578973e6a","amp;dn":"Ar+Raheeq+Al+Makhtum+%28Tamil%29+-+Sealed+Nectar+Life+Of+Muhammad+%28s","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"966a975b51ba8a294df4f179f5ed1fb578973e6a","infoHashBuffer":{"type":"Buffer","data":[150,106,151,91,81,186,138,41,77,244,241,121,245,237,31,181,120,151,62,106]},"announce":[],"urlList":[]}}