{"title":"ABBA - Forever Gold (2 CD+bonus) [1996]  FLAC","uid":14407553,"size":1180641876,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:9749fcecd29db984215824b3b6cb2f91e7925e28&amp;dn=ABBA+-+Forever+Gold+%282+CD%2Bbonus%29+%5B1996%5D++FLAC&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"keeybee","files":81,"time":1461426949,"description":"Please seed!\r\n\r\nABBA - Forever Gold (2 CD+bonus) [1996] \nhttps://en.wikipedia.org/wiki/ABBA\r\n\r\nDig. remastered by Michael B. Tretow\r\n\r\nWith art work\r\n\r\nForever Gold CD1 (ABBA Gold, 1992)\r\n01  ABBA - Forever Gold CD1 (ABBA Gold) - Dancing Queen\r\n02  ABBA - Forever Gold CD1 (ABBA Gold) - Knowing Me, Knowing You\r\n03  ABBA - Forever Gold CD1 (ABBA Gold) - Take A Chance On Me\r\n04  ABBA - Forever Gold CD1 (ABBA Gold) - Mamma Mia\r\n05  ABBA - Forever Gold CD1 (ABBA Gold) - Lay All Your Love On Me\r\n06  ABBA - Forever Gold CD1 (ABBA Gold) - Super Trouper\r\n07  ABBA - Forever Gold CD1 (ABBA Gold) - I Have A Dream\r\n08  ABBA - Forever Gold CD1 (ABBA Gold) - The Winner Takes It All\r\n09  ABBA - Forever Gold CD1 (ABBA Gold) - Money, Money, Money\r\n10  ABBA - Forever Gold CD1 (ABBA Gold) - S.O.S.\r\n11  ABBA - Forever Gold CD1 (ABBA Gold) - Chiquitita\r\n12  ABBA - Forever Gold CD1 (ABBA Gold) - Fernando\r\n13  ABBA - Forever Gold CD1 (ABBA Gold) - Voulez Vous\r\n14  ABBA - Forever Gold CD1 (ABBA Gold) - Gimme! Gimme! Gimme!\r\n                                          (A Man After Midnight)\r\n15  ABBA - Forever Gold CD1 (ABBA Gold) - Does Your Mother Know\r\n16  ABBA - Forever Gold CD1 (ABBA Gold) - One Of Us\r\n17  ABBA - Forever Gold CD1 (ABBA Gold) - The Name Of The Game\r\n18  ABBA - Forever Gold CD1 (ABBA Gold) - Thank You For The Music\r\n19  ABBA - Forever Gold CD1 (ABBA Gold) - Waterloo\r\n\r\nForever Gold CD2 (More ABBA Gold: More ABBA Hits, 1993)\r\n01  ABBA - Forever Gold CD2 (More ABBA Gold) - Summer Night City\r\n02  ABBA - Forever Gold CD2 (More ABBA Gold) - Angeleyes\r\n03  ABBA - Forever Gold CD2 (More ABBA Gold) - The Day Before You Came\r\n04  ABBA - Forever Gold CD2 (More ABBA Gold) - Eagle\r\n05  ABBA - Forever Gold CD2 (More ABBA Gold) - I Do, I Do, I Do, I Do, I Do\r\n06  ABBA - Forever Gold CD2 (More ABBA Gold) - So Long\r\n07  ABBA - Forever Gold CD2 (More ABBA Gold) - Honey Honey\r\n08  ABBA - Forever Gold CD2 (More ABBA Gold) - The Visitors\r\n09  ABBA - Forever Gold CD2 (More ABBA Gold) - Our Last Summer\r\n10  ABBA - Forever Gold CD2 (More ABBA Gold) - On &amp; On &amp; On\r\n11  ABBA - Forever Gold CD2 (More ABBA Gold) - Ring Ring\r\n12  ABBA - Forever Gold CD2 (More ABBA Gold) - I Wonder (Departure)\r\n13  ABBA - Forever Gold CD2 (More ABBA Gold) - Lovelight\r\n14  ABBA - Forever Gold CD2 (More ABBA Gold) - Head Over Heels\r\n15  ABBA - Forever Gold CD2 (More ABBA Gold) - When I Kissed The Teacher\r\n16  ABBA - Forever Gold CD2 (More ABBA Gold) - I Am The City\r\n17  ABBA - Forever Gold CD2 (More ABBA Gold) - Cassandra\r\n18  ABBA - Forever Gold CD2 (More ABBA Gold) - Under Attack\r\n19  ABBA - Forever Gold CD2 (More ABBA Gold) - When All Is Said And Done\r\n20  ABBA - Forever Gold CD2 (More ABBA Gold) - The Way Old Friends do\r\n\r\nLimited Edition Bonus CD Single\r\n01  ABBA - Put on Your White Sombrero - Put On Your White Sombrero\r\n02  ABBA - Put on Your White Sombrero - Dream World\r\n03  ABBA - Put on Your White Sombrero - Dame! Dame! Dame!\r\n \nhttp://www.allmusic.com/album/forever-gold-mw0000044729","torrent":{"xt":"urn:btih:9749fcecd29db984215824b3b6cb2f91e7925e28","amp;dn":"ABBA+-+Forever+Gold+%282+CD%2Bbonus%29+%5B1996%5D++FLAC","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9749fcecd29db984215824b3b6cb2f91e7925e28","infoHashBuffer":{"type":"Buffer","data":[151,73,252,236,210,157,185,132,33,88,36,179,182,203,47,145,231,146,94,40]},"announce":[],"urlList":[]}}