{"title":"POtHS 2 - Bible Study - Part 69 - To Catholics With Love","uid":7480959,"size":8754924974,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:98657990eb27899f48b932b520268cc841b381d9&amp;dn=POtHS+2+-+Bible+Study+-+Part+69+-+To+Catholics+With+Love&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"POtHS11","files":56,"time":1343432910,"description":"\nPOtHS\nPouring Out the Holy Spiritruth\n\n\n\nPOtHS - Bible Study - 69 - To Catholics With Love\n\n\nPOtHS Comment: Worshiping Mother Nary is a Sin. The POPE CANNOT absolve you of your Sins, only Jesus can. Jesuits Suck too.\n\nDescription:\n\nThis download contains the following presentations.  As the Bible proclaims, we are to seek the truth from within the scriptures and set ourselves free from the embodiment of evil.  I hope this download enlightens followers in Christ as we seek forgiveness of our sins and request salvation into God's Kingdom.\n\nJack Chick - Smokescreens:\nNarrated by the famous Christian Bible Comicbook Writer, http://www.spirituallysmart.com/alberto.html.\nAlberto Rivera, former Jesuit Priest, proclaims it's &quot;one of the most important books I ever read. This book woke me up to who the &quot;Great whore&quot; of Revelation 17, 18 is.&quot; Spread this around.  Some of the information you will find in this book are as follows:\n\nChapter 1 - The Wafer God Learn the difference between the Lord's Supper and the Mass--According to the Canon Law, anyone who ridicules or says the Eucharist only represents Christ and is not actually his body, is damned.\nChapter 2 - The Hand of Rome Most Christians don't know anything of their heritage, the suffering of the early Church of Christ brought about by the Roman Catholic system. \n\nChapter 3 - A 20th Century Inquisition We all know of the horrible inquisition of Jews, Protestants and others during the reign of Hitler. Hitler once stated, ...\nChapter 4 - The Whore of Revelation By dissecting Revelation chapter 17, see why the Roman Catholic Institution is the Whore of Revelation.\nChapter 5 - Another Gospel Does the Roman Catholic Church force her followers to rely on another authority other than the Bible?\nChapter 6 - Cover Up With the closing of the great, bloody World War II, the attention of the Protestants was shifted from the Vatican to the fight against Communism. Learn who was responsible for this sudden change of the spotlight and why.\nChapter 7 - Show Biz Many of our Christian Television &quot;evangelists&quot;; are uniting with Catholics to deliver their message to the vast number of &quot;Christian&quot; viewers. Have these ...\nChapter 8 - The Fallen Idol Read the startling letter written by a Vice-President of Belmont Abbey College, a Catholic school. Learn how Billy Graham ...\nChapter 9 - Betrayed? Learn what ways the Roman Catholic Church has betrayed both Protestants and Catholics alike. By disguising the truth, what chance do Catholics have of discovering the true way to salvation?\nChapter 10 - The Richest Man On Earth Learn of the Vatican's large investments with companies and banks around the world, much of which is in the United States. Learn how wealthy the pope truly is.\nChapter 11 - Blueprint for Catholic America Discover the plans set up by the Roman Catholic Institution to take over America, from the time of the pilgrims to the present day.\n","torrent":{"xt":"urn:btih:98657990eb27899f48b932b520268cc841b381d9","amp;dn":"POtHS+2+-+Bible+Study+-+Part+69+-+To+Catholics+With+Love","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"98657990eb27899f48b932b520268cc841b381d9","infoHashBuffer":{"type":"Buffer","data":[152,101,121,144,235,39,137,159,72,185,50,181,32,38,140,200,65,179,129,217]},"announce":[],"urlList":[]}}