{"title":"No Ordinary Time (Abridged) - Doris Kearns Goodwin Audiobook","uid":11497849,"size":179600863,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:9897ac4fc100510b63b4f392a07f9bc816cb7725&amp;dn=No+Ordinary+Time+%28Abridged%29+-+Doris+Kearns+Goodwin+Audiobook&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Squiddy82","files":-1,"time":1416269557,"description":"MP3 CBR 64k Joint Stereo.\n\nAndroid users - This will work best with dedicated audiobook reader apps, such as Listen Audiobook Player.\n\niTunes users - When added to your library, iTunes will classify these MP3 files as music by default. To change to audiobook, browse music library in album view, right-click the album, and select &quot;Get Info&quot; from the context menu. Under [Options,] select [x] Media Kind: Audiobook, [x] Remember position: Yes, [x] Skip when shuffling: Yes. This will allow you to transfer the book to your iOS device while keeping it separate from your music collection. This will also keep your track position when listening in iTunes.\n\n\nNo Ordinary Time: Franklin and Eleanor Roosevelt: The Home Front in World War II\n\nWritten by: Doris Kearns Goodwin\nNarrated by: Edward Herrmann\nLength: 6 hrs\nAbridged Audiobook\nRelease Date:03-24-00\n\nPresenting an aspect of American history that has never been fully told, Doris Kearns Goodwin describes how the isolationist and divided United States of 1940 was unified under the extraordinary leadership of Franklin Roosevelt to become, only five years later, the preeminent economic and military power in the world. Using diaries, interviews, and White House records, Goodwin paints an intimate, detailed portrait not only of the presidency during wartime but also Franklin and Eleanor themselves, as well as their friends, advisers, and family. Bringing to bear the tools of both history and biography, No Ordinary Time relates the unique story of how FDR led the nation to victory in the face of seemingly insurmountable odds and, with Eleanor's essential help, forever changed the fabric of American society","torrent":{"xt":"urn:btih:9897ac4fc100510b63b4f392a07f9bc816cb7725","amp;dn":"No+Ordinary+Time+%28Abridged%29+-+Doris+Kearns+Goodwin+Audiobook","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9897ac4fc100510b63b4f392a07f9bc816cb7725","infoHashBuffer":{"type":"Buffer","data":[152,151,172,79,193,0,81,11,99,180,243,146,160,127,155,200,22,203,119,37]},"announce":[],"urlList":[]}}