{"title":"Palomino by Danielle Steel (Retail) {Rose88}","uid":10711680,"size":2308948,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:98cf4266f31aaff3c9e50056f2c722045c9d28e0&amp;dn=Palomino+by+Danielle+Steel+%28Retail%29+%7BRose88%7D+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"TheRose88","files":-1,"time":1407363736,"description":"Title: Palomino\nAuthor: Danielle Steel\nPublished: Feb 2009\nPublisher: Random House Publishing Group\nISBN: 978-0-307-56673-7\nFormat: Epub (Retail)\nLanguage: English\nGenres: Fiction, Romance\n\nSamantha Taylor is shattered when her husband leaves her for another woman. She puts her advertising career on hold and seeks refuge at a friend's California ranch, where she loses herself in the daily labor of ranch life.\n\nHere, she discovers the healing powers of trusted friends, simple joys, and hard work. She also meets Tate Jordan, the ranch foreman, and a tumultuous relationship ensues.\n\nWhen Tate disappears and a fall from a horse changes Samantha's life forever, she is confined to a wheelchair and must look deep inside herself to finds the courage to begin again.\n\nNow, fighting the battles of the handicapped, she finds new challenges, new loves, and even the adopted child she's always longed for.\n\nWhen high-powered ad exec Samantha Taylor's picture-perfect marriage to a news anchorman dissolves, she heads west to her friend's California ranch. Throwing herself into the simple routine of life on Lord Ranch, Sam finds a new love in ranch foreman Tate Jordan. But when Tate learns of Sam's life in the fast lane of New York society and her high-profile marriage, he abandons her, telling himself that a mere cowboy can never make Sam happy. Heartbroken, Sam reluctantly returns to her old life in New York. After battling her way back to relative independence, an unexpected inheritance enables Sam to begin a program that teaches physically challenged children to ride horses, encouraging their recovery. Along the way, Sam rediscovers her dreams of motherhood when an abused little boy appears on her doorstep and then love reappears when circumstances bring Tate Jordan back to Lord Ranch and to Sam.","torrent":{"xt":"urn:btih:98cf4266f31aaff3c9e50056f2c722045c9d28e0","amp;dn":"Palomino+by+Danielle+Steel+%28Retail%29+%7BRose88%7D+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"98cf4266f31aaff3c9e50056f2c722045c9d28e0","infoHashBuffer":{"type":"Buffer","data":[152,207,66,102,243,26,175,243,201,229,0,86,242,199,34,4,92,157,40,224]},"announce":[],"urlList":[]}}