{"title":"NEO Scavenger v0.984b","uid":9751165,"size":45367274,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:99260ff6779306cdb13fa25a2669b2836ef96e87&amp;dn=NEO+Scavenger+v0.984b&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"AppRipper","files":-1,"time":1394667441,"description":"NEO Scavenger\n(c) Blue Bottle Games\n\nRelease date: 9/13/2013 \nProtection: DRM-Free\nLanguage: English\nVersion: 0.985b\n\n\nNEO Scavenger is a turn-based, rogue-like RPG where you must\nsurvive in the wasteland long enough to figure out who you are\nEach turn you must decide where to go, how to scavenge for\nsupplies, and how to deal with anything and anyone you encounter\nAnd with each passing minute, the pit in your stomach grows, your\ndehydration worsens, your muscles tire, and your body temperature\ndrops in the cold autumn air. Choose your starting abilities\ncarefully, because they and your wit are the only tools you have in\nthe apocalypse!\n   &lt;a href=&quot;\nhttp://bluebottlegames.com/main/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bluebottlegames.com/main/&lt;/a&gt;\n\nInstructions:\n1) Unzip\n2) Enjoy!\n\nIt's DRM-Free as far as I know, however I would block it on your firewall anyway.\n\nHope you all enjoy this game! Buy it and support the developer! He really deserves it!\n\n-AppRipper &quot;Happy Hacking!&quot;\n\n*** CHANGELOG ****\n\nAdded new major encounter/location in wilderness.\nAdded new faction with wandering creatures.\nAdded new faction equipment.\nAdded new hex art for Allegan, Isotope Mine, Zom Zom's, and Strange Forest.\nAdded encounter illustration by Max Antonov for Haggerty Health Clinic.\nAdded combat ability DMC guards to summon sniper.\nAdded code to strip all passive moves from AI choices when target is an enemy. (Prevent stuck AI from randomly choosing passives.)\nAdded crawl towards and away moves, for when AI is crippled and fallen, and tends to choose passive when it shouldn't.\nAdded code to anger AI if player is ignoring talk and ceasefire offers.\nAdded code to show 0.1% item condition when low enough to round to 0.0%.\nAdded code to prevent &quot;delete&quot; and &quot;use&quot; cursor modes on crafting screen.\nAdded code to hook up spacebar to crafting clear button.\nAdded code to message player when hiding changes campsite.\nChanged Merga Wraith to disappear when talisman removed, and will not linger and fight if talisman restored.\nChanged Merga Wraith AI to always attack player if it can, exit if it can't, and despawn if player is invalid target.\nChanged AI's method of selecting random move to be weighted by priority, rather than just ranked.\nChanged well-fed condition to hunger sated.\nChanged well-hydrated condition to thirst slaked.\nChanged value of tannin tea to be more than pure water (Since it acts like pure water and antibiotics combined.)\nChanged NPC battle move icon to be mirrored in battle, for clarity (charge/retreat).\nChanged arrow degrade rates to be slower.\nChanged DMC Guards to start with fresh equipment.\nChanged medium campfire to always produce 4 ashes when extinguished.\nChanged small parts and similar items to have shorter names.\nFixed a bug in AI faction standings save data, which caused strange AI behavior in battle.\nFixed a bug in the despawn code. Now despawn completely and immediately.\nFixed index out of range bug in random move selection.\nFixed a bug that allowed reinforcement battle move to break local population caps.\nFixed a bug that caused wound to be &quot;null&quot; in message log.\nFixed a bug that failed to clean and dress wounds when purchasing said service at HH.\nFixed missing wounds in crazy random encounter.\nFixed empty travois image to have less wasted/empty space.\nFixed a bug that caused AIs to badmouth player to each other when sharing faction standings each turn.\nFixed a bug that caused mirrored slots to re-mirror image when emptying containers.\nFixed a bug that caused stacks to overlap in take/drop when partial stack space was available.\nFixed a bug that caused infinite scent in hexes.\nFixed bug that caused slot-swapping to equip water on wound instead of use it.\nFixed a typo in cryo encounter.\nFixed a bug that prevented dropping wheelless cart in battle.\nFixed a bug that allowed TAB to exit encounters and combat prematurely.\nFixed a bug that caused scavenging to cut short if exit chosen with optional skill/tool.\nFixed a bug that caused scavenging bars to update incorrectly when exit chosen with other skills/tools.\nFixed typos in Food Truck encounter near Concrete Apts.\nFixed balaclava art to fit hoodie and armor better.\nFixed missing shadow in human and melonhead creature sprites.\nFixed a bug that caused AI to constantly switch between two similar attack modes.\nFixed a bug that allowed creatures to continue to attack after falling unconscious against more than one target.\nFixed a typo in locked storage shed scavenge encounter.\n\nMore at http://bluebottlegames.com/main/node/2804","torrent":{"xt":"urn:btih:99260ff6779306cdb13fa25a2669b2836ef96e87","amp;dn":"NEO+Scavenger+v0.984b","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"99260ff6779306cdb13fa25a2669b2836ef96e87","infoHashBuffer":{"type":"Buffer","data":[153,38,15,246,119,147,6,205,177,63,162,90,38,105,178,131,110,249,110,135]},"announce":[],"urlList":[]}}