{"title":"Taking Back Sunday - Tell All Your Friends","uid":4191616,"size":49379437,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:99560ce17d53a27347981a448ec5ba62db54478d&amp;dn=Taking+Back+Sunday+-+Tell+All+Your+Friends&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"billy_stretcher","files":15,"time":1210988045,"description":"Taking Back Sunday\nTell All Your Friends\nEmo/Hardcore\n2002\n192Kbps\n\n1.You Know How I Do \n2.Bike Scene \n3.Cute Without The E [Cut From The Team] \n4.There&amp;#039;s No I In Team \n5.Great Romances Of The 20th Century \n6.Ghost Man On Third \n7.Timberwolves At New Jersey \n8.Blue Channel \n9.You&amp;#039;re So Last Summer \n10.Head Club\n\nFront, Back, Inside, CD Covers And Inlay Included.\n\n \nLong Island emo crew Taking Back Sunday are an authentic grass-roots phenomenon. They built their following from the ground up, by touring with the likes of the Alkaline Trio and At The Drive-In, and while it took their debut album TELL ALL YOUR FRIENDS the better part of a year to make its way into the Billboard charts, it did so without the benefit of major-label backing. In classic emo fashion, TBS mixes punk energy, pop smarts, and a whole lot of youthful angst. While there are blazing guitars and light-speed drums aplenty to be found here, things never get overbearing. The addition of clever production touches like the female vocal descant on &quot;Bike Scene&quot; and the atmospheric guitar and keyboard intros to some of the more frenetic tunes shows that there&amp;#039;s more to Taking Back Sunday than fire and fury.\n\nTaking Back Sunday draws forth images of what would be born of a marriage between Thursday and Saves The Day. The songs feature passionate,heartfelt lyrics that any listener easily identifies with. In December 2001,Victory Records signed Taking Back Sunday and put them in the skillful hands of producer Sal Villanueva and engineer Tim Gilles (Thursday&amp;#039;s &amp;#039;Full Collapse&amp;#039;). The result is a beautiful blend of passion, emotion and sincerity that is unrivaled in the budding emo-rock scene today.\n\nAmityville, New York&amp;#039;s Taking Back Sunday have all the trappings of an emo-by-numbers band: a two-singer front with one wounded guy and one slightly mental lung-scraper, a pretentious name and rousing songs of heartbreak that beg for ubiquitous audience sing-alongs. Something funny happened on the way to this potential Amityville horror, though. The band&amp;#039;s debut, Tell All Your Friends, sidesteps many sad-sack emo pitfalls with bracing pop-infused hardcore and enlightened, dramatic lyrics about heartache that teeter on a razor&amp;#039;s edge between despondency and dark vengeance. &quot;You could slit my throat and with my one last gasping breath/I&amp;#039;d apologize for bleeding on your shirt&quot;, singer Adam Lazzara yelps in &quot;You&amp;#039;re So Last Summer,&quot; a typical TBS blitz of chunky guitars, overlapping vocals and push-and-pull tempos. Lazzara&amp;#039;s vocals are shadowed by guitarist/singer John Nolan&amp;#039;s shredded rasp -- his sense of vein-popping melody helps keep songs such as &quot;Bike Scene&quot; and the band&amp;#039;s breakthrough single, &quot;Cute Without the &amp;#039;E&amp;#039; (Cut from the Team),&quot; on the harder edge of such peers as New Found Glory. A mumbled lyric from &quot;There&amp;#039;s No &amp;#039;I&amp;#039; In Team&quot; best captures Sunday&amp;#039;s credo: &quot;Irony is for suckers.&quot;\n\nOn a personal note this is one of my absolute favourite albums it is just simply fantastic and is never out of my cd player or mp3 player for very long. Forget all the debate over the whole &quot;Emo scene, blah blah blah&quot; and just enjoy well thought out well written and well played rock music. There isn&amp;#039;t a bad song on here and in my opinion if you like rock music you NEED to have this in your collection.\n\nEnjoy! :)","torrent":{"xt":"urn:btih:99560ce17d53a27347981a448ec5ba62db54478d","amp;dn":"Taking+Back+Sunday+-+Tell+All+Your+Friends","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"99560ce17d53a27347981a448ec5ba62db54478d","infoHashBuffer":{"type":"Buffer","data":[153,86,12,225,125,83,162,115,71,152,26,68,142,197,186,98,219,84,71,141]},"announce":[],"urlList":[]}}