{"title":"Saving.Mr.Banks.2013.720p.BluRay.x264-SPARKS","uid":9672577,"size":5862327020,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:99c2f86c693aa2b752a4f33cdc26bbc1af271064&amp;dn=Saving.Mr.Banks.2013.720p.BluRay.x264-SPARKS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Xetron","files":4,"time":1393495094,"description":"Saving Mr. Banks\n\nGenre: Biography, Comedy, Drama, Family, History, Music\nYear: 2013\nCountry: USA,UK,Australia\nDirector: John Lee Hancock \nRuntime: 125 min\nCasts: Emma Thompson, Tom Hanks, Annie Rose Buckley, Colin Farrell, Ruth Wilson, Paul Giamatti, Bradley Whitford, B.J. Novak, Jason Schwartzman, Lily Bigham, Kathy Baker, Melanie Paxson, Andy McPhee, Rachel Griffiths, Ronan Vibert\n\n.: Plot :.\nWhen Walt Disneys daughters begged him to make a movie of their favorite book, P.L. Travers Mary Poppins, he made them a promise - one that he didnt realize would take 20 years to keep. In his quest to obtain the rights, Walt comes up against a curmudgeonly, uncompromising writer who has absolutely no intention of letting her beloved magical nanny get mauled by the Hollywood machine. But, as the books stop selling and money grows short, Travers reluctantly agrees to go to Los Angeles to hear Disneys plans for the adaptation. For those two short weeks in 1961, Walt Disney pulls out all the stops. Armed with imaginative storyboards and chirpy songs from the talented Sherman brothers, Walt launches an all-out onslaught on P.L. Travers, but the prickly author doesnt budge. He soon begins to watch helplessly as Travers becomes increasingly immovable and the rights begin to move further away from his grasp. It is only when he reaches into his own childhood that Walt discovers the ...","torrent":{"xt":"urn:btih:99c2f86c693aa2b752a4f33cdc26bbc1af271064","amp;dn":"Saving.Mr.Banks.2013.720p.BluRay.x264-SPARKS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"99c2f86c693aa2b752a4f33cdc26bbc1af271064","infoHashBuffer":{"type":"Buffer","data":[153,194,248,108,105,58,162,183,82,164,243,60,220,38,187,193,175,39,16,100]},"announce":[],"urlList":[]}}