{"title":"The.French.Connection.1971.[Gene.Hackman].DvDRip.XviD.Mp3","uid":4322425,"size":740199130,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:9a303dfdbfab7ad394259cceda88d583df716fa5&amp;dn=The.French.Connection.1971.%5BGene.Hackman%5D.DvDRip.XviD.Mp3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Wundermutt","files":7,"time":1217558651,"description":"This is an intense, unremitting, intelligent and incredibly fast-paced film which blends action, cinematic realism, art and humor into a masterwork of hard-edged crime drama. But to categorize this film as drama, suspense or action really does violence to it. This is just a great film, and it doesn&amp;#039;t fit comfortably into any category with which I am aware. \n\nDon&amp;#039;t look here for any sense of fantasy-justice or n&amp;#039;er-do-wrong comic book heroism. Look here instead for gut wrenching nihilism, frustration with the unfairness of criminal justice in the hands of bureaucracy, and a solid, plot-driven story about a couple of cops who are just trying to do their jobs as best they can.\n\nAnd by all means, don&amp;#039;t watch this film if you aren&amp;#039;t fully awake and willing to be taken down the electric, ambiguous, and compelling roads it leads to. If you watch this film with any part of your brain turned off you&amp;#039;ll end up asking questions like &quot;plot, what plot?&quot; The fact that some people can&amp;#039;t find it reflects more on them as film-watchers than it does on this film. This film does not offer passive entertainment like most of the contemporary action market does. It makes you pay attention, though at times you might not want to. \n\nHackman and Scheider are incredible, with some of the greatest chemistry I have ever seen between two young actors. They play two hard-ass NYC detectives looking to end the war on drugs more-or-less permanently by taking down an international conspiracy which they have just barely sniffed out. And make no mistake, they, particularly Hackman&amp;#039;s &quot;Popeye Doyle&quot; are at war, and treat their jobs as a battlefield. Doyle pursues his quarry with utterly wreck less abandon, endangering the lives of dozens of people along the way. While men are absolutely terrific, this stands out as one of Hackman&amp;#039;s greatest performances, and his Oscar is well-deserved (not something you will see me say often). Backed by a strong supporting cast, and some of the best live-action cinematography of the late 20th century, this film does not allow you to turn away, get popcorn, or even deal with bodily functions for its entire duration.\n\nConsidered in the early 70s to be &amp;#039;shockingly violent&amp;#039;, this film does not even reach a tenth the degree of passive violent repulsion of the average Tarantino film, and it relies, instead, on amazing performances, flawless direction, a phenomenal post-modern soundtrack and edgy, tense camera-work. Unlike contemporary action film garbage, it also gives you complex characters that you can care about, but never fully understand. I will cut this review short because I am running out of superlatives. Anybody remotely interested in expanding or just appreciating the artistic breadth and depth of mainstream film needs to see this.\n\n\nBURN TESTED!\n\n\nTiTLE......[ The French Connection (1971)\nGENRE......[ Action/Crime/Drama\nRUNTiME....[ 1:43:48\nAUDiO......[ MP3 @ 112kbps\nLANGUAGE...[ English\nViDEO......[ XviD  \nDiMENSiONS.[ 512 x 384\nSUBS.......[ (There are a few English subs when French is spoken)\nFiLES......[ 7 \nSiZE.......[ 700 MB\nSOURCE.....[ DVD\n\n","torrent":{"xt":"urn:btih:9a303dfdbfab7ad394259cceda88d583df716fa5","amp;dn":"The.French.Connection.1971.%5BGene.Hackman%5D.DvDRip.XviD.Mp3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9a303dfdbfab7ad394259cceda88d583df716fa5","infoHashBuffer":{"type":"Buffer","data":[154,48,61,253,191,171,122,211,148,37,156,206,218,136,213,131,223,113,111,165]},"announce":[],"urlList":[]}}