{"title":"Building Web Reputation Systems {BBS}","uid":7574911,"size":7612626,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9ae2e2ae57e7d1865775987ac7e4423a4a988be1&amp;dn=Building+Web+Reputation+Systems+%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1346090506,"description":"What do Amazon's product reviews, eBay's feedback score system, Slashdot's Karma System, and Xbox Live's Achievements have in common? They're all examples of successful reputation systems that enable consumer websites to manage and present user contributions most effectively. This book shows you how to design and develop reputation systems for your own sites or web applications, written by experts who have designed web communities for Yahoo! and other prominent sites.\n\nBuilding Web Reputation Systems helps you ask the hard questions about these underlying mechanisms, and why they're critical for any organization that draws from or depends on user-generated content. It's a must-have for system architects, product managers, community support staff, and UI designers.\n\n    * Scale your reputation system to handle an overwhelming inflow of user contributions\n    * Determine the quality of contributions, and learn why some are more useful than others\n    * Become familiar with different models that encourage first-class contributions\n    * Discover tricks of moderation and how to stamp out the worst contributions quickly and efficiently\n    * Engage contributors and reward them in a way that gets them to return\n    * Examine a case study based on actual reputation deployments at industry-leading social sites, including Yahoo!, Flickr, and eBay\n\n\n\n# Paperback: 336 pages\n# Publisher: Yahoo Press; 1 edition (March 23, 2010)\n# Language: English\n# ISBN-10: 059615979X\n# ISBN-13: 978-0596159795","torrent":{"xt":"urn:btih:9ae2e2ae57e7d1865775987ac7e4423a4a988be1","amp;dn":"Building+Web+Reputation+Systems+%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9ae2e2ae57e7d1865775987ac7e4423a4a988be1","infoHashBuffer":{"type":"Buffer","data":[154,226,226,174,87,231,209,134,87,117,152,122,199,228,66,58,74,152,139,225]},"announce":[],"urlList":[]}}