{"title":"Buck 65 Dirtbike Project 2008 69mp3 Volumes 1-3 free hiphop","uid":4476028,"size":297914718,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:9b0e777fa0731ba0b337de6b7eb0cb20e920e808&amp;dn=Buck+65+Dirtbike+Project+2008+69mp3+Volumes+1-3+free+hiphop&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"geodsoon","files":70,"time":1225345888,"description":"Hre we go, fresh off the grills, the master chef\nBuck 65 serves up the Dirt Bike project, his most\nexpansive work to date. Collaborating with artists\nacross the globe, this entire compilation is free\nfor digital distribution.\n\nOriginally released as 3 aprox. 60 minute mixes,\nit is presented here as individual tracks for your\nlistening pleasure. Disable cross-fade and shuffle\nya&amp;#039;ll, and enjoy the artists expression.\n\n\n\nOriginal web site posting:\n\nOctober 25, 2008\n\nLovers,\n\nI have completed the task I had set out for myself to put together three huge album&amp;#039;s worth of music in three months - what&amp;#039;s been called the &amp;#039;Dirtbike&amp;#039; project. In these last three months I managed to write and record approximately 70 songs.  The three &quot;albums&quot; are each around an hour in length. I have a bunch of material left over that didn&amp;#039;t make it onto any of these Vertex-like mixes. Someday I&amp;#039;ll do something with those too.\n\nRight now I think of Dirtbike 1-3 as a woodshed demo project. But I&amp;#039;ve wanted to share this work, at this stage, with anyone who was interested in hearing it. So I sent copies to a few friends and to the people who contributed and they&amp;#039;ve floated around a bit from there.\n\nContributors to this project have included:\n\n- Buddy Peace: DJ/producer extraordinaire from the UK. He put together an intro for each one and we co-produced two or three beats on each of the three Dirtbikes. Buddy is incredible. When you hear the beats with an insane amount of chopping, you&amp;#039;ll know it&amp;#039;s Buddy. He also did some cuts for me.\n\n- Emily Wells: multi-instrument sorcoress from Los Angeles who added her beautiful touch to seven songs altogether.\n\n- John Zytaruk: my friend in Toronto with whom I made Porch. He played a bunch of stuff (mostly things stringed: banjo, guitar, steel) to six songs.\n\n- Moka Only: all-around hip hop renaissance man from Vancouver who rapped on one track and contributed two beats.\n\n- D-Styles: the greatest DJ in the world, from California put cuts on a handful of tracks scattered across the three sets.\n\n- JEL: Anticon beat master of Subtle and Thenselves fame contributed a rediculously heavy beat to Dirtbike2.\n\n- Tunng: one of my favorite bands, from London, UK - with whom I&amp;#039;ve worked and toured on several occasions. There&amp;#039;s a song on number three that tells the story of Joseph which was a co-production between Tunng and myself.\n\n- Norm Adams: he was the other main soloist (besides me) when I did my performance with Symphony Nova Scotia earlier this year. He&amp;#039;s a cellist and played on the Microwave Popcorn song on part 3.\n\n- Electrelane: well, specifically Mia Clarke. Sadly Electrelane broke up. I was a big fan. Mia is an incredible guitar player and was generous enough to lay some downright evil sounds on the Queen of the Shitbags song on Dirtbike3.\n\n- Charles Austin: my long-time partner in crime, with whom I&amp;#039;ve been working since Man Overboard. He wrote and performed the music for the Roadkill song on part three (I chopped it up and added drum parts).\n\n- Rodney Decroo: take-no-prisioners singer from Pittsburg, PA who I&amp;#039;ve never met. I was a fan and reached out to him in cyber-space and he came through immediately and in amazing fashion on the Roadkill song (part 3).\n\n- Serafina Steer:  harpist from London, England who I met during my extended festival collaboration with Tunng in France last year. She played on the song about La Golue that appears on the first enstallment.\n\n- Doseone: weirdo rapper and my fellow North American Adonis from Oakland. He rapped on a heav","torrent":{"xt":"urn:btih:9b0e777fa0731ba0b337de6b7eb0cb20e920e808","amp;dn":"Buck+65+Dirtbike+Project+2008+69mp3+Volumes+1-3+free+hiphop","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9b0e777fa0731ba0b337de6b7eb0cb20e920e808","infoHashBuffer":{"type":"Buffer","data":[155,14,119,127,160,115,27,160,179,55,222,107,126,176,203,32,233,32,232,8]},"announce":[],"urlList":[]}}