{"title":"DVDFab 9.1.9.4 Final","uid":11775611,"size":61274582,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:9b433d91e0caa90e122127c6143ae88032ffeec5&amp;dn=DVDFab+9.1.9.4+Final&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"nikita200","files":4,"time":1427280096,"description":"DVDFab is all you need to backup DVDs. DVDFab Platinum 3 is brand new, is completely rewritten, is based on 5 years of DVD copy software development. DVDFab is simply the easiest way to copy a DVD movie. Just insert the movie and a blank DVD then press Start. Your entire movie - including menus, trailers and special features - is copied to a single DVD with just one click, and everything happens automatically. Backup your entire DVD - including menus, trailers, and special features - onto one or multiple discs.\n\nMarch 24, 2015\nDVDFab 9.1.9.4 Updated!\nNew: Added support for new Java protection.\nNew: Added the new Blu-ray merge feature in Blu-ray Copy.\nFix: The problem that the file sorting function in DVD Creator, Blu-ray Creator and Blu-ray Copy Merge feature does not work.\nFix: A problem that DVDFab could not detect the blank disc when using ImgBurn engine in DVDFab V9.1.9.3 Beta.\nFix: A crash problem when opening Blu-ray sources in certain cases.\nFix: A problem that the region code could not be set correctly by clicking the text of the country at the region code selection dialog.\nFix: A problem that the region code could not be removed when copying Blu-ray full disc in certain cases.\nFix: A freeze problem when compressing Blu-ray to BD25 size with IQS (Intel Quick Sync) GPU acceleration enabled in certain cases.\nFix: A failure problem when converting DVD sources to Blu-ray in certain cases.\nFix: A failure problem when converting DVD/Blu-ray sources to MP4 with 2-pass encoding method in certain cases.\nFix: Some minor changes and improvements.\n\nHomepage: www.dvdfab.com\nInterface: Ml","torrent":{"xt":"urn:btih:9b433d91e0caa90e122127c6143ae88032ffeec5","amp;dn":"DVDFab+9.1.9.4+Final","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9b433d91e0caa90e122127c6143ae88032ffeec5","infoHashBuffer":{"type":"Buffer","data":[155,67,61,145,224,202,169,14,18,33,39,198,20,58,232,128,50,255,238,197]},"announce":[],"urlList":[]}}