{"title":"Chaplin-2Cd.x264.AC3-[DDR]","uid":6744705,"size":1459775006,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:9b932255816d44ac9aa424ec2570bd83db7b6f6c&amp;dn=Chaplin-2Cd.x264.AC3-%5BDDR%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SaM","files":-1,"time":1318637420,"description":"DDR Presents\n\nChaplin (2011)\n(A film by Anindyo Bandyopadhyay)\n\nDVD Rip - 1400MB (2CD) - X.264\n\n &lt;a href=&quot;\nhttp://img256.imageshack.us/img256/1082/chaplindata.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img256.imageshack.us/img256/1082/chaplindata.png&lt;/a&gt;\n\n\nSynopsis:\n\nBangshi Das (Rudranil Ghosh) and his son Nimua (Soham) may be desperately poor, but laughter is never far from their lives. Bangshi is a mimic of Charlie Chaplin whoperforms at birthday parties. He dreams of great things and calls himself an Artist and Nimua believes in him implicitly. The one sorrow in Baghshi's life is that Nimua does not like his caricature of Charlie Chaplin. While others clap and cheer, Nimua never does. Around them are Afzal (Mir) who is a steadfast friend, Paresh (Debesh Chatterjee) who debunks Bangshi's dreams of being a star one day but who also loves the duo, putting up with their endless ragging and other members of the slum. Into their lives enter Rina a rich young girl who works for an NGO. Impressed by Bangshi's talent for mimicry, Rina gets him to participate in a realty show and he makes it to the finals. Then Nimua falls ill...\n\nBangshi wins the competition and achieves stardom but is it worth it if Nimua is not going to be there with him?\n\nComments:\n\nThis film was a landmark in many ways. It marked the emergence of Suchitra Sen from the shadow of Uttam Kumar and as an actor in her own Its a superbly crafted film. The strong story line and the constant intermixing of irony, humour and pathos makes it a gripping film. True there is always a hint of melodrama and overt sentimentalism but the script never takes you away from the main theme. It is not a story of Banghshi the Artist or Bangshi the slum deweller. It is not a justaposition of the rich and the poor. Instead, It is a story of a father and son duo whom everyone loves but who really exist for each other.\n\nStill, the film would have been a meandering sentimental essay but for the extraordinary acting of Rudranil and Soham. As Bangshi and Nimua they light up the screen. In the midst of all the playacting, they bring the special relationship between father and son alive in such a vibrant manner that you are filled with awe. superb acting - worth an oscar any day. Mir as Afzal is also impressive as grumpy but steadfast friend. Others are good, but this trio simply overshadows them.\n\nLovely little touches - small little gems of expression of emotions through visuals and words, the taut screenplay (except for the last act of Rudranil which dragged a wee bit) and some very good photography by Soumik Haldar makes this a very watchable film. I wasn't too impressed with the music or the sound mixing but they are passable.\n\nWatch this film only to stand and give an ovation to little Soham, Ruranil and Mir...\n\nUploader's Notes:\n\nMany will be surprised at the 1400 MB size. It is because the film is two hours and eighteen minutes long. Had I reduced the size, the quality would have suffered. The discerning will find fault with my luma control. I think its a bit on the high side and the even more discerning will wonder why i have kept the frame rate at 29.97003 instead of 23.976. That is because this film has been shot digitally and its true frame rate is 30 fps. The original video was progressive.\n\nIMDB Link:\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt2040306/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt2040306/&lt;/a&gt;\n\n\n\nScreens\n &lt;a href=&quot;\nhttp://img189.imageshack.us/img189/4335/chaplinle.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img189.imageshack.us/img189/4335/chaplinle.png&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.imagebam.com/image/068bc4154002702&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imagebam.com/image/068bc4154002702&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.imagebam.com/image/478696154002830&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imagebam.com/image/478696154002830&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.imagebam.com/image/d29433154002760&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imagebam.com/image/d29433154002760&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:9b932255816d44ac9aa424ec2570bd83db7b6f6c","amp;dn":"Chaplin-2Cd.x264.AC3-%5BDDR%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9b932255816d44ac9aa424ec2570bd83db7b6f6c","infoHashBuffer":{"type":"Buffer","data":[155,147,34,85,129,109,68,172,154,164,36,236,37,112,189,131,219,123,111,108]},"announce":[],"urlList":[]}}