{"title":"This Unquiet Land - Barkha Dutt","uid":13052538,"size":768887,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9c1f0976180cddba7475c8e952ceb3b886519ccf&amp;dn=This+Unquiet+Land+-+Barkha+Dutt&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1450633930,"description":"India’s fault lines run wide and deep.\r\nSome of them go back centuries, others are of comparatively recent origin. The myriad villains these fault lines have spawned include rapists, murderers, terrorists, prophets of religious hatred, corrupt politicians, upholders of abhorrent caste traditions, opponents of free speech and dissent, apologists for regressive cultural practices, and external adversaries who try to destabilize our borders. All of them are responsible for impeding the country’s progress, destroying the lives of numberless innocents, usually the poorest and most vulnerable of our people, and besmirching the democratic, plural, free and secular nature of our society.\r\nSet against these enemies of our nation’s promise are the heroic ones—the poor, illiterate woman who was gang-raped but helped change the nation’s attitude towards women through her determined fight for justice; the young soldier whose courage and sacrifice in the high Himalayas was an inspiration to his comrades fighting the Kargil War; the wife whose husband was beheaded by Maoist terrorists, yet sought not revenge but succour for the poor and underprivileged; and the son of the village blacksmith who was lynched by a mob of religious fundamentalists appealing for an end to discord and sectarian violence.\r\nThese stories, and dozens of others like them, map our country’s fault lines. In this book, Barkha Dutt recounts the ones that have left an indelible mark on her. Taken together, they provide a vivid, devastating and unforgettable portrait of our unquiet land","torrent":{"xt":"urn:btih:9c1f0976180cddba7475c8e952ceb3b886519ccf","amp;dn":"This+Unquiet+Land+-+Barkha+Dutt","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9c1f0976180cddba7475c8e952ceb3b886519ccf","infoHashBuffer":{"type":"Buffer","data":[156,31,9,118,24,12,221,186,116,117,200,233,82,206,179,184,134,81,156,207]},"announce":[],"urlList":[]}}