{"title":"The Lance Thrower Camulod Chronicles - Book 8 [AudioBook] - sum1","uid":9429373,"size":501220499,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:9c58b56f283fe374e8cc018497c9943455f8c61a&amp;dn=The+Lance+Thrower+Camulod+Chronicles+-+Book+8+%5BAudioBook%5D+-+sum1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"sum1_here","files":-1,"time":1388763621,"description":"The Lance Thrower Camulod Chronicles - Book 8 [AudioBook] - sum1_here\n\nJack Whyte has written a lyrical epic, retelling the myths behind the boy who would become the Man Who Would Be King - Arthur Pendragon. He has shown us, as Diana Gabaldon said, &quot;the bone beneath the flesh of legend&quot;. In his last book in this series, we witnessed the young king pull the sword from the stone and begin his journey to greatness. Now we reach the tale itself - how the most shining court in history was made.\n\nClothar is a young man of promise. He has been sent from the wreckage of Gaul to one of the few schools remaining, where logic and rhetoric are taught along with battle techniques that will allow him to survive in the cruel new world where the veneer of civilization is held together by barbarism. He is sent by his mentor on a journey to aid another young man: Arthur Pendragon. He is a man who wants to replace barbarism with law, and keep those who work only for destruction at bay. He is seen as the last great hope for all that is good.\n\nClothar is drawn to this man, and together they build a dream too perfect to last - and, with a special woman, they share a love that will nearly destroy them all....\n\nThe name of Clothar may be unknown to modern listeners, for tales change in the telling through centuries. But any listener will surely know this heroic young man as well as they know the man who became his king. Hundreds of years later, chronicles call Clothar the Lance Thrower by a much more common name: That of Lancelot.\n\nÂ©2004 Jack Whyte; (P)2013 \nProduct Details\nListening Length: 27 hours and 46 minutes\nProgram Type: Audiobook\nVersion: Unabridged\nRelease Date: August 20, 2013\nLanguage: English","torrent":{"xt":"urn:btih:9c58b56f283fe374e8cc018497c9943455f8c61a","amp;dn":"The+Lance+Thrower+Camulod+Chronicles+-+Book+8+%5BAudioBook%5D+-+sum1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9c58b56f283fe374e8cc018497c9943455f8c61a","infoHashBuffer":{"type":"Buffer","data":[156,88,181,111,40,63,227,116,232,204,1,132,151,201,148,52,85,248,198,26]},"announce":[],"urlList":[]}}