{"title":"AC/DC - Thunderstruck","uid":4585081,"size":175849476,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:9d14925b7d46e26845cbfe035810f142a8ddbdaa&amp;dn=AC%2FDC+-+Thunderstruck&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":1,"time":1229587486,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Thunderstruck&quot; is the first song on the 1990 AC/DC album The Razors Edge.\n\nThe song peaked at number #5 on Billboard's Mainstream Rock Tracks. It was released as a single in Germany, Australia and Japan. Shown is the cover of the German release of the &quot;Thunderstruck&quot; single. The song is said to be inspired by lead guitarist Angus Young's hair-raising experience when a plane he was on was struck by lightning. However, Angus Young was later to say that it &quot;started off from a little trick I had on guitar. I played it to Mal and he said 'Oh, I've got a good rhythm idea that will sit well in the back.' We built the song up from that... It was really just a case of finding a good title. We came up with this thunder thing and it seemed to have a good ring to it. AC/DC=Power. That's the basic idea.&quot;\n\nContrary to popular belief, Young does not play Thunderstruck's main riff with one hand. Instead, he picks every note; one can hear the scraping sound that the plastic of his plectrum makes as it hits each note. Additionally in all AC/DC live videos, Angus can clearly be viewed picking every note. The one-handed tapping technique can only be seen in the &quot;Thunderstruck&quot; music video.\n\nThe video which accompanied the single was filmed at London's Brixton Academy on 17th August, 1990. The audience members were given free T-Shirts with the words 'AC/DC - I was Thunderstruck' on the front and the date on the back, and these T-shirts were worn by the entire audience throughout the filming of the video.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:9d14925b7d46e26845cbfe035810f142a8ddbdaa","amp;dn":"AC%2FDC+-+Thunderstruck","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9d14925b7d46e26845cbfe035810f142a8ddbdaa","infoHashBuffer":{"type":"Buffer","data":[157,20,146,91,125,70,226,104,69,203,254,3,88,16,241,66,168,221,189,170]},"announce":[],"urlList":[]}}