{"title":"Hazardous Air Pollutants - Case Studies From Asia","uid":14709119,"size":14775722,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9da3d0a53af6ea3fe83a7ddf3fe35292d8fc7cc7&amp;dn=Hazardous+Air+Pollutants+-+Case+Studies+From+Asia&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1464399420,"description":"Hazardous Air Pollutants - Case Studies From Asia - Dong-Chun Shin (CRC, 2016).pdf\r\n\r\nISBN 978-1-4822-9790-4\r\n\r\nHazardous Air Pollutants: Case Studies from Asia examines the variety of public health problems, such as cardiovascular disease, respiratory disease, increased mortality, and impaired mental health, that are severely affecting multiple Asian countries as a result of exposure to high concentrations of air pollution in the wake of rapid industrialization. The contributors to this book have direct research experience in health problems caused by air pollution in the countries under discussion. The countries analyzed include China, Taiwan, Japan, Indonesia, Malaysia, and Korea.\r\n\r\nThe book is divided in two sections. Each chapter of the first section focuses on one country and summarizes multiple key aspects that contextualize public health issues within it, including\r\n\r\nGeography\r\nMeteorology\r\nEconomics\r\nDemographics\r\nSources of air pollution\r\nEpidemiological findings\r\nBiological mechanisms\r\n\r\nThe first section also assesses the exposure and risk within each country. The second section introduces new fields of air pollution research, the impact of vehicle emission regulations, the effects of coal energy generation, and climate change.\r\n\r\nPresented in a concise and methodical manner, this book provides an up-to-date overview of the air pollution levels, health findings, and air quality policies of Asian countries. It expands understanding about the effects of air pollution on public health in Asia and lays a groundwork for future approaches to research and policy","torrent":{"xt":"urn:btih:9da3d0a53af6ea3fe83a7ddf3fe35292d8fc7cc7","amp;dn":"Hazardous+Air+Pollutants+-+Case+Studies+From+Asia","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9da3d0a53af6ea3fe83a7ddf3fe35292d8fc7cc7","infoHashBuffer":{"type":"Buffer","data":[157,163,208,165,58,246,234,63,232,58,125,223,63,227,82,146,216,252,124,199]},"announce":[],"urlList":[]}}