{"title":"Tommy Mottola - Hitmaker The Man and His Music","uid":10358141,"size":4924949,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9e221cc96c9d474ec2c3b121f12d9db06f36197a&amp;dn=Tommy+Mottola+-+Hitmaker+The+Man+and+His+Music&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"goodboy60","files":2,"time":1402772942,"description":"\n\nMuch has been written about Tommy Mottola, one of the most powerful, visionary, and successful executives in the history of the music industry. He discovered, developed and launched the careers of many superstars, including Mariah Carey, Celine Dion, Shakira, Jennifer Lopez and Gloria Estefan, and is credited with creating the &quot;Latin Explosion.&quot; He has had the privilege of working alongside Bruce Springsteen, Billy Joel, Bob Dylan, Beyonce, Michael Jackson, Barbara Streisand, the Dixie Chicks, Pearl Jam, Aerosmith, Tony Bennett, and Ozzy Osbourne, amongst other music giants. This is his story--a story of the modern music industry, from Elvis to the iPod--through the eyes of the man who made much of it happen.\n\nHITMAKER recounts how a kid from the Bronx--and a college dropout--became one of the music industry's most creative and controversial CEOs. For the first time, Tommy lays bare the facts behind the most sensational aspects of his life, such as being married to and developing the career of Mariah Carey, managing Michael Jackson's emotional ups and downs, and the power struggle with his onetime boss and mentor Walter Yetnikoff. HITMAKER will take you inside this world of power, money, and fame as he recounts the fascinating dealings with countless icons, and what it was like to be at the top when the business suddenly changed. \n\nTommy's story is one that will never be duplicated--and here it is, in his own voice, for the first time.","torrent":{"xt":"urn:btih:9e221cc96c9d474ec2c3b121f12d9db06f36197a","amp;dn":"Tommy+Mottola+-+Hitmaker+The+Man+and+His+Music","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9e221cc96c9d474ec2c3b121f12d9db06f36197a","infoHashBuffer":{"type":"Buffer","data":[158,34,28,201,108,157,71,78,194,195,177,33,241,45,157,176,111,54,25,122]},"announce":[],"urlList":[]}}