{"title":"B. Constantine - Waarom Ferdinand niet lang alleen bleef. NL Ebo","uid":8792962,"size":454958,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9e3416cc5f1999d5236b85caec2ccc8a7f18b562&amp;dn=B.+Constantine+-+Waarom+Ferdinand+niet+lang+alleen+bleef.+NL+Ebo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"BiWild","files":-1,"time":1375998892,"description":"B. Constantine - Waarom Ferdinand niet lang alleen bleef. NL Ebook (ePub). DMT\n\n\n\nAuteur: Barbara Constantine\nPagina's: 212\nTaal: Dutch/Nederlands\nUitgever: Boekerij\nJaar van uitgifte: 2013\nGenre: Thriller\n\nSamenvatting\n\nFerdinand is een gepensioneerde boer en weduwnaar op het Franse platteland. Tot voor kort woonde zijn zoon met zijn gezin \nbij hem in, maar die zijn vertrokken naar een appartement in het naburige stadje, en nu woont hij alleen in de grote, oude familieboerderij. \nHet ziet ernaar uit dat hij zijn nadagen in eenzaamheid zal slijten, tot op een dag zijn buurvrouw Marceline bij hem aanklopt: het dak van \nhaar huis dreigt onder zware regenval te bezwijken. Zou ze - tijdelijk natuurlijk - bij Ferdinand mogen logeren?Kort daarna arriveert \nFerdinands oude vriend Guy, wiens vrouw net is overleden. Het prille gemeenschapje raakt bekend in de omgeving, en twee hoogbejaarde \ndames, die zeventig jaar een elektrawinkel runden in het stadje, sluiten zich aan.Omdat het geheel toch een wat permanent karakter begint \nte krijgen, regelt Ferdinand een leerling-verpleegster, die tegen kost en inwoning voor de bewoners van de boerderij zorgt. Deze Muriel \nblijkt zwanger, maar daar spreekt men liever niet over. Het bonte gezelschap leeft zo veel mogelijk zelfvoorzienend en vindt een redelijke \nbalans. Tot baby Paulette wordt geboren. Haar komst vormt een uitdaging, op zijn zachtst gezegd, maar ook een nieuw begin...\n\nDeze review wordt u aangeboden door\n\nDUTCH MOVIE THEATER","torrent":{"xt":"urn:btih:9e3416cc5f1999d5236b85caec2ccc8a7f18b562","amp;dn":"B.+Constantine+-+Waarom+Ferdinand+niet+lang+alleen+bleef.+NL+Ebo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9e3416cc5f1999d5236b85caec2ccc8a7f18b562","infoHashBuffer":{"type":"Buffer","data":[158,52,22,204,95,25,153,213,35,107,133,202,236,44,204,138,127,24,181,98]},"announce":[],"urlList":[]}}