{"title":"The Godfather Family - A Look Inside [1990]","uid":7041659,"size":3385822418,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:9ef1811ea1b2f9da4f4d969db80cc47f9ae9c7f7&amp;dn=The+Godfather+Family+-+A+Look+Inside+%5B1990%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"BiCiMAN","files":-1,"time":1329570802,"description":"Info:\n\nThe Godfather, conocida en espaÃƒÂ±ol como El padrino, es una pelÃƒÂ­cula estadounidense de 1972 dirigida por Francis Ford Coppola. El film fue producido por Albert S. Ruddy, de la compaÃƒÂ±ÃƒÂ­a productora Paramount Pictures. EstÃƒÂ¡ basada en la novela del mismo nombre, de Mario Puzo, quien adaptÃƒÂ³ el guiÃƒÂ³n junto a Coppola y Robert Towne. El film narra la vida de Don Vito Corleone, jefe de una de las cinco &quot;familias&quot; que ejercen el mando de la Cosa Nostra en la ciudad de Nueva York en los aÃƒÂ±os 40. Representa la experiencia de los inmigrantes (en su caso italianos) a los Estados Unidos y al mismo tiempo expone las contradicciones del &quot;sueÃƒÂ±o americano&quot;. Es una de las producciones mÃƒÂ¡s aclamadas y apreciadas de la cinematografÃƒÂ­a estadounidense y mundial, siendo considerada uno de los mejores films de todos los tiempos y la mejor pelÃƒÂ­cula de Francis Ford Coppola. Fue la primera parte de una trilogÃƒÂ­a completada a la postre por El padrino II en 1974 (considerada la mejor secuela de todos los tiempos y una de las pocas segundas partes que rivaliza con su antecesora) y concluida con El padrino III en 1990. Y fue en 1990 que se realizÃƒÂ³ este dossier especial para acompaÃƒÂ±ar el lanzamiento de la tercera parte: 'The Godfather Family: A Look Inside', un documental intimista sobre el rodaje de la trilogÃƒÂ­a, que contiene las discusiones con Mario Puzo sobre el guiÃƒÂ³n, la elecciÃƒÂ³n del extenso reparto, las decisiones tomadas con Gordon Willis y Nino Rota, la entusiasta recepciÃƒÂ³n del pÃƒÂºblico y de la crÃƒÂ­tica, las conclusiones a las que llegaron todos los responsables veinte aÃƒÂ±os despuÃƒÂ©s... Francis Ford Coppola, Al Pacino, Diane Keaton, Robert De Niro, Robert Duvall, James Caan, Andy Garcia, Talia Shire, Eli Wallach, Sofia Coppola y Joe Mantegna, entre muchos otros, revelan la historia detrÃƒÂ¡s de la filmaciÃƒÂ³n de la genial saga familiar, mientras unas fascinantes y nunca vistas imagenes de archivo nos muestran, por ejemplo, al gran Marlon Brando en plena metamorfosis de su Vito Corleone, en las primeras pruebas de cÃƒÂ¡mara antes del comienzo del rodaje. Y acompaÃƒÂ±ando esta joya fÃƒÂ­lmica, van cuatro cortos documentales que fueron incluidos en la ediciÃƒÂ³n del DVD 'The Coppola Restoration' del 2008: 'The Masterpiece That Almost Wasn't',  'When the Shooting Stopped', 'Godfather World' y 'Emulsional Rescue: Revealing The Godfather', que nos ayudan a profundizar en el legado de una de las mÃƒÂ¡s grandes experiencias cinematogrÃƒÂ¡ficas de todos los tiempos.\n\n--------------------------------------------------------------------------------\n\nCalidad: DVDRip\n\nFormato: avi (xvid)\n\nAudio: MP3\n\nIdioma: InglÃƒÂ©s\n\nSubtÃƒÂ­tulos: EspaÃƒÂ±ol (archivo srt / subtÃƒÂ­tulos incrustados en pantalla)\n\n--------------------------------------------------------------------------------\n\nPOR FAVOR, Ã‚Â¡COMPARTE! | PLEASE, SHARE!","torrent":{"xt":"urn:btih:9ef1811ea1b2f9da4f4d969db80cc47f9ae9c7f7","amp;dn":"The+Godfather+Family+-+A+Look+Inside+%5B1990%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9ef1811ea1b2f9da4f4d969db80cc47f9ae9c7f7","infoHashBuffer":{"type":"Buffer","data":[158,241,129,30,161,178,249,218,79,77,150,157,184,12,196,127,154,233,199,247]},"announce":[],"urlList":[]}}