{"title":"WWE Wrestlemania III  (1987)  DVD-R  PAL","uid":4740221,"size":4682997760,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:a05dba67ad9f76309849c207a9b41f463ce65777&amp;dn=WWE+Wrestlemania+III++%281987%29++DVD-R++PAL&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Coolguy33","files":-1,"time":1235512430,"description":"WrestleMania III (1987)\n\n\nDVD Release date 21-06 (2004) USA\n\n\nWorld Wrestling Entertainment\nDate March 29, 1987\nAttendance 93,173\nVenue Pontiac Silverdome\nCity Pontiac, Michigan \n\n\nThis Is The Edited Version Which Was Released Back In 2004.\n\nI Have Uploaded The Full Version (Championship Edition) Released In 2007.\n\n\n\nWrestleMania III was the third annual WrestleMania professional wrestling pay-per-view event produced by the World Wrestling Federation (WWF). The event was held on March 29, 1987 at the Pontiac Silverdome in Pontiac, Michigan.\n\nThe event is particularly notable for the reported attendance of 93,173, the largest recorded attendance for a live indoor sporting event in North America.\n\nThough the attendance number is subject to dispute, the event is considered to be the pinnacle of the 1980s wrestling boom. Almost one million fans watched the event at 160 closed circuit locations in North America. The number of people watching via pay-per-view was estimated at several million, and pay-per-view revenues were estimated at $10 million.\n\nThe main feud stemmed from AndrÃƒÂ© the Giant's kayfabe turn and betrayal of his ally, the WWF Champion Hulk Hogan, which began when Hogan was presented a trophy for being the WWF Champion for three years, and AndrÃƒÂ©, his good friend, came out to congratulate him. Shortly afterwards, AndrÃƒÂ© was presented a slightly smaller trophy for being &quot;undefeated in the WWF for 15 years&quot; and Hogan came out to congratulate AndrÃƒÂ©, but ended up being the focal point of the interview. Annoyed by this, AndrÃƒÂ© walked out during Hogan's congratulation speech and not long after that, on an edition of the interview segment Piper's Pit, Bobby Heenan, a long-time Hogan adversary, announced himself to be AndrÃƒÂ©'s new manager. AndrÃƒÂ© then challenged Hogan to a title match at WrestleMania III and attacked Hogan, ripping off Hogan's T-shirt and crucifix necklace.\n\nAnother main feud leading up to the event was between Ricky Steamboat and the Intercontinental Champion Randy Savage. The feud began during a title match between the two when Savage attacked Steamboat as he greeted fans at ringside. Savage then pushed Steamboat over the security rail and delivered an elbow shot that thrust Steamboat's throat into the rail, injuring his larynx and sending him to the hospital. This resulted a long, bitter feud that lasted for six months, included several bloody match-ups and finally culminated at WrestleMania. George &quot;The Animal&quot; Steele was in Steamboat's corner, having developed a crush on Savage's valet, Miss Elizabeth.\n\nBecause of the success of WrestleMania III and to capitalize on the feud between Hogan and AndrÃƒÂ©, the Survivor Series event was created.\n\nTwenty years later, WrestleMania 23 celebrated WrestleMania III by returning to the Detroit metropolitan area, showing footage from WrestleMania III, having Aretha Franklin sing &quot;America the Beautiful,&quot; and having Kane scoop slam The Great Khali.\n\n\nRuntime:2hr 43min\nCountry:USA \nLanguage:English \nColor:Color \nAspect Ratio:1.33 : 1 \nDVD5\n","torrent":{"xt":"urn:btih:a05dba67ad9f76309849c207a9b41f463ce65777","amp;dn":"WWE+Wrestlemania+III++%281987%29++DVD-R++PAL","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a05dba67ad9f76309849c207a9b41f463ce65777","infoHashBuffer":{"type":"Buffer","data":[160,93,186,103,173,159,118,48,152,73,194,7,169,180,31,70,60,230,87,119]},"announce":[],"urlList":[]}}