{"title":"Ziggurat (Update 7)","uid":11008383,"size":309608687,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:a105f4d44a232bec1c80bcef2164f8567863395a&amp;dn=Ziggurat+%28Update+7%29+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Lamasu","files":-1,"time":1410289754,"description":"Ziggurat is a dungeon crawling FPS, with procedurally generated scenarios and encounters. You'll face dozens of dangerous enemies while you find new and powerful spells, and learn helpful perks in your quest to overcome this deadly test.\n\nUpdate 7 changelog:\n- Added Easy mode. It increases drop effectiveness and reduces the number of enemies on most encounters.\n- Added New Game+, unlockable for each character. This mode has 6 levels and is way more difficult than the standard mode: Less experience, less drops, and more damage from enemies. It's probably too difficult, but we'll wait for user feedback before reducing it.\n- Adjusted some amulet energy requirements to better fit their effects.\n- Amazon,Sage and Golden amulets - They now give a decent amount of mana in addition to increasing fire rate.\n- Fixed issue with Magnetic amulet and the Portal key\n- Amulet effects are reset when switching levels.\n- Changed spawn behavior so bosses aren't as vulnerable when spawning them.\n- Boss Sir Arthur - Increased speed, reduced movement time, increased health\n- Boss Gunkarr - Added some AoE damage to the sword attack.\n- Boss Poloko - Now he recovers a bit of health when spawning enemies. Increased speed of his attacks. Removed some columns of the room so there's less cover from attacks.\n- Boss Amanda - Increased leading time for attacks, increased health a bit.\n- Boss Percival - Reduced a bit attack damage\n- Boss Adam - Removed arcs that blocked AI pathfinding, now Adam can spawn Mini Golems too.\n- Boss Ignus - Added more obstacles in the room.\n- Boss Bastian - Increased speed of his short ranged attack, reduced attack delay\n- Boss Examiner Cepheus - Many changes to increase difficulty: More speed, less delays, more attack variety...\n- Added female voices for female characters (Bard).\n- Added 3 new weapons - Skull of Xanatos, Flame Mortar, Serpent Staff. The art isn't fully done yet, but they should be playable.\n- Increased number of standard rooms per level by 1.\n- Changed Death Pact perk effect so it lasts a while.\n- Perk selection screen cards are now shuffled.\n- Fixed instancing issues, the game *should* run a little better.\n- Added some decoration to challenge rooms, and fixed minor issues with them.\n- Added new model for challenge reward item\n- Improved visual and sound feedback for amulet interactions\n- Fixed some grammar issues with texts.\n\nIf you like the game, support the developer, buy it!    &lt;a href=&quot;\nhttp://store.steampowered.com/app/308420&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://store.steampowered.com/app/308420&lt;/a&gt;","torrent":{"xt":"urn:btih:a105f4d44a232bec1c80bcef2164f8567863395a","amp;dn":"Ziggurat+%28Update+7%29+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a105f4d44a232bec1c80bcef2164f8567863395a","infoHashBuffer":{"type":"Buffer","data":[161,5,244,212,74,35,43,236,28,128,188,239,33,100,248,86,120,99,57,90]},"announce":[],"urlList":[]}}