{"title":"Tag&amp;Rename v3.9.2","uid":12887933,"size":6857097,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:a168cf9de911462f051ce7e53a9dee59d7dc021d&amp;dn=Tag%26amp%3BRename+v3.9.2&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ZarkBit","files":1,"time":1449076738,"description":"Tag&amp;Rename v3.9.2\r\n\r\nNew in this version:\r\n\r\n    added support for Xtra atom in mp4 files (this atom used by Windows Explorer and Windows Media Player)\r\n    Czech translation updated\r\n    added &quot;Remove Leading and Trailing Spaces from All Tag Fields&quot; functions to main menu -&gt; Tools\r\n    minor fixes\r\n\r\nTag&amp;Rename is a music files tag editor that easily handles all popular digital audio formats.\r\nNo matter what music compressor you prefer, you can keep your music collection organized with Tag&amp;Rename.\r\nIt is the only tag editor and organizer which has full native support for: mp3 (ID3v1, ID3v2.2, ID3v2.3 and ID3v2.4 tags), Windows Media wma, asf and wmv files, \r\nApple iTunes aac (m4a) files including mp4, lossless m4a and protected m4p files, Ogg Vorbis, Flac, Opus, Speex (vorbis comments), \r\nMusePack mpc/mp+ (APEv1, APEv2 and ID3v1 tags), most popular lossless codecs including Monkey's Audio, Flac, Wav Pack, Optim Frog, True Audio, Apple lossless, \r\nWindows Media lossless, Wav, Aiff and DSF (Direct Stream Digital).\r\n\r\nTag&amp;Rename include full Unicode support.\r\n\r\nTag&amp;Rename supports many additional tag fields including lyrics, cover art, rating, mood, disc #, part of a compilation, album artist, classical music fields \r\n(Composer, Conductor, etc.), file related URL's and so on. With Tag&amp;Rename, you can:\r\n\r\n...manual and batch id3 tag editor\r\n...automatically fix and complete file tags using online freedb database\r\n...automatic load titles and cover art from Amazon and Discogs\r\n...automatic load album titles from tracktype.org server\r\n...get tags data from mp3's file names and its folders structures\r\n...rename your mp3 files and folders according to its music information in a batch\r\n...create play lists\r\n...export files information to XLS, CSV, and HTML formats and import tags from XLS\r\n\r\nTag&amp;Rename supports many files and tags standards in an easy and intuitive way, so you can work with music metadata and not have to think about files codecs \r\nand tags versions - Tag&amp;Rename does it all. \r\nThis is a must have software for any mp3 or mp4 player owner.\r\n\r\n1. Install software\r\n2. Copy the patch to the installed folder\r\n3. Apply patch and use the serial provided in the .txt file","torrent":{"xt":"urn:btih:a168cf9de911462f051ce7e53a9dee59d7dc021d","amp;dn":"Tag%26amp%3BRename+v3.9.2","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a168cf9de911462f051ce7e53a9dee59d7dc021d","infoHashBuffer":{"type":"Buffer","data":[161,104,207,157,233,17,70,47,5,28,231,229,58,157,238,89,215,220,2,29]},"announce":[],"urlList":[]}}