{"title":"PBS Frontline - Battle For Haiti [2011]","uid":8557691,"size":484813970,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:a257d8ef164cb709e38b5009beb47a0db8dcd012&amp;dn=PBS+Frontline+-+Battle+For+Haiti+%5B2011%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"rambam1776","files":-1,"time":1370805707,"description":"PBS Frontline - Battle For Haiti [2011]\n\nFormat                                   : Matroska\nFormat version                           : Version 2\nFile size                                : 462 MiB\nDuration                                 : 55mn 11s\nNominal bit rate                         : 1 000 Kbps\nWidth                                    : 720 pixels\nHeight                                   : 360 pixels\nDisplay aspect ratio                     : 16:9\nFrame rate mode                          : Constant\nFrame rate                               : 29.970 fps\nScan type                                : Progressive\nBits/(Pixel*Frame)                       : 0.129\nWriting library                          : x264 core 120\n &lt;a href=&quot;\nhttp://www.imdb.com/news/ni6653395/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/news/ni6653395/&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.pbs.org/wgbh/pages/frontline/battle-for-haiti/etc/introduction.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.pbs.org/wgbh/pages/frontline/battle-for-haiti/etc/introduction.html&lt;/a&gt;\n &lt;a href=&quot;\nhttp://image.bayimg.com/9299564c232a8cd50768e5fd7c88ad3927485020.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/9299564c232a8cd50768e5fd7c88ad3927485020.jpg&lt;/a&gt;\n\nOn the night of the earthquake that devastated Haiti last January, something happened in Port au Prince, the capital city, which would threaten the effectiveness of international aid efforts and undermine the country's political stability: 4,500 of the country's most violent criminals escaped from Haiti's overcrowded National Penitentiary.\n\nNow, on the one-year anniversary of the quake -- and in the aftermath of Haitian presidential elections that threatened further crisis -- FRONTLINE presents Battle for Haiti. FRONTLINE producer Dan Reed films with the beleaguered special police units tasked with apprehending the escaped gangsters. At the same time, Reed captures the daily lives of the despairing inhabitants of the slums and tent cities who are often terrorized by these gangsters.\n\nReed also tracks down some of the escaped prisoners themselves. &quot;When I got out, I tried to go straight, but I couldn't,&quot; one of the escapees tells Reed. &quot;The police are after me and all the other guys who escaped from prison.&quot;\n\nThe escapees include many of the hard-core criminals, kidnappers and gang bosses who had reduced Haiti to anarchy before being subdued by an all-out military onslaught by the police and heavily armed U.N. peacekeepers from 2004-7. Now the gangsters are largely free to regain control of the slums and the tent cities where most Haitians live, using murder and rape to enforce their rule, as Haiti proves more vulnerable and less well policed than ever before.\n\nHelping battle the escaped gangsters is Mario Andresol, Haiti's police chief, who had put many of the gangsters in prison earlier in the decade, surviving two assassination attempts in the process. Now, Andresol has to do it all over again. But his force is rumored to be riddled with corruption, and many of his best officers are without homes and living in tent camps. Andresol admits the situation is bad: &quot;It's chaos out there right now. There is a state of fear because the escapees are murdering, kidnapping, robbing...&quot;\n\nThe head of the U.N. mission, Edmond Mulet, tells FRONTLINE that unless the gangsters are controlled and stopped, &quot;all the efforts that the international community is doing on reconstruction, on rebuilding, on development ... will be in vain.&quot; Other senior U.N. officials echo this analysis.\n\nA special seven-man team of undercover prison officers has been set up to recapture prisoners who escaped during the earthquake, many of whom they know by sight. These undercover officers are central to the success of this mission, along with some U.N. peacekeepers, but they're so underfunded that they have to pay for their own gas, and they have no money to pay informers for vital information.\n\nFRONTLINE reveals that the battle for the rule of law in Haiti is further undermined by the lack of a working justice system: Ninety percent of the men who escaped from the National Penitentiary had never had their day in court and had spent four or five years awaiting trial in barbaric conditions, where cells are so crowded that prisoners have to sleep on their feet. According to one prisoner, when another dies, he's simply propped up in a corner so that someone can use his space on the floor. Wealthy gangsters often bribe their way out of the prison with large payments to corrupt judges.\n\nIn light of these realities, Police Chief Andresol takes a candidly dim view of the Haiti's political future: &quot;Honest people don't go into politics in Haiti. That's our great tragedy. To be in politics you have to belong to a group of men who think only of themselves, who can resort to killing and eliminating. We need a revolution. Nothing will change if we carry on talking about democracy.&quot;","torrent":{"xt":"urn:btih:a257d8ef164cb709e38b5009beb47a0db8dcd012","amp;dn":"PBS+Frontline+-+Battle+For+Haiti+%5B2011%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a257d8ef164cb709e38b5009beb47a0db8dcd012","infoHashBuffer":{"type":"Buffer","data":[162,87,216,239,22,76,183,9,227,139,80,9,190,180,122,13,184,220,208,18]},"announce":[],"urlList":[]}}