{"title":"Willie Tea Taylor...4 Strings(2011)[FLAC]","uid":7307389,"size":203187933,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:a5298cb6c9b2251f6a5ab634be3d9ff203d6085c&amp;dn=Willie+Tea+Taylor...4+Strings%282011%29%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dickspic","files":15,"time":1338239653,"description":"]\n\n1.Bones 02:26\n\n2.Cattleman 02:16\n\n3.Hummingbird 03:45\n\n4.Life is Beautiful 03:52\n\n5.Molly Rose 05:31\n\n6.Nothing Ever Dies 02:29\n\n7.Wandering Boy 03:44\n\n8.Waterlogged 02:54\n\n9.Letter to Zito 03:00\n\n10.Wrong Way To Run 02:34\n\n\n\nEvery once in a great while there comes along a tremendously talented singer/songwriter whose songs move us so profoundly that the visceral impact of each one is felt long after the final chord played and the last line sung trail off into the brief silence between. Folk troubadour Willy Tea Taylor is just such an artist. With a rootsy, minimalist sound created from a four-string acoustic and his natural voice, he sings life true and with genuine feeling, and he strums and picks his guitar with the calloused hands of a seasoned working man.\n\nLyrically, Taylor's content is usually either achingly personal or altogether poetic, sometimes both...all words penned with a soul that clearly finds just as much spiritually in family, friendship and music as in the things of nature, and with the big ol' heart of a rambling bard who finds just as much sentimentality in a familiar ramshackle farm property or battered pocket knife with a rusty blade as in the specific features of a loved one's face or the rural landscape of his hometown of Oakdale, California.\n\n4 Strings, Willy Tea Taylor's latest release, proves all that I have already wrote about him here. Out of its ten songs, nine are originals and one is a cover of Robert Lowry's &quot;Wandering Boy.&quot; And while the entire album is utterly brilliant, and while many of the songs are equally enjoyable, there are a few that stand a little taller than the rest, like &quot;Life is Beautiful,&quot; a gorgeous composition of unique depth, &quot;Molly Rose,&quot; probably the best murder ballad since Doc Boggs' &quot;Pretty Polly,&quot; and &quot;Wrong Way to Run,&quot; the album's closer, a life song with catchy note patterns and lyrical content that is just as personal as it is philosophical and spiritual. \n\n\ncd ripped by EAC\n\nplease seed\n &lt;a href=&quot;\nhttp://dickthespic.org/about/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://dickthespic.org/about/&lt;/a&gt;","torrent":{"xt":"urn:btih:a5298cb6c9b2251f6a5ab634be3d9ff203d6085c","amp;dn":"Willie+Tea+Taylor...4+Strings%282011%29%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a5298cb6c9b2251f6a5ab634be3d9ff203d6085c","infoHashBuffer":{"type":"Buffer","data":[165,41,140,182,201,178,37,31,106,90,182,52,190,61,159,242,3,214,8,92]},"announce":[],"urlList":[]}}