{"title":"I Am Malala: The Girl Who Stood Up for Education and Was Shot b","uid":9352313,"size":3186910,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a626c59c363af02f55eddbb35f46422cbd96b58b&amp;dn=+I+Am+Malala%3A+The+Girl+Who+Stood+Up+for+Education+and+Was+Shot+b&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"machoos","files":2,"time":1387155199,"description":" I Am Malala: The Girl Who Stood Up for Education and Was Shot by the Taliban\n\n\nWhen the Taliban took control of the Swat Valley in Pakistan, one girl spoke out. Malala Yousafzai refused to be silenced and fought for her right to an education.\n\nOn Tuesday, October 9, 2012, when she was fifteen, she almost paid the ultimate price. She was shot in the head at point-blank range while riding the bus home from school, and few expected her to survive.\n\nInstead, Malala's miraculous recovery has taken her on an extraordinary journey from a remote valley in northern Pakistan to the halls of the United Nations in New York. At sixteen, she has become a global symbol of peaceful protest and the youngest nominee ever for the Nobel Peace Prize.\n\nI AM MALALA is the remarkable tale of a family uprooted by global terrorism, of the fight for girls' education, of a father who, himself a school owner, championed and encouraged his daughter to write and attend school, and of brave parents who have a fierce love for their daughter in a society that prizes sons.\n\nI AM MALALA will make you believe in the power of one person's voice to inspire change in the world.","torrent":{"xt":"urn:btih:a626c59c363af02f55eddbb35f46422cbd96b58b","amp;dn":"+I+Am+Malala%3A+The+Girl+Who+Stood+Up+for+Education+and+Was+Shot+b","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a626c59c363af02f55eddbb35f46422cbd96b58b","infoHashBuffer":{"type":"Buffer","data":[166,38,197,156,54,58,240,47,85,237,219,179,95,70,66,44,189,150,181,139]},"announce":[],"urlList":[]}}