{"title":"The Art of Computer Programming - Vol 1.pdf","uid":3351930,"size":3511559,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a725c2313edf202b9b0407b744e2925c6a00213b&amp;dn=The+Art+of+Computer+Programming+-+Vol+1.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"benol12","files":1,"time":1120439101,"description":"From the Back Cover\n\nThis multivolume work on the analysis of algorithms has long been recognized as the definitive description of classical computer science. The three complete volumes published to date already comprise a unique and invaluable resource in programming theory and practice. Countless readers have spoken about the profound personal influence of Knuth's writings. Scientists have marveled at the beauty and elegance of his analysis, while practicing programmers have successfully applied his &quot;cookbook&quot; solutions to their day-to-day problems. All have admired Knuth for the breadth, clarity, accuracy, and good humor found in his books.\n\nTo begin the fourth and later volumes of the set, and to update parts of the existing three, Knuth has created a series of small books called fascicles, which will be published t regular intervals. Each fascicle will encompass a section or more of wholly new or evised material. Ultimately, the content of these fascicles will be rolled up into the comprehensive, final versions of each volume, and the enormous undertaking that began in 1962 will be complete.","torrent":{"xt":"urn:btih:a725c2313edf202b9b0407b744e2925c6a00213b","amp;dn":"The+Art+of+Computer+Programming+-+Vol+1.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a725c2313edf202b9b0407b744e2925c6a00213b","infoHashBuffer":{"type":"Buffer","data":[167,37,194,49,62,223,32,43,155,4,7,183,68,226,146,92,106,0,33,59]},"announce":[],"urlList":[]}}