{"title":"(PSX-PSP) Resident Evil 3 Nemesis","uid":7712888,"size":453687466,"categoryP":"games","categoryS":"handheld","magnet":"?xt=urn:btih:a7265b3e7ac36d8fec593e716facf9f78cd4ffc3&amp;dn=%28PSX-PSP%29+Resident+Evil+3+Nemesis&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"galabadass","files":2,"time":1349851386,"description":"I know there is already a PSN copy of this up, but I've uploaded this for those (like myself) who want something a little more flashy.\n\nThis has a custom icon (similar to the PSN one), background, background music, and boot screen. It also includes a manual (similar to the PSN one) except the quality is bit higher, making it slightly more readable.\n\nKnown Issues\n------------\nIt's widely known that this game has some freezing issues at certain points in the game. Whether or not this happens depends on the POPS version you're running. I recommend saving often until you reach a point where a freeze occurs, and try and find a POPS version that works.\n\n\nGame Description\n----------------\nWith the gruesome T-Virus finally dormant, Jill Valentine has resigned from S.T.A.R.S. and is going to leave what's left of Raccoon City. Much to her dismay, her exit has been delayed by the same flesh-eating zombies that plagued her counterparts in the first two games! This time, however, the undead are augmented by bloodthirsty hunters, evil hellhounds, and other terrors of the night. \n\nAs Jill, you'll meet up with a lot of new faces, and some old ones too. Carlos Olivera, for example, is an Umbrella Biohazard Countermeasure Service Agent that seems to want to help you out; whether you trust him or not is up to you. Each time you meet up with an enemy, you can either confront it or evade it, but your choices all add up in this immersing tale of terror. Of course, you do have some pretty powerful ammo to back you up, and the game even lets you combine weapons to make your own firepower. \n\nThe third installment in the popular RESIDENT EVIL series, this one boasts improved graphics, sound, and overall gameplay. Hidden at the end of the adventure is a bonus Mercenaries game but you'll be lucky if you live to see it.\n\n\n\n\n\n","torrent":{"xt":"urn:btih:a7265b3e7ac36d8fec593e716facf9f78cd4ffc3","amp;dn":"%28PSX-PSP%29+Resident+Evil+3+Nemesis","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a7265b3e7ac36d8fec593e716facf9f78cd4ffc3","infoHashBuffer":{"type":"Buffer","data":[167,38,91,62,122,195,109,143,236,89,62,113,111,172,249,247,140,212,255,195]},"announce":[],"urlList":[]}}