{"title":"Crime Patrol American Lasergames PC 2003 Version","uid":5916289,"size":654399132,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:a85db51eab1ebf27f3108f34e39887437222bd48&amp;dn=Crime+Patrol+American+Lasergames+PC+2003+Version&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"FlashyVox","files":-1,"time":1288245004,"description":"Crime Patrol - The player is employed in the police force and works his way up from Rookie to Delta Force, achieved through systematically neutralizing threats which appear in various environments and scenarios. With your gun (or mouse, depending on if you use the computer version), you shoot down gangsters, murderers, drug lords and terrorists in various tactical situations, only to ultimately face a serious nuclear threat in the final scenario.\n\nThere are four levels which the player completes one by one, not counting the shooting range, which one can access to improve his or her aim and reflexes. As a Rookie, the player teams up with a somewhat boisterous policewoman, taking on shoplifters, armed robbers and gang members. After getting promoted to Undercover, the player gets a slightly overweight male partner and confronts drug smugglers and crime lords in a nightclub, impound lot and airport. Next, in SWAT, bank robbers and terrorists become the enemies. Finally, in Delta Force, the player must stand up to criminals who are a serious threat to national security, such as a hijacked shipment of Nuclear material, hijacked planes, and assassination attempts. Each part of the game is made up of three separate scenarios, with one final mission involving a plot to steal plutonium that is filmed partly in nightvision, awaits the player who can complete all of those in Delta Force.","torrent":{"xt":"urn:btih:a85db51eab1ebf27f3108f34e39887437222bd48","amp;dn":"Crime+Patrol+American+Lasergames+PC+2003+Version","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a85db51eab1ebf27f3108f34e39887437222bd48","infoHashBuffer":{"type":"Buffer","data":[168,93,181,30,171,30,191,39,243,16,143,52,227,152,135,67,114,34,189,72]},"announce":[],"urlList":[]}}