{"title":"Ass Candy 2015 WEB-DL Split Scenes","uid":12566139,"size":1927467692,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:a87f4ee6ef0a3ec8ace7c2368c54d38a1458ee57&amp;dn=Ass+Candy+2015+WEB-DL+Split+Scenes&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"EndYou","files":6,"time":1444782028,"description":"~~~~~~~~~~~~~\r\n~Screenshots~\r\n~~~~~~~~~~~~~ \nhttp://imgpremium.com/image/lv \nhttp://imgpremium.com/image/lX \nhttp://imgpremium.com/image/lk \nhttp://imgpremium.com/image/lK \nhttp://imgpremium.com/image/lq \nhttp://imgpremium.com/image/lu \nhttp://imgpremium.com/image/l6 \nhttp://imgpremium.com/image/lj \r\n\r\n~~~~~~~~~~~~~\r\n~Description~\r\n~~~~~~~~~~~~~\r\nYear: 2015\r\nCountry: USA\r\nGenre: All Sex, Anal, Prebooks\r\nDuration: 3 hrs. 45 mins.\r\nLanguage English\r\nStudio: Brazzers\r\n\r\nGabriella Paltrova, Krissy Lynn, Sheena Shaw, Mischa Brooks, Rose Monroe, Diamond Kitty.\r\n\r\nWith Mick Blue running late for his scene with that big booty Latina Diamond Kitty, Diamond and the director decided to get the party started without him. First, she started stripping and teasing, showing off her juicy ass and newly pierced tits. She used her fingers and a dildo to get her pussy wet, so that by the time that Mick showed up, she was already good to go! Mick ate her ass out and then fucked her pussy until she came, pausing to let him taste her pussy juices as she gagged on his fat cock. Finally, Mick fucked her Latina ass, giving her a satisfying anal fuck session and then cumming all over her pretty face! Danny D is a little obsessive when it comes to his cleaning. So much so, in fact, that when he finds a couple crumbs on his spotless counter, he decides the whole house has to be cleaned. He did not have the time to do it all over again himself, so he grabbed the phone and called up ZZ Maid Service. Before too long, Gabriella Paltrova rang his doorbell in a skimpy little maid's outfit, all set to get to work. While Danny is away at work, Gabriella goes all over his house, rubbing her sweet little pink pussy until she squirts, and then using the sweet pussy juices to scrub down his house! But when Danny comes home early and discovers her secret, Gabriella will do whatever it takes to protect her company's secret ... including sucking and fucking Danny's big dick with her big tits and pink pussy! Krissy Lynn was hitchhiking across America, using her big tits to get rides, when Mick Blue pulled over to pick her up. She was in the car for less than five minutes before she started being disrespectful and annoying, making Mick pull over to kick her out. But when she would not leave no matter what he said, Mick decided that it was up to him to teach this horny slut a little respect! He stripped her down and then licked her pussy and asshole until she was dripping wet. Mick fucked all three of Krissy's tight holes, and Krissy deepthroated that cock like a pro before taking it balls deep in her pink pussy and tight ass. Bill Bailey is a month behind on his rent, and the only way he can keep his slutty landlord Sheena Shaw off his case is by making her cum hard! He has to eat her pussy on the daily, and even then, she does not always return the favor. So when she comes by to ask for a good fuck wearing a sexy pair of black stockings and not much else, Bill gives it to her hard! He starts by sticking all four fingers in her pussy and asshole, and then fucks her mouth deep. Finally when his fat cock is nice and hard, he fucks her in all of her holes and then blows a big load all over her pretty face! Mischa Brooks and the local bartender have been running a scam to part horny drifters from their wallets for quite some time now, and when Keiran Lee comes in, he looks like just your typical mark. Mischa gets to work, giving him a little lap dance, shaking her thick booty and giving him a real show, and grabs his wallet while he's distracted by her erotic gyrations. Keiran's nobody's fool though, and the second he notices his wallet is missing, he storms off the the washroom and catches Mischa red handed. He spins Mischa around and gives her phat booty a nice spanking, which makes her so wet and horny that she drops to her knees and starts sucking his dick! She gives him some amazing extra sloppy head and then spreads her legs so she can take Keiran's fat dick in her wet pussy and tight asshole! It's the evening of the Butt of the Year 2014 contest, and defending champion Rose Monroe is determined to win no matter what. So when her assistant quits because of her diva behavior, she calls in her contractors, Mick Blue and Jordan Ash, to help her out. Jordan is having none of it until she pays them, but Rose lets them know that the only payment they'll be getting out of her will be in the form of her big round booty! Jordan and Mick stuff that juicy Latina ass, taking turns pounding her asshole while the other one fucks her pretty face. After her award winning ass is warmed up, it's time to double penetrate that dirty diva, giving Rose the nice hard fucking she wanted all along. They finish her off with a couple of big cum loads, one anal creampie and one facial, and consider payment completed in full!\r\n\r\nVideo Quality: WEB-DL\r\nVideo Format: MP4\r\nVideo: MPEG4 Video (H264) 854x480 29.97fps 1000kbps\r\nAudio: AAC 48000Hz stereo 127kbps","torrent":{"xt":"urn:btih:a87f4ee6ef0a3ec8ace7c2368c54d38a1458ee57","amp;dn":"Ass+Candy+2015+WEB-DL+Split+Scenes","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a87f4ee6ef0a3ec8ace7c2368c54d38a1458ee57","infoHashBuffer":{"type":"Buffer","data":[168,127,78,230,239,10,62,200,172,231,194,54,140,84,211,138,20,88,238,87]},"announce":[],"urlList":[]}}