{"title":"Microsoft Windows Azure Development Cookbook{BBS}","uid":6663544,"size":8330426,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a8d4d3fbc86e744e17f0eb0173da33ebe856d908&amp;dn=Microsoft+Windows+Azure+Development+Cookbook%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1315603969,"description":"This cookbook offers practical, immediately usable task-based recipes covering a wide range of advanced development techniques for building highly scalable cloud-based services on the Windows Azure platform. It shows you how to improve these services and how to solve particular problems/scenarios when developing them on the Windows Azure platform. The solutions are presented in a clear step-by-step manner and explained in great detail, which makes them good learning material for everyone who has experience of the Windows Azure platform and wants to improve. The book is designed so that you can read it chapter by chapter or refer to recipes in no particular order. If you are an experienced Windows Azure developer or architect who wants to understand advanced development techniques when building highly scalable services using the Windows Azure platform, then this book is for you. You should have some exposure to Windows Azure and need basic understanding of Visual Studio, C#, SQL, .NET development, XML, and Web development concepts (HTTP, Services).\nAbout the Author\n\nNeil Mackenzie\n\nNeil Mackenzie has worked with computers for nearly three decades. He started his computer career doing large-scale numerical simulations for scientific research and business planning. Since then, he has been involved primarily in healthcare software, developing electronic medical records systems. He has been using Windows Azure since PDC 2008 and has used nearly all parts of the Windows Azure platform - including those that no longer exist. Neil is very active in the online Windows Azure community -- in particular, helping to solve many of the questions raised in the MSDN Windows Azure Forums. He is a Microsoft MVP for Windows Azure.\nProduct Details\n\n    * Paperback: 392 pages\n    * Publisher: Packt Publishing (August 5, 2011)\n    * Language: English\n    * ISBN-10: 1849682224\n    * ISBN-13: 978-1849682220","torrent":{"xt":"urn:btih:a8d4d3fbc86e744e17f0eb0173da33ebe856d908","amp;dn":"Microsoft+Windows+Azure+Development+Cookbook%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a8d4d3fbc86e744e17f0eb0173da33ebe856d908","infoHashBuffer":{"type":"Buffer","data":[168,212,211,251,200,110,116,78,23,240,235,1,115,218,51,235,232,86,217,8]},"announce":[],"urlList":[]}}