{"title":"Documentary ~ An Anarchist's Story [theArchit3kt]","uid":5570680,"size":580031568,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:aae622cee77ff470241508ea14ebda03ff147fac&amp;dn=Documentary+%7E+An+Anarchist%5C%27s+Story+%5BtheArchit3kt%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"theArchit3kt","files":-1,"time":1274239738,"description":"Documentary: An Anarchist's Story - Ethel MacDonald\n\n(with Noam Chomsky)\n\nRunning Time: 1h 15min 1sec\nFile Format: AVI\nVideo Codec: MPEC-4, 480:360 , 1028kbps, 30 fps\nAudio Codec: mp3, stero, 128 kbps\n\n\nThe Film\nThis drama-documentary tells the story of Ethel MacDonald. A forgotten legend, her story ranks alongside the courage of 'La Pasionaria' and the legendary 'Odette'. Whilst both these women sustained world-wide recognition, our Scots heroine dwindled into obscurity and remains forgotten to this day.\n\nEthel MacDonald's own intimate recollections are presented through a definitive mix of documentary and drama, re-visiting the Killing Fields that were the Spanish Civil War. Supporting commentary spoken by David Hayman paired with expert interviews, including Noam Chomsky, provides background knowledge of 1930's European Politics and a further insight into the young Scot's motives, actions and social situation.\n\nThe film links her own personal drama to specific archive footage of Barcelona in disarray - an image Ethel MacDonald came to know so well.\n\nThe Revolution\nDuring ten months in 1936 and 1937 some 3 million men, women and children were involved in one of the most radical revolutions in world history.\n\nIn the countryside surrounding Barcelona peasants formed communes on land confiscated from old ruling elite. Workers took over the factories. Police were replaced with civilian self-defence forces.\nIn Catalonia three-quarters of the economy was under anarchists control. Hotels, shops, barber shops and restaurants were collectivised and managed by their workers, often making them more efficient. In some communes money was entirely eliminated and replaced with vouchers and bartering schemes.\n\nIt was this setting that saw Ethel MacDonald play her part in the greatest ideological struggle of modern times.\n\nThe Woman\nEthel MacDonald was born in Bellshill, West of Scotland, in 1910 the free-spirited daughter of a large working class family - but from such humble beginnings often come extraordinary stories.\n\nAt the time of our story Ethel is 27 years old. She is determined - almost to the point of obsession. She is confident of her values and her abilities and is completely fearless. As an Anarchist she is politically aware and has a burning desire for social justice.\n\nEthel was dark-haired, small of stature, and mesmerising company. She was a classic Scottish auto-didact - everything she has learned has taken will-power, study and patience.\n\nShe is a mercurial character - fast-talking, quick-witted, a workaholic. But she is also a constant friend. In 'An Anarchist's Story' - through her own words and via our reconstructions - one characteristic more than any other shines through: her deep, undying passion.\n\n\n________________________________________________________\n\n\nYou find all my torrents and a lot of other stuff on:\n &lt;a href=&quot;\nhttp://thearchit3kt.blogspot.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thearchit3kt.blogspot.com/&lt;/a&gt;\n\n\n\n..I wish you all the best and thanks a lot to everybody who helps seeding..\n..theArchit3kt..\n\n\n!! keep torr3nts alive !!","torrent":{"xt":"urn:btih:aae622cee77ff470241508ea14ebda03ff147fac","amp;dn":"Documentary+%7E+An+Anarchist%5C%27s+Story+%5BtheArchit3kt%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aae622cee77ff470241508ea14ebda03ff147fac","infoHashBuffer":{"type":"Buffer","data":[170,230,34,206,231,127,244,112,36,21,8,234,20,235,218,3,255,20,127,172]},"announce":[],"urlList":[]}}