{"title":"Catwoman [DVDRIP].","uid":3757951,"size":730746880,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:ab2824a519dcb9d04f3becb43607b73b13aa3578&amp;dn=Catwoman+%5BDVDRIP%5D.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"cholo24","files":1,"time":1185821390,"description":"Catwoman\nReparto\nKim Smith, Byron Mann, Berend McKenzie, Sharon Stone, Peter Wingfield, Halle Berry, Christopher Heyerdahl, Alex Borstein, Frances Conroy, Lambert Wilson\nDirector\nPitof\nDuraciÃƒÂ³n\n01:44:00\nEstreno\nviernes 6 agosto 2004\nGÃƒÂ©nero\nAventuras\nDistribuidora\nWarner Sogefilms\n\nSINOPSIS\nLa tÃƒÂ­mida y sensible artista Patience Philips (Halle Berry) parece no poder dejar de pedir disculpas por su propia existencia. Es una mujer sumisa y siempre dispuesta a agradar a la gente, que trabaja como diseÃƒÂ±adora grÃƒÂ¡fica para la gigantesca compaÃƒÂ±ÃƒÂ­a de cosmÃƒÂ©ticos Hedare Beauty, dirigida por el despÃƒÂ³tico George Hedare (Lambert Wilson) y su esposa, la supermodelo Laurel (Sharon Stone). Cuando Patience se entera por casualidad de un siniestro secreto sobre un revolucionario producto antienvejecimiento de la compaÃƒÂ±ÃƒÂ­a que pronto va a salir a la venta, se encuentra atrapada en medio de una peligrosa conspiraciÃƒÂ³n. Pero en su momento mÃƒÂ¡s aciago, Patience es salvada renaciendo con la fuerza, la velocidad, la agilidad y los agudÃƒÂ­simos sentidos de un gato. Guiada por una misteriosa mentora llamada Ophelia Powers (Frances Conroy), Patience comienza pronto a explorar su nueva destreza y su intuiciÃƒÂ³n felina, asÃƒÂ­ como su historia es la ÃƒÂºltima de una larga lÃƒÂ­nea de mujeres que han sido elegidas a lo largo de los tiempos para tener el don de estos extraordinarios poderes. Con su conocimiento y su fuerza reciÃƒÂ©n adquiridos se convierte en Catwoman, una criatura fuerte, elegante y sigilosa que mantiene delicadamente el equilibrio sobre la delgada lÃƒÂ­nea que separa el bien del mal. Las aventuras de Catwoman comienzan cuando se pone al acecho para arreglar algunas cuentas, pero su doble vida se ve enseguida complicada por la naciente relaciÃƒÂ³n de Patience con el resuelto detective Tom Lone (Benjamin Bratt). Lone se estÃƒÂ¡ enamorando de Patience, pero no puede evitar su fascinaciÃƒÂ³n por la feline fatale que parece que es la responsable de una serie de crÃƒÂ­menes que asolan la ciudad. A medida que aprende a explotar sus poderes sobrehumanos, Catwoman se vuelve mÃƒÂ¡s fuerte y mÃƒÂ¡s rÃƒÂ¡pida, y se convierte en una amenaza mayor para sus enemigos al tiempo que la lÃƒÂ­nea entre Patience y su alter ego sin domesticar comienza a hacerse borrosa.\n\n\n","torrent":{"xt":"urn:btih:ab2824a519dcb9d04f3becb43607b73b13aa3578","amp;dn":"Catwoman+%5BDVDRIP%5D.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ab2824a519dcb9d04f3becb43607b73b13aa3578","infoHashBuffer":{"type":"Buffer","data":[171,40,36,165,25,220,185,208,79,59,236,180,54,7,183,59,19,170,53,120]},"announce":[],"urlList":[]}}