{"title":"[FirstAnalQuest] 2010-04-24 - Natalias Dirty Anal Fantasy [WMV][","uid":9969534,"size":895206719,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:ac21e20e71fd386a53a929b7d631459f833a4dbc&amp;dn=%5BFirstAnalQuest%5D+2010-04-24+-+Natalias+Dirty+Anal+Fantasy+%5BWMV%5D%5B&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"xxxlavalxxx","files":1,"time":1397605120,"description":"Tags: \nHardcore, Anal, Toys, Creampie, Shaved Pussy, Blowjob, Brunette\n\nDescription:\nWe can not complain about our job - we travel around and hook up with the most seductive teen girls that are ready to sell their anal virginity and get it shot for your viewing amusement. On our last trip we met somebody who seemed to be satisfied with her job as well. When we came back from lunch back to our hotel room we saw a lovesome teen girlie who was cleaning our room. She pretended not to see us and continued her duty. Every time she leaned forward to make the bed or wipe the dust her amazing round booty peeked out from under her short housemaid dress. We just couldn't miss such a hottie and made her an offer she couldn't refuse. She agreed to come back after her shift is over and show us her beauties that she hides under her uniform. At the interview she told us that she got this job not such a long time ago and the main reason why she had chosen it were her sexual fantasies about being a sexy housemaid who gets fucked by strangers in hotel rooms. If the girl wants it - she will get it! But with only one condition - we would make her dream come true if she agrees to sell us her anal virginity. She agreed without hesitation and we got down to the shooting. By the way she works over the cock you can tell that she has been fantasizing about it a lot and nothing could stop her on her way to explosive orgasms. She was nailing her hot pussy on our actor's huge shaft like crazy and after he penetrated her innocent butthole she started to twist her hips like there was nothing she enjoyed more than a thick cock in her ripe ass!\n\n &lt;a href=&quot;\nhttp://imgdone.com/viewer.php?file=96440136619898074245.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgdone.com/viewer.php?file=96440136619898074245.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://imgdone.com/viewer.php?file=94003106396711284385.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgdone.com/viewer.php?file=94003106396711284385.jpg&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:ac21e20e71fd386a53a929b7d631459f833a4dbc","amp;dn":"%5BFirstAnalQuest%5D+2010-04-24+-+Natalias+Dirty+Anal+Fantasy+%5BWMV%5D%5B","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ac21e20e71fd386a53a929b7d631459f833a4dbc","infoHashBuffer":{"type":"Buffer","data":[172,33,226,14,113,253,56,106,83,169,41,183,214,49,69,159,131,58,77,188]},"announce":[],"urlList":[]}}