{"title":"Sandy Denny - Complete","uid":4964987,"size":1084539632,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:acd1d00617914d6c9cfcc3a07e57e445820e14fb&amp;dn=Sandy+Denny+-+Complete&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"tamroi","files":139,"time":1245492204,"description":"Born Jan 6, 1947 in Wimbledon, England.  Died Apr 21, 1978.\nMaddy Prior, Jacqui McShee, and June Tabor all give her a run for her money, but the late Sandy Denny remains the pre-eminent British folk-rock singer. In addition to recording several albums of her own, Denny was an integral force behind the best work of the most respected British folk-rock band of all, Fairport Convention, and also contributed mightily to recordings by the Strawbs and Fotheringay. It's impossible for words to fully evoke the haunting, spectral presence of her powerful and penetrating alto voice, which seemed to bring the mythology of English moors and folktales to life in contemporary, 20th century settings.\n\nDenny was studying to be a nurse when she began to pursue music seriously in the mid-'60s, partially at the encouragement of the then-struggling Simon &amp; Garfunkel, whom she met when they were still unknown. She was also friendly with the American folk singer Jackson Frank, and recorded a couple of his songs on her first album (now available as The Original Sandy Denny). While this solo acoustic recording was her most traditional folk effort, it showed considerable potential, which she came closer to realizing on the 1967 album she recorded as a member of the Strawbs. This found her singing with fuller folk-rock arrangements, and also included her first recorded composition, &quot;Who Knows Where the Time Goes.&quot; The song gave Denny her first international recognition when Judy Collins recorded it in 1968.\n\nDenny was tapped to replace Judy Dyble in Fairport Convention in 1968, and is prominently featured on their late-'60s albums What We Did on Our Holidays, Unhalfbricking, and Liege and Lief. These are not only recognized as Fairport's best work, but as some of the finest British folk-rock records of all time. Although Denny shared the lead vocal chores with other members of the group, it was her singing that highlighted the best tracks, such as &quot;Tam Lin,&quot; &quot;Fotheringay,&quot; and &quot;Autopsy&quot; (the last two of which she wrote).\n\nDenny left Fairport Convention in 1970, and while both she and Fairport would produce some worthwhile work in the future, it's fair to say that neither band nor singer would reach the same peaks again. She formed the short-lived Fotheringay, which also included her future husband Trevor Lucas on guitar, but which disbanded after one decent album (a planned second LP was never completed). She recorded a few solo albums for Island in the 1970s that sometimes suffered from unsympathetic over-production and weak material, though the highlights are worth hearing. There was also an unremarkable album of oldies covers that she helped out with as a member of the Bunch, a British folk supersession of sorts that also included Richard Thompson. When mainstream rock listeners heard her voice in the 1970s, however, it was usually not on her own records, but as a guest vocalist on Led Zeppelin's &quot;The Battle of Evermore.&quot;\n\nMuch of the best of Denny's later solo work, oddly, is found on live and BBC recordings, some of which surfaced on the box set Who Knows Where the Time Goes? (others appear on the bootleg Dark the Night). While Denny was a first-rate folk-rock singer, she usually didn't mesh well with mainstream rock or hard rock arrangements, and the live work usually framed her vocals in more appropriately sparse settings. She joined Fairport again for a while in the mid-'70s, appearing on the 1975 album Rising for the Moon, but the reunion didn't really excite either the participants or the audiences, and she left for good in 1976. Her final LP, Rendezvous, came out in 1977; the following year, she died from injuries sustained in a fall down a flight of stairs. In 1998, Island released Gold Dust, a recording of her final live performance taped at London's Royalty Theatre on November 27, 1977. AMG\n","torrent":{"xt":"urn:btih:acd1d00617914d6c9cfcc3a07e57e445820e14fb","amp;dn":"Sandy+Denny+-+Complete","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"acd1d00617914d6c9cfcc3a07e57e445820e14fb","infoHashBuffer":{"type":"Buffer","data":[172,209,208,6,23,145,77,108,156,252,195,160,126,87,228,69,130,14,20,251]},"announce":[],"urlList":[]}}