{"title":"Miss Donnerbusen 2 (starring Anja and Laura Lion)","uid":4219260,"size":830107978,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:ad9bb57e5bfc6577f5cb1bd63c2f36f20a4b5c09&amp;dn=Miss+Donnerbusen+2+%28starring+Anja+and+Laura+Lion%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"MisplacedFate1313","files":1,"time":1212514036,"description":"Movie Name: Miss Donnerbusen 2\nVideo file: Miss_Donnerbusen_Porno_90_Minuten_deutsch.asf\nStudio / Publisher: MMV - Multi Media Verlag\nGenre: Porn (Big Bust, Natural, Hardcore)\nMovie Description: Big busted German girls putting their 100 percent natural big breasts to good use!\nActors/Actresses: Anja, Anna B, Laura Lion, Helena, Stefan, Manuel Klose\nRelease Date: 18.02.2003     \n\nMiss Donnerbusen 2 is notable for having Laura Lion&amp;#039;s first ever anal scene, and is one of her few pornos filmed before her breast augmentation surgery. It is also among a few movies depicting footage of Anja before her untimely death in 2003.\n\nScenes:\nParadise Beef Tits (Anja)\nSwine Cleaning Lady\nBonFire Fun Bags\nBarFly Boobies (Laura Lion)\nPerky Tit Poking\n\n\n`````````````\nNote: Anja (aka Leo), the lead actress of this film, tragically committed suicide at age 20, apparently as a result of an unfulfilled love affair. Visit bettie-b.de/leobye.html for her memorial page. As you watch her F-cups heave to and fro in what was Anja&amp;#039;s magnum opus, please remember to treat all women with the utmost respect. Rest in peace, Anja...You were too beautiful for this world.\nMemorial Site: http://bettie-b.de/leobye.html\n`````````````\n\n* Anja is also cited in a &quot;Miss Donnerbusen 4&quot;, which I can&amp;#039;t find much info about. It might have been discontinued before anyone could get a copy online - you can&amp;#039;t even buy it anymore. She was also in Boobhouse 2, accompanying the lovely Nadine Jansen. I would like very much to collect Anja&amp;#039;s work, and ANY information regarding the following titles would be of great use. Please post here if you know anything about:\n\n[Miss Donnerbusen 4, the Boobhouse series, Perverse Abgrunde, Die MÃƒdchen vom Immenhof, Fotzenboutique, Traumurlaub, Chaos inklusive, Diana und Team im Sexrausch, and Schmutzige Spiele im Swinger Club]\n\nOf course, I will upload to TPB if I ever manage to find any more of her work. Getting this particular file was a great test of patience for me, but it was worth it -- and I hope you enjoy it as much as I did. Honestly, it was better than I thought it would be - and I had very high expectations. Furthermore, I would like to announce the TPB release of this film&amp;#039;s companion piece, Miss Donnerbusen 3. Miss Donnerbusen 1 is on it&amp;#039;s way. If you enjoy this movie, you might also enjoy the &quot;Nadine Jansen Collection&quot; or &quot;Fuko - Bachelor&quot; torrents (though both are softcore).\n\nAlthough the file name of the video doesn&amp;#039;t have a &quot;2&quot; in it, I assure you this is MDB2, not MDB1. As with MDB3, there&amp;#039;s about megabyte in 3 folders on the archive which contain a myriad of German porn torrents. Queue or delete these at your discretion.\n\n\n\n&quot;Hugs and kisses through the net!&quot;\nShare and Enjoy!","torrent":{"xt":"urn:btih:ad9bb57e5bfc6577f5cb1bd63c2f36f20a4b5c09","amp;dn":"Miss+Donnerbusen+2+%28starring+Anja+and+Laura+Lion%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ad9bb57e5bfc6577f5cb1bd63c2f36f20a4b5c09","infoHashBuffer":{"type":"Buffer","data":[173,155,181,126,91,252,101,119,245,203,27,214,60,47,54,242,10,75,92,9]},"announce":[],"urlList":[]}}