{"title":"Johnny Thunders &amp; the Heartbreakers - Live at Max's Kansas Ci","uid":3611009,"size":126721870,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:aebeeea93418129654873e0ae689c54711091f10&amp;dn=Johnny+Thunders+%26+the+Heartbreakers+-+Live+at+Max%5C%27s+Kansas+Ci&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"123pam","files":17,"time":1170621389,"description":"From: http://en.wikipedia.org/wiki/Live_at_Max&amp;#039;s_Kansas_City_(Johnny_Thunders_album)\n\nLive at Max&amp;#039;s Kansas City is a live album by Johnny Thunders &amp; The Heartbreakers. Recorded at a series of Autumn 1978 &quot;reunion&quot;/&quot;farewell&quot; shows at the famous Max&amp;#039;s Kansas CityÂ® nightclub, the album&amp;#039;s performance ? loud, sloppy, and laden with bawdy introductions and/or lyric changes to many of the familiar songs from their only studio album, L.A.M.F. ? further cemented the band&amp;#039;s live reputation.\n\n\nThe album and &quot;reunion&quot; gigs came about after Thunders had returned from England, where he had completed recording his first solo album, So Alone, for Real Music. His fellow ex-Heartbreakers Walter Lure and Billy Rath had participated in some of the sessions for the album, and all three happened to find themselves in New York at the same time, and decided to play some gigs &quot;for old time&amp;#039;s sake&quot; and some &quot;chump change&quot; (liner notes of CD reissue, p.4). With drummer Jerry Nolan reluctant to backtrace his steps after quitting the band over L.A.M.F.&amp;#039;s poor sound, the Thunders/Lure/Rath triumvirate recruited one Ty Stix to take over the drum seat for the shows, all of which were recorded.\n\nOriginally released by the English label Beggars Banquet Records through a logo deal with Max&amp;#039;s Kansas City, the album was successful enough to warrant a second live recording done at the same venue. The band, now fully reunited with the return of Jerry Nolan to the drum throne, accepted the invitation. By that time, however, the band were all struggling with their various addictions, with Thunders&amp;#039; own heroin habit escalating. The first two nights of the three-night stand resulted in very little if any usable material, but by the last night, the band were in rare form, with Thunders and Lure delivering their usual witty introductions between songs. After playing five songs, Thunders suddenly left the stage, claimng he had to &quot;tune up&quot; ? never to return that evening. Ironically, two songs earlier, the band had played their semi-autobiographical &quot;Too Much Junkie Business&quot;. The five songs from the last night were mixed down and offered to Beggars Banquet, who refused them.\n\nSeveral years later, these songs were remixed, along with the original album, in preparation for a long-awaited reissue of the original Live at Max&amp;#039;s album with the &quot;new&quot; recordings appeneded to it. Walter Lure and Billy Rath participated in the mixing. Thunders was unable to participate due to other commmitments, but was played the results, and gave them his full endorsement, requesting only that the 1979 recordings were released &quot;just the way it is, including the talk.&quot; (liner notes, ibid) The reissue, however, would not be released until a few years after Thunders&amp;#039; passing.\n\n\nTrack listing\n\nIntro \nMilk Me \nAlso known as Chatterbox and Leave Me Alone. \nChinese Rocks (Dee Dee Ramone/Richard Hell) \nFalsely co-credited, along with Dee Dee Ramone and Richard Hell, to Johnny Thunders and Jerry Nolan. \nGet Off The Phone (Walter Lure/Jerry Nolan) \nLondon Boys (Johnny Thunders/Walter Lure/Billy Rath) \nTake A Chance (Walter Lure/Jerry Nolan) \nOne Track Mind (Walter Lure/Jerry Nolan) \nLet Go (Johnny Thunders/Jerry Nolan) \nI Love You \nCan&amp;#039;t Keep My Eyes On You (Walter Lure/Jerry Nolan) \nI Wanna Be Loved \nDo You Love Me (Berry Gordy Jr.) \nAll By Myself (Walter Lure/Jerry Nolan) \nPirate Love \nToo Much Junkie Business (Walter Lure) \nCredited to both Lure and Thunders, but Lure acknowledged in the liner notes of the 2002 reissue of L.A.M.F. that he wrote the song himself and gave Thunders co-writing credit since it was basically his life story too. Amusingly, Thunders would often introduce the song onstage by saying that Lure had written it with Chuck Berry and Bo Diddley. \nDon&amp;#039;t Mess With Cupid (Parker/Floyd/Cropper) \nSo Alone \nAll songs written by Johnny Thunders except where noted.","torrent":{"xt":"urn:btih:aebeeea93418129654873e0ae689c54711091f10","amp;dn":"Johnny+Thunders+%26+the+Heartbreakers+-+Live+at+Max%5C%27s+Kansas+Ci","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aebeeea93418129654873e0ae689c54711091f10","infoHashBuffer":{"type":"Buffer","data":[174,190,238,169,52,24,18,150,84,135,62,10,230,137,197,71,17,9,31,16]},"announce":[],"urlList":[]}}