{"title":"LSD - Dream Emulator [Limited Edition][jap] PSX-PSP (indolemugen","uid":3784828,"size":452214486,"categoryP":"games","categoryS":"handheld","magnet":"?xt=urn:btih:af80a32d940d72d5ca4fbe1ad96bdb249a95a74f&amp;dn=LSD+-+Dream+Emulator+%5BLimited+Edition%5D%5Bjap%5D+PSX-PSP+%28indolemugen&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"IndoleMugen","files":1,"time":1188123726,"description":"To install:\nJust drop the &quot;LSD&quot; folder into your &quot;PSP:/game&quot; folder. (assuming youre already running one of the wonderful custom firmwares that support ps1 games)\n\n\n*From the wiki-wiki-wiki*\n\nLSD\n\nDeveloper: Asmik Ace Entertainment\nPublisher: JPN Asmik Ace Entertainment (PS1)\nRelease date: JPN October 22, 1998 (PS1)\nGenre: Action-adventure\nMode: Single player\nPlatform: Sony PlayStation\nInput: PlayStation controller (PS1)\n\nLSD is a video game released in Japan in 1998 for the Sony PlayStation video game console and is one of three products (the others being a music CD and a book) based on a diary of dreams that a staff member at Asmik Ace Entertainment had been keeping for a decade.\n\n\nGameplay:\n\nIn this game, the player simply navigates a dream world. There are no such things as action or experience points, nor is there any clear goal. The idea is simply to walk around and enjoy things in a dream environment. There are many bizarre environments in this world, and one way to travel through them is by foot. However, if you bump into walls or other objects in the game, you will be instantaneously transported to another environment. Bumping into people, animals, or special objects usually gives a stranger dream.\n\nEach dream lasts 10 minutes, and the player wakes up automatically from the dream at that time. However, if the player falls off a cliff in the dream, then the player may wake up immediately. There is also a graph that appears at the end of each dream that keeps track of the player&amp;#039;s state of mind. Depending on that state, the next dream may start differently.\n\nWhile you walk through an environment, the surroundings may suddenly change. For example, eyes may suddenly appear all over a wall and stare at you. Even if you visit the same place twice, it may look quite different. You may also encounter very strange creatures while roaming around. For example, you may see a celestial nymph flying through the air, a wild horse running through the prairie, or a huge man filling up an entire room.\n\nPlayers of LSD often feel like there is order to the apparent chaos, with all the &quot;random&quot;, strange events actually having some meaning and purpose.\n\n\nAudio:\n\nThere are over 500 patterns of background music in the game. These are called patterns, not tunes, because they all share the same musical score, but are played in different tones.\n\n\n\nEnjoy! ^_^","torrent":{"xt":"urn:btih:af80a32d940d72d5ca4fbe1ad96bdb249a95a74f","amp;dn":"LSD+-+Dream+Emulator+%5BLimited+Edition%5D%5Bjap%5D+PSX-PSP+%28indolemugen","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"af80a32d940d72d5ca4fbe1ad96bdb249a95a74f","infoHashBuffer":{"type":"Buffer","data":[175,128,163,45,148,13,114,213,202,79,190,26,217,107,219,36,154,149,167,79]},"announce":[],"urlList":[]}}