{"title":"stopzilla 5","uid":4833406,"size":6474239,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:af9888a7ac2832df28621a0abcef2fe9c5d4067f&amp;dn=stopzilla+5&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ascari_nations","files":3,"time":1239220410,"description":"   /          _____      _____          /            |----        |\n  /___       |          |              /___          |   |        |\n /           |          |             /              |----        |\n/            |_____     |_____       /               |           |\n                    |                                  |           |\n                    |                                  |           |\n              ______|\n\n\n\n\nSTOPzilla! 5\n\n\n\nKills all forms of Malware...\nSTOPzilla successfully scans, removes and blocks Spyware, Adware, Pop-up ads, Phishing attacks, hijackers, rootkits, Trojans, bots, drive-by downloads, rogue programs, messenger service ads, keyloggers, malicious BHOs, dialers, and much more. \n\nComprehensive Online Security...\nOur commitment to excellence has resulted in numerous awards and recognition from a wide variety of publications and software testing organizations around the world. STOPzilla's technology has protected users from Spyware / Adware in over 60 countries and has been downloaded by more than 15 million users, worldwide. \n\n\nTrue Real-timeTM Protection...\nSTOPzilla's True Real-Time protection detects, blocks, and quarantines both known and potential Spyware infections before they can attack your system and do damage. Legitimate software programs are allowed to execute freely. From the moment you start your computer, STOPzilla is working to protect you from malicious programming, so your PC is never vulnerable. \nMost advanced Pop-up blocker available...\n\nSTOPzilla's highly advanced Pop-up blocker intercepts and destroys all forms of Pop-up advertisements while allowing user-requested Pop-ups to display. STOPzilla has the intelligence to distinguish legitimate Pop-ups (banking sites, e-mail, etc.) from annoying Pop-up Ads. Not all Pop-up blockers were created equal. Basic Pop-up blockers will not block Pop-ups delivered by Spyware / Adware applications. STOPzilla's award-winning Pop-up blocking technology will block both Web site spawned Pop-ups and well as Pop-ups launched by Spyware / Adware applications. \nSimple to use...\n\nSTOPzilla has been specifically designed to perform effectively regardless the user's level of computer expertise. Upon boot-up, STOPzilla starts and requires very little user interaction. With STOPzilla, your time can be spent surfing the Web, not worrying about Spyware and Adware. \nFrequent Auto-updates &amp; Free Tech Support...\n\nSTOPzilla's Spyware / Adware research team sends out updates as often as every day to ensure that your PC security is never compromised and always protected against the latest threats. Any problem or question can be resolved free of charge by STOPzilla Customer Support. Support options include chat, e-mail, online Help and toll-free calls. ","torrent":{"xt":"urn:btih:af9888a7ac2832df28621a0abcef2fe9c5d4067f","amp;dn":"stopzilla+5","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"af9888a7ac2832df28621a0abcef2fe9c5d4067f","infoHashBuffer":{"type":"Buffer","data":[175,152,136,167,172,40,50,223,40,98,26,10,188,239,47,233,197,212,6,127]},"announce":[],"urlList":[]}}