{"title":"The State and Revolution.pdf","uid":7133050,"size":368998,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:aff7acc2b36f9233305fc2fbe8f4220fe05f6dec&amp;dn=The+State+and+Revolution.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pabolton","files":1,"time":1332771528,"description":"I couldn't find this on here so thought i would post it up. \n\nState and Revolution is Lenins most important theoretical work. Mostly, as it was a defense of marxist ideas on the state and the proletarian revolution against revisionists of marxism and communist ideas. \n\nIn simple terms Lenin clarifies the marxist position to the state. \nWe aim to smash the existing state, which is a bourgoise state. And form a new state, a workers state i.e the dictatorship of proletarian rather than the dictatorship of the bourgoise. The state is neccessary under socialism in order to dictate over the minority the bourgoise. The state is always, in the final analysis, an organ of force wielded in the interests of one class, it is not neutral and can never be. Therefore the workers state should be a temporary state one that begins to 'wither away'. Lenin looks at the Paris commune towards what a workers state looks like.\n\nThe Russian Revolution lead by the Bolsheviks was a great achievement. It was the establishment of an actual workers state. It should be noted that the Soviet union degenerated into a horrific beauracratic machine instead of withering away. Historians like Robert Service make a living off discrediting the actions of lenin and trotsky and chucking them in the same basket as Stalin. To understand this issue better i would recommend Trotsky- Revolution Betrayed to understand why the state didn't wither away and why socialism was never achieved in USSR despite having a workers state. Key term to attend to is proletarian Bonapartism.\n\nEnjoy the book, one of the best marxist texts.\n\n","torrent":{"xt":"urn:btih:aff7acc2b36f9233305fc2fbe8f4220fe05f6dec","amp;dn":"The+State+and+Revolution.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aff7acc2b36f9233305fc2fbe8f4220fe05f6dec","infoHashBuffer":{"type":"Buffer","data":[175,247,172,194,179,111,146,51,48,95,194,251,232,244,34,15,224,95,109,236]},"announce":[],"urlList":[]}}