{"title":"Frontsoldaten. The German Soldier in World War II","uid":9671036,"size":1205453,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b0d4161a761fff6c19e3007c444d95f3721a1aaf&amp;dn=Frontsoldaten.+The+German+Soldier+in+World+War+II&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"PirateBook","files":3,"time":1393463030,"description":"\nBy Stephen G. Fritz\n\n&quot; Alois Dwenger, writing from the front in May of 1942, complained that people forgot &quot;the actions of simple soldiers....I believe that true heroism lies in bearing this dreadful everyday life.&quot; In exploring the reality of the Landser, the average German soldier in World War II, through letters, diaries, memoirs, and oral histories, Stephen G. Fritz provides the definitive account of the everyday war of the German front soldier. \n\nThe personal documents of these soldiers, most from the Russian front, where the majority of German infantrymen saw service, paint a richly textured portrait of the Landser that illustrates the complexity and paradox of his daily life. Although clinging to a self-image as a decent fellow, the German soldier nonetheless committed terrible crimes in the name of National Socialism. \n\nWhen the war was finally over, and his country lay in ruins, the Landser faced a bitter truth: all his exertions and sacrifices had been in the name of a deplorable regime that had committed unprecedented crimes. With chapters on training, images of combat, living conditions, combat stress, the personal sensations of war, the bonds of comradeship, and ideology and motivation, Fritz offers a sense of immediacy and intimacy, revealing war through the eyes of these self-styled &quot;little men.&quot; \n\nA fascinating look at the day-to-day life of German soldiers, this is a book not about war but about men. It will be vitally important for anyone interested in World War II, German history, or the experiences of common soldiers throughout the world.\n\nGenre: Non Fiction | History | World War II","torrent":{"xt":"urn:btih:b0d4161a761fff6c19e3007c444d95f3721a1aaf","amp;dn":"Frontsoldaten.+The+German+Soldier+in+World+War+II","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b0d4161a761fff6c19e3007c444d95f3721a1aaf","infoHashBuffer":{"type":"Buffer","data":[176,212,22,26,118,31,255,108,25,227,0,124,68,77,149,243,114,26,26,175]},"announce":[],"urlList":[]}}