{"title":"Alex Jones Show - 2013 Mar 21 TH [sebaygo1]","uid":8284286,"size":89614781,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:b12b8814a47dacb61a35590e335270087e494a80&amp;dn=Alex+Jones+Show+-+2013+Mar+21+TH+%5Bsebaygo1%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"sebaygo1","files":12,"time":1363907657,"description":"\t\t\t\t\t\t\t\nThe Alex Jones Show\nThursday, 21 Mar 2013\n\n\n[sebaygo1]\n\n\nShow Description\n................\n\nFrom the Infowars web site :: On the Thursday, March 21 edition of The Alex Jones Show, Obama is outed as the head of Al Qaeda worldwide. \n\nAlex will also cover the unfolding situation in Syria as the U.S. &quot;elects&quot; a new Syrian leader, moves to support al-Qaeda and a gruesome video surfaces showing the beheading of a civilian by the so-called &quot;rebels.&quot; \n\nAlex also analyzes the latest on efforts by the gun-grabbers to take down the Second Amendment and the Department of Homeland Security boss Janet Napolitano's refusal to answer questions on bullet purchases by the agency. \n\nOn today's show, Alex talks with Jon Rappoport about the alleged assassin James Holmes, mind control, the CIA and MKULTRA. \n\nAlex also talks with New York Times-bestselling author and investigative journalist Greg Palast about the banker heist. Palast is the author of The Best Democracy Money Can Buy and Billionaires and Ballot Bandits: How to Steal an Election in 9 Easy Steps.\n\n\n\n\n#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#\nNot able to find a torrent of mine where or when you \nexpected it?\nCheck out my torrents blog for info about what I am\nuploading, tracker problems, etc..\n\nSome sites will not allow a blogspot URL in an \nuploaded torrent's description, so I have included \nthe blog's web address in a file included with this\ntorrent named:\nsebaygo1_TorrentsAndBlogInfo_ver2.pdf\n#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#\n\n\n\n_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n \n It is my opinion that in this time it is virtually essential \n to seek information from a variety of sources, to listen to a\n spectrum of voices in order to better  understand the &quot;big \n picture.&quot; A reliance solely upon mainstream corporate media \n for news and info is a prescription for ignorance. I try to\n share information that counters the monotone of mainstream\n corporate media. \n\n NOTE: The material here is made available strictly as\n information. Do not assume my support for or endorsement \n of the contents.\n\n Think for yourself! To paraphrase the late William Cooper: \n Read everything, listen to everything, but believe nothing \n until you've researched it yourself.\n \n !! please try some of the other shows I upload too !! \n\n_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n..........\n\nfolder.jpg courtesy of commenter &quot;Nighted&quot; at the sebaygo1 blog\n..........\n","torrent":{"xt":"urn:btih:b12b8814a47dacb61a35590e335270087e494a80","amp;dn":"Alex+Jones+Show+-+2013+Mar+21+TH+%5Bsebaygo1%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b12b8814a47dacb61a35590e335270087e494a80","infoHashBuffer":{"type":"Buffer","data":[177,43,136,20,164,125,172,182,26,53,89,14,51,82,112,8,126,73,74,128]},"announce":[],"urlList":[]}}