{"title":"Introduction to Cosmology [2015]","uid":11958905,"size":3390667,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b142d6d4d2964803d9023a1404821d02668d397f&amp;dn=Introduction+to+Cosmology+%5B2015%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"NoctDeath","files":2,"time":1432510690,"description":"Title: Introduction to Cosmology\nAuthor: Matts Roos\nFormat: PDF\nHardcover: 288 pages\nPublisher: Wiley; 4 edition (April 20, 2015)\nLanguage: English\nISBN-10: 9781118923320\n\nThe Fourth Edition ofIntroduction to Cosmology provides a concise, authoritative study of cosmology at an introductory level. Starting from elementary principles and the early history of cosmology, the text carefully guides the student on to curved spacetimes, special and general relativity, gravitational lensing, the thermal history of the Universe, and cosmological models, including extended gravity models, black holes and Hawking's recent conjectures on the not-so-black holes.\n\nIntroduction to Cosmology, Fourth Edition includes: \n\n* New theoretical approaches and in-depth material on observational astrophysics and expanded sections on astrophysical phenomena \n* Illustrations throughout and comprehensive references with problems at the end of each chapter and a rich index at the end of the book \n* Latest observational results from WMAP9, ACT, and Planck, and all cosmological parameters have been brought up to date.\n\nThis text is invaluable for undergraduate students in physics and astrophysics taking a first course in cosmology. Extensively revised, this latest edition extends the chapter on cosmic inflation to the recent schism on eternal inflation and multiverses. Dark matter is discussed on galaxy and cluster scales, and dark matter candidates are presented, some requiring a five-dimensional universe and several representing various types of exotica. In the context of cosmic structures the cold dark matter paradigm is described. Dark energy models include the cosmological constant, quintessence and other single field models, f(R) models and models requiring extra dimensions","torrent":{"xt":"urn:btih:b142d6d4d2964803d9023a1404821d02668d397f","amp;dn":"Introduction+to+Cosmology+%5B2015%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b142d6d4d2964803d9023a1404821d02668d397f","infoHashBuffer":{"type":"Buffer","data":[177,66,214,212,210,150,72,3,217,2,58,20,4,130,29,2,102,141,57,127]},"announce":[],"urlList":[]}}