{"title":"Freud Evaluated - The Completed Arc by Malcolm Macmillan","uid":10121344,"size":45439983,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b2b1ce79f20532a565f8e4f553673a4cae21d377&amp;dn=Freud+Evaluated+-+The+Completed+Arc+by+Malcolm+Macmillan&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":-1,"time":1399677417,"description":"Freud Evaluated - The Completed Arc (1991) by Malcolm Macmillan.pdf\n\nThis volume is an historically based critical evaluation of Freud's personality theory. In it the observations Freud made are described and the theoretical ideas he put forward for explaining them are set out. The adequacy of Freud's explanations are judged against the logical and scientific standards of Freud's own time. The historical perspective will give the reader a sound basis on which to make a judgement about psycho-analysis as a method of investigation and a theory of personality as well as a sense of what Freud was about from Freud's own standpoint.\n\nFreud's endeavour is sited in the psychological and psychiatric context of the time, a period not previously given the critical attention it warrants. All of Freud's important assumptions and characteristic modes of thought are to be found in this formative period. The placement also brings out more clearly the basis of a number of the unresolved problems of contemporary psycho-analytic theory, such as the place of affect and the instinctual drives, the role of the ego, and the basis of treatment. The core of the evaluation centres on Freud's basic method for gathering data - free association - a method which is not much written about and hardly ever criticised. What is said about it is new and more substantial than the few criticisms that have been made. Although a very critical work, there is probably no other appraisal which allows Freud and his colleagues and followers to speak so directly for themselves.\n\nSeries: Advances in Psychology (Book 75)\n700 pages\nPublisher: North Holland; 1 edition\nLanguage: English\nISBN-10: 0444887172\nISBN-13: 978-0444887177","torrent":{"xt":"urn:btih:b2b1ce79f20532a565f8e4f553673a4cae21d377","amp;dn":"Freud+Evaluated+-+The+Completed+Arc+by+Malcolm+Macmillan","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b2b1ce79f20532a565f8e4f553673a4cae21d377","infoHashBuffer":{"type":"Buffer","data":[178,177,206,121,242,5,50,165,101,248,228,245,83,103,58,76,174,33,211,119]},"announce":[],"urlList":[]}}