{"title":"Final Fantasy Tactics - War of the lions - Android - Ignus Draco","uid":14751101,"size":670583882,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:b2df868ec9a714c1989af1d4081b93731ee3bf15&amp;dn=Final+Fantasy+Tactics+-+War+of+the+lions+-+Android+-+Ignus+Draco&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"IgnusD","files":1,"time":1464760408,"description":"EN\r\n\r\nFinal Fantasy Tactics (ファイナルファンタジータクティクス Fainaru Fantajī Takutikusu?) is a tactical role-playing game developed and published by Square (now Square Enix) for the Sony PlayStation video game console. It is the first game of the Final Fantasy Tactics series and was released in Japan in June 1997 and in the United States in January 1998. The game combines thematic elements of the Final Fantasy video game series with a game engine and battle system unlike those previously seen in the franchise. In contrast to other 32-bit era Final Fantasy titles, Final Fantasy Tactics uses a 3D, isometric, rotatable playing field, with bitmap sprite characters.[2]\r\n\r\nFinal Fantasy Tactics is set in a fictional medieval-inspired kingdom called Ivalice created by Yasumi Matsuno. The game's story follows Ramza Beoulve, a highborn cadet who finds himself thrust into the middle of an intricate military conflict known as The Lion War, where two opposing noble factions are coveting the throne of the kingdom. As the story progresses, Ramza and his allies discover a sinister plot behind the war.\r\n\r\n\r\nPT-BR\r\n\r\nFinal Fantasy Tactics (ファイナルファンタジータクティクス, Fainaru Fantajī Takutikusu?) é um jogo eletrônico do gênero RPG tático desenvolvido e publicado pela Square Co. para o PlayStation. Foi o primeiro jogo da subsérie Final Fantasy Tactics, sendo lançado no Japão em junho de 1997 e nos Estados Unidos em janeiro de 1998. O jogo combina elementos temáticos da série Final Fantasy com um motor de jogo e sistema de batalha diferente do que havia sido feito anteriormente na franquia. Tactics usa um campo de jogo tridimensional, isométrico e rotacionável.\r\nO jogo se passa em um reino medieval ficcional chamado Ivalice criado pelo diretor e roteirista Yasumi Matsuno. A história segue Ramza Beoulve, um cadete que acaba se envolvendo no meio de um complicado conflito militar conhecido como A Guerra do Leão, onde duas facções nobres rivais estão competindo pelo trono do reino. Ramza e seus aliados acabam descobrindo um plano sinistro por de trás da guerra","torrent":{"xt":"urn:btih:b2df868ec9a714c1989af1d4081b93731ee3bf15","amp;dn":"Final+Fantasy+Tactics+-+War+of+the+lions+-+Android+-+Ignus+Draco","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b2df868ec9a714c1989af1d4081b93731ee3bf15","infoHashBuffer":{"type":"Buffer","data":[178,223,134,142,201,167,20,193,152,154,241,212,8,27,147,115,30,227,191,21]},"announce":[],"urlList":[]}}