{"title":"Disturbed-Ten_Thousand_Fists-(Retail)-2005-HHI","uid":6562430,"size":101035417,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:b2ee7e65f601aecdd3650db937778a909a104ec5&amp;dn=Disturbed-Ten_Thousand_Fists-%28Retail%29-2005-HHI&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"raidy","files":17,"time":1311539958,"description":"[HHI] - Happy Hacker Industries - [HHI]\nRelease Information\n\n Artist......: Disturbed \n Album.......: Ten thousand fists \n Grabber : EAC \n Encoder : LAME v3.90.3 \n Release Date: Sep-25-2005 \n Rip Date....: Jun-30-2006 \n Genre.......: Rock \n Quality : VBRkbps / 44.1kHz / Joint-Stereo \n Playtime : 56:26 min \n Ripper : Happy Hacker Industries \n CD Songs : 14 \n Label.......: Warner Brothers \n Album Info..: \n \n It started in 2000 with &quot;Down with the Sickness.&quot; Disturbed's thick, rhythmic take on alt-metal was perfect music for stalking bloody zombies, and vocalist David Draiman's jaw-snapping Pavlovian grunts made the trigger fingers of first-person shooters itch.\n\n There were threads of other groups in the sound -- Pantera's wrenching power, \n Slipknot, the ill-lighted parlor games of Tool. But Disturbed held their own from the start, so get up, come on get down with the sickness. If 2002's Believe downplayed  Draiman's guttural responses a little, that tact's long gone for 2005's Ten Thousand Fists. From Todd McFarlane's evocative wronged misfits artwork -- Suicide Girls stand fists upraised next to ghoulish fiends and disenfranchised truckers -- to the rousing staccato of the title track and the &quot;Sickness&quot; rewrite &quot;Stricken,&quot; Disturbed solidify their stance as the black knights of gaming-console rock. Creepy electronics slither behind Dan Donegan's guitar, and he mostly forsakes soloing to concentrate on the visceral groove. \n\nWhen he's not hacking like a chained-up pit bull, Draiman emotes from the valley of reverb (that's next to the valley of death), and his moments of epic roar make the songs' choppier parts more effective. Now, &quot;Overburdened&quot; takes the epic stuff a little too far. Draiman starts off the song in narration, muttering &quot;Fate is so unkind&quot; like a monster who's been given the power to feel. But even in its swirling pretentiousness, you can't deny his intensity. Luckily the majority of \n Fists sticks to mid-tempo punishers that pound back anger-gritted teeth and no \n anesthesia. (Remember, Disturbed's tours are underwritten by JÃŽÂ£germeister, the black licorice firewater that punches Saturday night in the face.) &quot;Deify&quot; rails against blind devotion to political leaders and &quot;Sons of Plunder&quot; stalks at a faster, more aggressive faster heart rate, while &quot;Decadence&quot; and &quot;Sacred Lie&quot; drop into the rhythmic grip that by mid- to late album is almost comfortable in its gloomy thump. \n \n(Disturbed's ill-advised cover of Genesis' &quot;Land of Confusion&quot;? No comment.) Ten \n Thousand Fists does start to sound the same after a while. But those bloody zombies aren't going to stop pouring though the doorway, so it's a good thing it has at least 12 burly alt-metal rockers. Fire! \n \n \n Album opinion is taken from sites such as cduniverse and allmusic, \n HHI does not express an opinion either way with regard to the quality \n of the band etc. We hope you enjoy the music whatever it is! \n \n \n Track Listing....: \n 01.Ten thousand fists [03:33] \n 02.Just stop [03:46] \n 03.Guarded [03:23] \n 04.Deify [04:18] \n 05.Stricken [04:07] \n 06.I'm alive [04:42] \n 07.Sons of plunder [03:51] \n 08.Overburdened [05:59] \n 09.Decadence [03:27] \n 10.Forgiven [04:15] \n 11.Land of confusion [04:50] \n 12.Sacred lie [03:08] \n 13.Pain redefined [04:10] \n 14.Avarice [02:57] \n ____ \n \n 56:26 min \n 96,3 MB","torrent":{"xt":"urn:btih:b2ee7e65f601aecdd3650db937778a909a104ec5","amp;dn":"Disturbed-Ten_Thousand_Fists-%28Retail%29-2005-HHI","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b2ee7e65f601aecdd3650db937778a909a104ec5","infoHashBuffer":{"type":"Buffer","data":[178,238,126,101,246,1,174,205,211,101,13,185,55,119,138,144,154,16,78,197]},"announce":[],"urlList":[]}}