{"title":"EnigmaT Set Rips { Cuts } - October 10th, 2013","uid":9028481,"size":458449142,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:b34029ce9b9ad473806f588d28c27f91a98cb7ce&amp;dn=EnigmaT+Set+Rips+%7B+Cuts+%7D+-+October+10th%2C+2013&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"EnigmaT","files":47,"time":1381411930,"description":"Ad Brown And Hannah Ray - Ready And Waiting (Cut From Ferry Set)-enTc.mp3\nAlessandro Diga - End Of This Road (Marc Poppcke Remix) (Cut From Ruben Set)-enTc.mp3\nAlessandro Diga - End Of This Road (Marc Poppcke Remix) (Cut From Slang Set)-enTc.mp3\nAlvita - Cyborg (Cut From Ferry Set)-enTc.mp3\nAndy Moor Feat. Nicole McKenna - Please Forgive Me (The Madison Remix) (Cut From Shiver Set)-enTc.mp3\nAraya &amp; Mark Dreamer - Tension (New World Remaster) (Cut From Uplift Set)-enTc.mp3\nAscania - Intergalactic Network (Dub Edit) (Cut From Uplift Set)-enTc.mp3\nBeatsole &amp; Michael Retouch - Brilliant Sunrise (Original Mix) (Cut From Anderson Set)-enTc.mp3\nBobina with Ana Criado - For Who I Am (Viente &amp; Airen Remix) (Cut From Bobina Set)-enTc.mp3\nConjure One Feat Aruna - Still Holding On (Original Mix) (Cut From Shiver Set)-enTc.mp3\nCosmic Heaven - Taste of Love (Martin Libsen Remix) (Cut From Uplift Set)-enTc.mp3\nCreative 5 &amp; Katrin Souza - Get In (Original Mix) (Cut From Anderson Set)-enTc.mp3\nDave Spoon - At Night (Tom Staar Remix) (Cut From Ferry Set)-enTc.mp3\nDerek Ryan feat. Charmy - Faster Than Light (Mike Koglin Remix) (Cut From Feel Set)-enTc.mp3\nDigital Affliction &amp; Leffix - Ultra (Cut From Wizz Set)-enTc.mp3\nDJ Sashay - The Heavenly Highway (Original Mix) (Edit) (Cut From Uplift Set)-enTc.mp3\nDNYO - Medianoche (Elio Kr Remix) (Cut From Slang Set)-enTc.mp3\nDominik von Francois - Elemental (Ihor Mihal Remix) (Cut From Anderson Set)-enTc.mp3\nDominik von Francois - More Than Binary (Kago Pengchi Remix) (Cut From Anderson Set)-enTc.mp3\nDominik von Francois - Strogressive (Mosahar Remix) (Cut From Saux Set)-enTc.mp3\nDominik von Francois - Symbiosis (Max Solar &amp; Next Beat Remix) (Cut From Uplift Set)-enTc.mp3\nEmanuele Congeddu - Rapa Nui Bay (Amitacek Remix) (Cut From Uplift Set)-enTc.mp3\nEmma Louise - 17 Hours (Luigi Lusini Remix) (Cut From Ruben Set)-enTc.mp3\nEtasonic - Unrealized Dream (Airstorm Remix) (Cut From Uplift Set)-enTc.mp3\nGorgon City - Real (Walden Remix) (Set Rip)-enTc.mp3\nHeadstrong feat. Stine Grove - Satellite (DJ Feel Euphoric Mix) (Cut From Feel Set)-enTc.mp3\nHydrogenio - Solaris (Original Mix) (Cut From Feel Set)-enTc.mp3\nJericho Ismael - Vibe (Original Mix) (Cut From Anderson Set)-enTc.mp3\nJunior J - I Feel You (Galaxia LL Dub) (Cut From Anderson Set)-enTc.mp3\nKaimo K - Machete (Cut From Saux Set)-enTc.mp3\nM.I.K.E. - Fiesta Escape (Cut From Saux Set)-enTc.mp3\nMartian pres. Robots On Mars - Nothing Left To Chance (Yura Moonlight Remix) (Cut From Anderson Set)-enTc.mp3\nMoonbeam feat. Archngl - Sun Went Down (Ost &amp; Meyer Remix) (Cut From Anderson Set)-enTc.mp3\nNaian - Plastics (Cut From Ruben Set)-enTc.mp3\nNapalm &amp; D-Phrag - Stranded (Cut From Slang Set)-enTc.mp3\nPaul Ercossa - Vendetta (Skytech Remix) (Cut From Super8 Set)-enTc.mp3\nPhrakture - As The Early Tide Rises (Cut From Slang Set)-enTc.mp3\nPhrakture - Back For Me (Cut From Slang Set)-enTc.mp3\nPhrakture - The Storm Within (Cut From Slang Set)-enTc.mp3\nRodg - Life is Life (Cut From Ruben Set)-enTc.mp3\nRymania - Pure Emotion (tranzLift Remix) (Cut From Uplift Set)-enTc.mp3\nSnatt &amp; Vix feat. Kainos - In Stillness (Ian Standerwick Dub) (Cut From Saux Set)-enTc.mp3\nSomnium Sensu - Oasis Of Heaven (Ikerya Project Remix) (Cut From Uplift Set)-enTc.mp3\nSymfonica - Brazen Rivers (Original Mix) (Cut From Uplift Set)-enTc.mp3\nTimo Vaittinen - Fiktio (Original Mix) (Cut From Anderson Set)-enTc.mp3\nWalden - Intropial (Special Features Mix) (Set Rip)-enTc.mp3\nWalden - Nouka (Original Mix) (Set Rip)-enTc.mp3\n","torrent":{"xt":"urn:btih:b34029ce9b9ad473806f588d28c27f91a98cb7ce","amp;dn":"EnigmaT+Set+Rips+%7B+Cuts+%7D+-+October+10th%2C+2013","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b34029ce9b9ad473806f588d28c27f91a98cb7ce","infoHashBuffer":{"type":"Buffer","data":[179,64,41,206,155,154,212,115,128,111,88,141,40,194,127,145,169,140,183,206]},"announce":[],"urlList":[]}}