{"title":"Fundamentals of Palliative Care for Student Nurses (Wiley) [PDF]","uid":11078272,"size":6590147,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b38252ea29c6355ebb91217098562c91ffc1f7fc&amp;dn=Fundamentals+of+Palliative+Care+for+Student+Nurses+%28Wiley%29+%5BPDF%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"0xmovva","files":2,"time":1411363470,"description":"Author: Megan Rosser (Author), Helen Walsh (Author)\nSeries: Fundamentals\nPaperback: 304 pages\nPublisher: Wiley-Blackwell; 1 edition (November 3, 2014)\nLanguage: English\nISBN-10: 1118437802\nISBN-13: 978-1118437803\nFormat: Retail PDF\nReader Required: Adobe Reader, Foxit, Nitro, Adobe Digital Editions\n\nNote: This is the eBook of the printed book and may not include any media,website access codes, or print supplements that may come packaged with the bound book.\n\nTested on the above readers with no problems on laptop and Android tablet. Please allow a couple seconds forthe seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\n\n________________________________________________________________________________\n\n\nFundamentals of Palliative Care for Student Nurses is a thorough yet accessible introduction and overview of a key area of the nursing programme. This textbook clearly explains the palliation of symptoms and the social context of death and dying. Engaging with the latest guidelines and curriculum, it highlights the practical and communicative skills required for induction programmes and continuing professional development.\n\nKEY FEATURES:\n\nA full-colour, student-friendly, introduction to the essentials of palliative, or end of life care\nA topical and timely subject area, explored clearly and concisely\nFull of interactive pedagogy and features, including quizzes, multiple choice questions, vignettes/case studies and activities\nFeatures a companion website with links to further reading, additional activities and resources, and self-testing interactive multiple choice questions\nFundamentals of Palliative Care for Student Nurses focuses on this area with expert knowledge and compassion, preparing students in order to help them provide the best possible care for their patients and their families.","torrent":{"xt":"urn:btih:b38252ea29c6355ebb91217098562c91ffc1f7fc","amp;dn":"Fundamentals+of+Palliative+Care+for+Student+Nurses+%28Wiley%29+%5BPDF%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b38252ea29c6355ebb91217098562c91ffc1f7fc","infoHashBuffer":{"type":"Buffer","data":[179,130,82,234,41,198,53,94,187,145,33,112,152,86,44,145,255,193,247,252]},"announce":[],"urlList":[]}}