{"title":"Fela Kuti - The '69 Los Angeles Sessions [FLAC] TQMP","uid":8091513,"size":305327808,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:b39ae6292b1a28811721597a00f0d18efba6072c&amp;dn=Fela+Kuti+-+The+%2769+Los+Angeles+Sessions+%5BFLAC%5D+TQMP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pastafari","files":18,"time":1359734312,"description":"Fela Ransome Kuti &amp; Nigeria 70 - The '69 Los Angeles Sessions\n1993\nStern's Music, STCD3005\n\nThese recordings were made during a visit to the United States by Fela and his group which was then called Koola Lobitos. Upon their arrival in America, Fela changed the name of the group to FELA RANSOME-KUTI &amp; NIGERIA 70. They toured America for some eight months between July 1969 and March 1970. It was during this period that Sandra Isidore, a friend living in Los Angeles, introduced Fela to the writings and the philosophy of Malcolm X, Eldridge Cleaver and other black American activists, as well as a view of history that situated Africa as the cradle of humanity and Egypt as the crucible of African civilisation. The irony of having to travel to the 'new world' to discover his own origins was surely not lost on Fela, but meanwhile their tour was a sporadic illorganised venture with as many problems as successes, particularly when they fell out with their erstwhile promoter who promptly reported them to the U.S. Immigration Department in Los Angeles. They were arrested, interrogated and charged with working without the benefit of work permits. \n\nThey were given a date to appear in court and engaged the services (for $250) of a Chinese immigration laywer. Realising that their days were numbered in 'the land of opportunity', they wanted to get into a recording studio before being unceremoniously evicted. They pleaded with their lawyer to gain them sufficient time to get some of Fela's songs on tape. On the day of the court hearing, they were only able to come up with $200 of their laywer's fee but he was nevertheless successful in obtaining 60 days grace for them before they would be obliged to leave the country. This was cause for some celebration, the only snag being that they were broke and without the benefit of a record deal. They enlisted the help of friends, including the Ghanaian trumpeter Duke Lumumba (Fela was also playing the trumpet at that time), Sandra Isidore and a few others. They were able to scrape together the necessary funds to book a recording studio and engineer (name unknown). \n\nUpon their return to Nigeria, Fela once again changed the name of the group, this time to FELA RANSOME-KUTI &amp; EGYPT 70. A number of the L.A. songs were released as singles but this is the first time that this unique collection of titles have ever appeared together on one album. Unusually for Fela, most of the songs recorded in the L.A. sessions were short, although aficionados of Fela's music will be able to recognise themes and riffs that he was later to develop into the full blown, multi-layered symphonic works with which we are now familiar.\n~ CD liner notes.\n\n* * * * * * * * * * * * * * * * * * *\n\nTrack List\n\n01 - My Lady Frustration\n02 - Viva Nigeria\n03 - Obe\n04 - Ako\n05 - Witchcraft\n06 - Wayo\n07 - Lover\n08 - Funky Horn\n09 - Eko\n10 - This Is Sad\n\n* * * * * * * * * * * * * * * * * * *\n\nEAC log, CUE sheet &amp; artwork included.\n\nPastafari &lt;a href=&quot;\nhttp://thepiratebay.se/user/pastafari/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/pastafari/&lt;/a&gt;\nTQMP. The Quality Music Project.","torrent":{"xt":"urn:btih:b39ae6292b1a28811721597a00f0d18efba6072c","amp;dn":"Fela+Kuti+-+The+%2769+Los+Angeles+Sessions+%5BFLAC%5D+TQMP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b39ae6292b1a28811721597a00f0d18efba6072c","infoHashBuffer":{"type":"Buffer","data":[179,154,230,41,43,26,40,129,23,33,89,122,0,240,209,142,251,166,7,44]},"announce":[],"urlList":[]}}