{"title":"Paradise cracked (rus)","uid":4177785,"size":1499857232,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:b427c839a43824b7c3ab7115082ad003ddab275b&amp;dn=Paradise+cracked+%28rus%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"soulsberry","files":5,"time":1210231540,"description":"Created by GFI Russia, Paradise Cracked is a single-player turn-based strategy computer game. It was released in 2002. Unfortunately, it has several translation problems that make the game a little difficult to understand, but the player can still understand the gist of what is going on.\n\nThe player starts as a character simply named Hacker who is just as the name implies. Hacker starts his adventure with a pistol and the ability to hack certain objects (ATM&amp;#039;s, Trade Robots, etc.) as well as a journal which gives maps of the area and tells you missions both current and completed. As certain missions are completed, the character&amp;#039;s level will increase and skills can have points added to them increasing areas like strength, aim, hacking skill, health points and so forth.\n\nThe game offers the option to go it solo or to join with other characters or groups (such as the mob). Hacker is constantly hunted by the law making teaming up with someone in the best interest of the player&amp;#039;s survival. Teaming up will also add new missions to Hackers Journal.\n\nAdditional weapons, items, and body armor can be acquired by purchase or by killing another player. The character&amp;#039;s strength determines what weight of weapons, items etc. he can carry while certain clothing will increase or decrease the amount of items they can carry. The heavier the weight, the less distance the character can move in a given turn. As strength and level increase, so will a character&amp;#039;s distance he can travel.\n\nThe relatively simple gameplay makes it an easy game to pick up but the game never really gained much ground in terms of commercial success.","torrent":{"xt":"urn:btih:b427c839a43824b7c3ab7115082ad003ddab275b","amp;dn":"Paradise+cracked+%28rus%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b427c839a43824b7c3ab7115082ad003ddab275b","infoHashBuffer":{"type":"Buffer","data":[180,39,200,57,164,56,36,183,195,171,113,21,8,42,208,3,221,171,39,91]},"announce":[],"urlList":[]}}