{"title":"Trance Music Video Collection #2 (2011) (HD) (Inspiron)","uid":6763901,"size":1345449399,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:b48c2837371006f0c7af7fe6da8d996ebf14e4fa&amp;dn=Trance+Music+Video+Collection+%232+%282011%29+%28HD%29+%28Inspiron%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"-inspiron-","files":23,"time":1319297519,"description":"Trance Music Video Collection #2 (Inspiron)\n 1080p, 720p HD mp4 and flv formats\n\n\n\nHey guys, here\\'s an other collection of trance videos, most of them are in HD but the old released videos are only available in flv format, sorry for that, anyway, because i\\'m late to upload this, i\\'ve added more videos this time, hope you like them, please post your requests here for the upcoming collection of videos, rate if you like it, comments are welcomed, check out Tiesto Ft. Julie - somewhere inside, my favourite, anyway, cheers all and thanks for supports\n\n\n\nTwitter: inspiron22\n\n\nTracklist:\n\n\n\n\nAly &amp; Fila feat. Jwaydan - We Control The Sunlight (Official Music Video)\nAndy Moor feat. Sue McLaren - Fight The Fire (Official Music Video)\nArmin van Buuren &amp; DJ Shah Feat. Chris Jones - Going Wrong (Official Music Video)\nArmin van Buuren Feat Jennifer Rene - Fine Without You (Official Music Video)\nATB feat. JanSoon - Move On (Official Music Video)\nDJ Shah feat. Inger Hansen - Don\\'t wake me up (Official Music Video)\nRoger Shah feat. Moya Brennan - Morning Star (Orchestral Version) (Official Music Video)\ntyDi feat. Sarah Howells - Acting Crazy (Official Music Video)\nDash Berlin - Till The Sky Falls Down (Official Music Video)\nDash Berlin feat Emma Hewitt - Waiting (Official Music Video) [High Quality]\nDash Berlin with Cerf Mitiska &amp; Jaren - Man On The Run (Official Music Video)\nArmin van Buuren vs Sophie Ellis-Bextor - Not Giving Up On Love (Official Music Video)\nArmin van Buuren feat. VanVelzen - Broken Tonight (Official Music Video)\nMotorcycle - As The Rush Comes (Official Music Video)\nAly &amp; Fila feat. Josie - Listening (Official Music Video) [High Quality]\nArmin van Buuren feat. Laura V - Drowning (Official Music Video) [Full HD]\nChicane - Poppiholla (Official Music Video)\nJosh Gabriel presents Winter Kills - My Friend (Official Music Video) [High Quality]\nRoger Shah presents Sunlounger feat. Zara Taylor - Found (Official Music Video) [High Quality]\nAllure feat. Julie Thompson - Somewhere Inside (from Elements Of Life Copenhagen DVD)\nShogun - Nadia (feat. Hannah Ray) (Official Music Video) [High Quality]\nBetsie Larkin &amp; John O\\'Callaghan - The Dream\nFirst State ft. Relyk - Cross The Line\n\n\n\nEnjoy\n(Inspiron)\n","torrent":{"xt":"urn:btih:b48c2837371006f0c7af7fe6da8d996ebf14e4fa","amp;dn":"Trance+Music+Video+Collection+%232+%282011%29+%28HD%29+%28Inspiron%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b48c2837371006f0c7af7fe6da8d996ebf14e4fa","infoHashBuffer":{"type":"Buffer","data":[180,140,40,55,55,16,6,240,199,175,127,230,218,141,153,110,191,20,228,250]},"announce":[],"urlList":[]}}