{"title":"Jesus, Interrupted","uid":7951993,"size":367018648,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:b4b77bcb0cdc37e263c99d1c1960fb7fd0855818&amp;dn=Jesus%2C+Interrupted&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"cloak-and-dagger","files":-1,"time":1356303243,"description":"Picking up where Bible expert Bart Ehrman's &quot;New York Times&quot; bestseller &quot;Misquoting Jesus&quot; left off, &quot;Jesus, Interrupted&quot; addresses the larger issue of what the New Testament actually teaches--and it's not what most people think. Here Ehrman reveals what scholars have unearthed:\n\nThe authors of the New Testament have diverging views about who Jesus was and how salvation works\n\nThe New Testament contains books that were forged in the names of the apostles by Christian writers who lived decades later\n\nJesus, Paul, Matthew, and John all represented fundamentally different religions\n\nEstablished Christian doctrines--such as the suffering messiah, the divinity of Jesus, and the trinity--were the inventions of still later theologians\n\nThese are not idiosyncratic perspectives of just one modern scholar. As Ehrman skillfully demonstrates, they have been the standard and widespread views of critical scholars across a full spectrum of denominations and traditions. Why is it most people have never heard such things? This is the book that pastors, educators, and anyone interested in the Bible have been waiting for--a clear and compelling account of the central challenges we face when attempting to reconstruct the life and message of Jesus.","torrent":{"xt":"urn:btih:b4b77bcb0cdc37e263c99d1c1960fb7fd0855818","amp;dn":"Jesus%2C+Interrupted","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b4b77bcb0cdc37e263c99d1c1960fb7fd0855818","infoHashBuffer":{"type":"Buffer","data":[180,183,123,203,12,220,55,226,99,201,157,28,25,96,251,127,208,133,88,24]},"announce":[],"urlList":[]}}