{"title":"Inventing the Charles River (US History Maps Art Photos ebook).p","uid":9451128,"size":94767483,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b571005d768c479da57ef9eb7e279f5ae0b88052&amp;dn=Inventing+the+Charles+River+%28US+History+Maps+Art+Photos+ebook%29.p&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"STBGD","files":-1,"time":1389142459,"description":"Karl Haglund, &quot;Inventing the Charles River&quot;\nEnglish | 2002-09-16 | ISBN: 0262083078 | 516 pages | PDF | 90.4 mb\n\nThe Charles River Basin, extending nine miles upstream from the harbor, has been called Boston's &quot;Central Park.&quot; Yet few realize that this apparently natural landscape is a totally fabricated public space. Two hundred years ago the Charles was a tidal river, edged by hundreds of acres of salt marshes and mudflats. Inventing the Charles River describes how, before the creation of the basin could begin, the river first had to be imagined as a single public space. The new esplanades along the river changed the way Bostonians perceived their city; and the basin, with its expansive views of Boston and Cambridge, became an iconic image of the metropolis.\n\nThe book focuses on the precarious balance between transportation planning and stewardship of the public realm. Long before the esplanades were realized, great swaths of the river were given over to industrial enterprises and transportation millponds, bridges, landfills, and a complex network of road and railway bridges. In 1929, Boston's first major highway controversy erupted when a four-lane road was proposed as part of a new esplanade. At twenty-year intervals, three riverfront road disputes followed, successively more complex and disputatious, culminating in the lawsuits over &quot;Scheme Z,&quot; the Big Dig's plan for eighteen lanes of highway ramps and bridges over the river. More than four hundred photographs, maps, and drawings illustrate past and future visions for the Charles and document the river's place in Boston's history.\n","torrent":{"xt":"urn:btih:b571005d768c479da57ef9eb7e279f5ae0b88052","amp;dn":"Inventing+the+Charles+River+%28US+History+Maps+Art+Photos+ebook%29.p","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b571005d768c479da57ef9eb7e279f5ae0b88052","infoHashBuffer":{"type":"Buffer","data":[181,113,0,93,118,140,71,157,165,126,249,235,126,39,159,90,224,184,128,82]},"announce":[],"urlList":[]}}