{"title":"Little House On The Praire Series One-Disc 4-Episodes[13-16]h.26","uid":7030142,"size":3130697251,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:b6cbb7dbd024b334cdea85a7eecab7fd2cac988d&amp;dn=Little+House+On+The+Praire+Series+One-Disc+4-Episodes%5B13-16%5Dh.26&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"jocktheripper","files":-1,"time":1329198423,"description":"Little  House On The Prairie Series one -Episodes 13-16[h.264 mp4]\n\nimdb: &lt;a href=&quot; http://www.imdb.com/title/tt0071007/episodes?season=1&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.imdb.com/title/tt0071007/episodes?season=1&lt;/a&gt;\n\n\n\n\n\nEpisode 13[The Lord Is My Shepherd Part 1]\n\nJealous of the attention Charles showers on his newborn son, Laura longs for the place she believes she's lost in her pa's affections and angrily refuses to pray for her little brother to get well when the baby becomes seriously ill.\n************************\n\nEpisode 14[The Lord Is My Shephard Part 2]\n\nBelieving that her jealousy was responsible for her infant brother's death and that her parents would rather have a son than a spare daughter, Laura climbs the highest hill she can find, hoping to get as close to God as possible to ask Him to take her instead and return the baby boy to the family. While Charles and Mr. Edwards desperately search for her, Laura meets Jonathan, a mystical mountain man who seems to have been sent purposely to guide her through this life-changing experience.\n************************\n\nEpisode 15[Family Quarrel]\n\nDivorce looms when Nels and his dog storm away from Harriet and the mercantile after the Olesons quarrel over the price of eggs. But the situation only gets more muddled when the townsfolk try to help them reconcile, prompting Harriet to pack her bags and causing some to wonder, a little wistfully, if Walnut Grove wouldn't be more peaceful if the volatile woman left town for good.\n*************************\n\nEpisode 16[Doctor`s Lady]\n\nIt's love at first sight between Doc Baker and a beautiful, though much younger, Kate Thorvald, Harriet Oleson's visiting niece; but when Kate happily consents to become his wife, Doc's concerned friends wonder if the May-December romance and the harsh reality of sharing a prairie-doctor's life will give the genteel, city-bred girl second thoughts and result in heartache for both of them.\n*************************","torrent":{"xt":"urn:btih:b6cbb7dbd024b334cdea85a7eecab7fd2cac988d","amp;dn":"Little+House+On+The+Praire+Series+One-Disc+4-Episodes%5B13-16%5Dh.26","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b6cbb7dbd024b334cdea85a7eecab7fd2cac988d","infoHashBuffer":{"type":"Buffer","data":[182,203,183,219,208,36,179,52,205,234,133,167,238,202,183,253,44,172,152,141]},"announce":[],"urlList":[]}}