{"title":"Brandon Sanderson - [Stormlight Archive 01] - The Way of Kings","uid":5801851,"size":18010640,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b80c1bcd8f675a0ecff15c1b7c6cd423e0312c7a&amp;dn=Brandon+Sanderson+-+%5BStormlight+Archive+01%5D+-+The+Way+of+Kings&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"kash79","files":-1,"time":1283289565,"description":"Brandon Sanderson - [Stormlight Archive 01] - The Way of Kings\n\nEPUB,MOBI,LIT,HTML\n\nHaving twice reached the New York Times bestseller list, and even as he is brilliantly completing Robert Jordan's The Wheel of TimeÃ‚Â®, Brandon Sanderson is constantly asked by readers and booksellers alike what his next project will be. Now, Tor is proud to present his answer, The Way of Kings, the first novel in a remarkable sequence every bit as ambitious and unique--and as satisfying and addictive--as The Wheel of Time.\n\nThe Way of Kings introduces the three protagonists who will be our windows on the strange and wondrous world of Roshar and the drama about to unfold there:\n\n* Dalinar, the assassinated king's brother and uncle of the new one, is an old soldier who is weary of fighting. He is plagued by dreams of ancient times and legendary wars, visions that may force him into a new role he could never have imagined.\n\n* Kaladin, a highborn young man who has been brought low, indeed to the most miserable level of military slavery, and like Ben Hur must suffer and struggle to survive and rise again.\n\n* Shallan, a naÃƒÂ¯ve but brave and brilliant young woman who will do anything to save her impoverished noble house from ruin.\n\nThese are people we will come to know deeply and take to our hearts. But just as important to The Way of Kings is a fourth key 'character,' the unique world of Roshar itself, a richly imagined setting as real as science fiction's Dune, as unforgettable as epic fantasy's Middle Earth. Through all the volumes of The Stormlight Archive, Brandon Sanderson will make Roshar a realm we are eager to visit.\n\nWhat Robert Jordan's The Wheel of Time has been to the fantasy genre for the last two decades, The Stormlight Archive will be to the next, and The Way of Kings is where it all begins. ","torrent":{"xt":"urn:btih:b80c1bcd8f675a0ecff15c1b7c6cd423e0312c7a","amp;dn":"Brandon+Sanderson+-+%5BStormlight+Archive+01%5D+-+The+Way+of+Kings","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b80c1bcd8f675a0ecff15c1b7c6cd423e0312c7a","infoHashBuffer":{"type":"Buffer","data":[184,12,27,205,143,103,90,14,207,241,92,27,124,108,212,35,224,49,44,122]},"announce":[],"urlList":[]}}