{"title":"Phil Keaggy - In the Quiet Hours","uid":4278143,"size":134784656,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:b83b5dd8a6a48413f9b8680e949096b004b9b64a&amp;dn=Phil+Keaggy+-+In+the+Quiet+Hours&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Poppa1956","files":14,"time":1215281897,"description":"The Question: &quot;Who is the best guitarist in the world?&quot;\n\nRumors have followed Keaggy for years that Jimi Hendrix had supposedly named him as his answer to the question Johnny Carson asked him, &quot;who is the best guitarist in the world?&quot; while making an appearance on The Tonight Show. Another version of the story goes something like, &quot;Jimi, how does it feel to be the world&amp;#039;s greatest guitar player?&quot; To which Jimi supposedly replied, &quot;I don&amp;#039;t know, you&amp;#039;ll have to ask Phil Keaggy!&quot; which according to some was from an interview in Rolling Stone or Guitar Player Magazine. Sometimes, the rumor is that it was Eric Clapton, or that it was on the Dick Cavett show. A recent variant has it that it was Eddie Van Halen on Letterman or with Barbara Walters who was asked the question. During live performances, Keaggy has mentioned it but personally thinks the rumors are untrue. However, because many of these shows did not keep archives of many of their early shows, it is nearly impossible to either confirm or disprove the rumors completely. Some fans have claimed to have seen the show in question, or read the interview but to date, no one has presented a tape, a magazine article or any kind of evidence to confirm it. Phil was asked this at one of his guitar clinics he held in California a few years ago and his answer was simply, &quot;I don&amp;#039;t think there is anything to it at all. I doubt that Jimi ever heard me play as he had died in England before I recorded with Glass Harp at his Electric Ladyland Studios in New York City. Someone told me years ago that when asked that question he replied, &amp;#039;Phil Keaggy is the shortest guitarist in the world,&amp;#039; which is more believable.&quot; (See this Snopes article regarding the &quot;Tonight Show&quot; appearance.)\n\nThis is a very mellow instrumental album copyrighted 2002.","torrent":{"xt":"urn:btih:b83b5dd8a6a48413f9b8680e949096b004b9b64a","amp;dn":"Phil+Keaggy+-+In+the+Quiet+Hours","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b83b5dd8a6a48413f9b8680e949096b004b9b64a","infoHashBuffer":{"type":"Buffer","data":[184,59,93,216,166,164,132,19,249,184,104,14,148,144,150,176,4,185,182,74]},"announce":[],"urlList":[]}}