{"title":"Planeta Azul - 1 La vida en los Oceanos [DVDRip][Sanish]","uid":6531704,"size":823764632,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:b8fca1e438e6a36237f4e03a0b3a1aacf1fd053c&amp;dn=Planeta+Azul+-+1+La+vida+en+los+Oceanos+%5BDVDRip%5D%5BSanish%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"virana","files":-1,"time":1310375803,"description":"\nPLANETA AZUL - La vida en los ocÃƒÂ©anos ( 10 Cap.)\n\nPlaneta azul es una serie documental sobre la naturaleza que contÃƒÂ³ con una de las inversiones mÃƒÂ¡s altas realizadas (casi 13 millones de euros) en divulgar la naturaleza. Se han mostrado imÃƒÂ¡genes de especies jamÃƒÂ¡s filmadas antes como el tiburÃƒÂ³n megaboca y se realizaron experimentos para visualizar la rica vida encargada de degradar el cadÃƒÂ¡ver de una ballena en los fondos marinos. La serie recoge aspectos de la vida marina como la reproducciÃƒÂ³n, la alimentaciÃƒÂ³n y las relaciones que se establece entre sus protagonistas. Este inconmensurable esfuerzo requiriÃƒÂ³ dos aÃƒÂ±os de filmaciones. Estamos pues ante una serie documental imprescindible en cualquier videoteca por su sorprendente calidad en todos los ÃƒÂ¡mbitos. Sin embargo, el principal valor de la misma es conseguir un discurso narrativo capaz de enganchar al espectador de todas las edades. Una serie que nos fascinarÃƒÂ¡ por las bellezas que ofrece y por la claridad con que muestra las estrategias vitales que en los vastos ocÃƒÂ©anos y el litoral de nuestro planeta se han desarrollado. Des de los trÃƒÂ³picos hasta los polos la vida marina presentada en esta serie no deja indiferente a ningÃƒÂºn espectador por poca que sea su sensibilidad hacia la naturaleza. Un regalo para nuestros ojos en 500 minutos indispensables para aprender y amar el medio marino. En definitiva, para proteger y conservar un ecosistema que deberÃƒÂ­a dar nombre al planeta mar.\n\n\n\nDocumental: Planeta Azul producido por la BBC junto a Discovery Channel.\nDVDrip\nAÃƒÂ±o: 2002\nDuraciÃƒÂ³n: 50 m. por Cap.\nBitrate Imagen: 2000 Kb/s\nIdiomas: EspaÃƒÂ±ol\nAudio: AC3 256 Kb/s\nTamaÃƒÂ±o: 800 Mb\n\nCap. 1 - Planeta Azul\nLa ballena azul es un sÃƒÂ­mbolo perfecto de los ocÃƒÂ©anos : al igual que ella, la vasta extensiÃƒÂ³n azul que domina nuestro planeta permanece aÃƒÂºn en gran parte inexplorada. Sin embargo, los ocÃƒÂ©anos son esenciales en nuestras vidas, pues su influencia domina los sistemas climÃƒÂ¡ticos del mundo. Sostienen una enorme variedad de formas de vida: desde las ballenas mÃƒÂ¡s grandes al plancton mÃƒÂ¡s pequeÃƒÂ±o; desde bandadas de aves marinas a solitarios peces abisales... Y todo ellos gobernado por un complejo sistema de fuerzas fÃƒÂ­sicas y biolÃƒÂ³gicas. Este primer episodio demuestra la autÃƒÂ©ntica magnitud, el poder y la complejidad del &quot;Planeta Azul&quot;.","torrent":{"xt":"urn:btih:b8fca1e438e6a36237f4e03a0b3a1aacf1fd053c","amp;dn":"Planeta+Azul+-+1+La+vida+en+los+Oceanos+%5BDVDRip%5D%5BSanish%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b8fca1e438e6a36237f4e03a0b3a1aacf1fd053c","infoHashBuffer":{"type":"Buffer","data":[184,252,161,228,56,230,163,98,55,244,224,58,11,58,26,172,241,253,5,60]},"announce":[],"urlList":[]}}