{"title":"Bischof - Tachyonen, Orgonenergie, Skalarwellen - Feinstoffliche","uid":3494264,"size":1866942,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b962ca413dc8b38617e3871441e44d959f8bb24b&amp;dn=Bischof+-+Tachyonen%2C+Orgonenergie%2C+Skalarwellen+-+Feinstoffliche&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":"red_gonzo","files":1,"time":1149937904,"description":"For english-only speaking:\nThis book is in german. English title would be: Bischof - Tachyons, orgon energy, scalar waves (2002). Marco Bischof, science historian and critic, provides you with a comprehensive history and overview of the esoteric concepts of border science which have found their way into many scientific areas such as physics and psychology. The author brings you back to history from its earliest ideas of Qi, Prana and ether to today&amp;#039;s concepts of tachyons, orgon energy, zero point energy and scalar waves. Bischof&amp;#039;s book is certainly a masterpiece of this little known scientific history. 400 pages. A must read for everyone.\n\nFur Deutschsprachige:\nTachyonen, Orgonenergie, Nullpunktenergie und Skalarwellen sind ein zunehmend bedeutendes Thema der Forschungsgebiete zwischen Grenzwissenschaft und Esoterik. Gemeint sind damit hypothetische &quot;Lebensenergien&quot; oder &quot;feinstoffliche Energien&quot;, das heisst nicht-elektromagnetische Felder physikalischer oder bisher unbekannter Natur, die angeblich sowohl von Menschen und anderen Lebewesen ausgehen, wie auch durch bestimmte Vorrichtungen erzeugt werden konnen. Diese Energien sind in der Lage, Lebewesen auf physischer und moglicherweise auch auf psychisch-geistiger Ebene zu beeinflussen.\nDer Wissenschaftsautor und Wissenschaftshistoriker Marco Bischof gibt in diesem Buch einen allgemein verstandlichen Uberblick uber das Thema, fasst die relevanten derzeit bekannten Informationen zusammen und wurdigt sie einer kritischen Betrachtung. Ausserdem geht er auf die verschiedenen Typen der heute auf dem Markt verfugbaren Technologien und Gerate ein. Ein Meisterwerk von wenig bekannte wissenschaftliche Geschichte. 400 Seiten.\n","torrent":{"xt":"urn:btih:b962ca413dc8b38617e3871441e44d959f8bb24b","amp;dn":"Bischof+-+Tachyonen%2C+Orgonenergie%2C+Skalarwellen+-+Feinstoffliche","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b962ca413dc8b38617e3871441e44d959f8bb24b","infoHashBuffer":{"type":"Buffer","data":[185,98,202,65,61,200,179,134,23,227,135,20,65,228,77,149,159,139,178,75]},"announce":[],"urlList":[]}}