{"title":"Dragon Ball Z: Los Guerreros De Plata","uid":4165500,"size":734724096,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:b985ca31f50b2a746ffe84c87e5fe5c42f48dd16&amp;dn=Dragon+Ball+Z%3A+Los+Guerreros+De+Plata&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"cazomdb","files":1,"time":1209591202,"description":"La familia Money lo tiene todo previsto para organizar un Torneo de Arte Marciales como regalo a Dollar Money (curiosamente lleva un dibujo de Mr SatÃƒÂ¡n en su gorra). En el cielo o &amp;#039;el mÃƒÂ¡s allÃƒÂ¡&amp;#039;, Goku y Kaito contemplan el evento. El dinero sirve de centro de atracciÃƒÂ³n para Gohan, Krilyn y Trunks, que deciden participar con el fin de conseguir el premio de la final. HabrÃƒÂ¡ ocho combates de todos contra todos, donde los ocho finalista se siguen enfrentando entre ellos, hasta que los cuatro siguientes (lÃƒÂ³gicamente la mitad) se enfrenten en lugares concretos contra luchadores de la escuela Mr SatÃƒÂ¡n. AsÃƒÂ­, Trunsk derrota a Ten Shin Han, que tambiÃƒÂ©n habÃƒÂ­a decidido participar. Viendo tantas dificultades, Mr SatÃƒÂ¡n prefiere huir... En la casa de Kaioh Sama, Goku juego con Bubbles a las cartas (juego en el que aparecen Uranai Baba, Mai, Pilaf e incluso Trunks) mientras Trunks, Krilyn, Gohan y Dosukoi, un luchador de sumo, se clasifican para los cuartos de final. Sin embargo, algo parece cambiar. Los vencedores no se enfrentarÃƒÂ¡n a la escuela de SatÃƒÂ¡n, sino a la de Boujack (Gokua, Bujin, Bido y Zangya), un cruel luchador que se marchÃƒÂ³ del planeta de Kaioh Sama...Puesto que Gokuu destruyÃƒÂ³ el planeta en la ÃƒÂ©poca de CÃƒÂ©lula para derrotarle, Boujack decide vengarse de Kaito. Para ello ha decidido derrotar a Gohan, Trunks y Krylin, que evidentemente estÃƒÂ¡n de su lado. La situaciÃƒÂ³n parece der muy complicada, incluso Vegeta. Llega al final el mismo Ms SatÃƒÂ¡n, aunque sÃƒÂ³lo consigue eliminar las cÃƒÂ¡maras que transmitÃƒÂ­an estas escenas, lo cual no le interesaba nada. Boujack se hace con Son Gohan, noticia que llega a Goku, con lo cual rompe las normas y acude a la Tierra. Gohan alcanza el nivel segundo de Super Guerrero y derrota a Bido y Bujin. El mismo Boujack, malvado tirano, elimina a su compaÃƒÂ±era de equipo, Zangya. Toda la ira de Gohan se concentra en un ataque que termina con Boujack para siempre. En la Tierra se cree que todo el mÃƒÂ©rito es de SatÃƒÂ¡n. ","torrent":{"xt":"urn:btih:b985ca31f50b2a746ffe84c87e5fe5c42f48dd16","amp;dn":"Dragon+Ball+Z%3A+Los+Guerreros+De+Plata","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b985ca31f50b2a746ffe84c87e5fe5c42f48dd16","infoHashBuffer":{"type":"Buffer","data":[185,133,202,49,245,11,42,116,111,254,132,200,126,95,229,196,47,72,221,22]},"announce":[],"urlList":[]}}