{"title":"Conceptions of Cosmos.pdf","uid":10587777,"size":6189801,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:bac6f8f46739f97225b410f5ab41ceb4c162bf2c&amp;dn=Conceptions+of+Cosmos.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"interuniversal","files":-1,"time":1405769758,"description":"    Conceptions of Cosmos - From Myth to the Accelerating Universe - A History of \n\n                                     Cosmology\n\n                                Author:Helge S.Kragh\n\n                         Publisher:Oxford University Press\n\nAbstract\n\nThis book is a historical account of how natural philosophers and scientists have endeavoured to understand the universe at large, first in a mythical and later in a scientific context. Starting with the creation stories of ancient Egypt and Mesopotamia, the book covers all the major events in theoretical and observational cosmology, from Aristotle's cosmos over the Copernican revolution to the discovery of the accelerating universe in the late 1990s. The kind of cosmology it describes and analyses focuses on the physical and astronomical aspects, but these cannot always be separated from aspects of a philosophical and theological nature. The book presents cosmology as a subject including scientific as well as non-scientific dimensions, and tells the story of how it developed into a true science of the heavens. Contrary to most other books on the history of cosmology, it offers an integrated account of the development with emphasis on the modern Einsteinian and post-Einsteinian period. In addition, it pays attention not only to mainstream developments, but also to theories of the universe that are today considered to be blind alleys. Starting in the pre-literary era, the book carries the story of mankind's quest of understanding the universe onwards to the early years of the 21st century.\n\n","torrent":{"xt":"urn:btih:bac6f8f46739f97225b410f5ab41ceb4c162bf2c","amp;dn":"Conceptions+of+Cosmos.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bac6f8f46739f97225b410f5ab41ceb4c162bf2c","infoHashBuffer":{"type":"Buffer","data":[186,198,248,244,103,57,249,114,37,180,16,245,171,65,206,180,193,98,191,44]},"announce":[],"urlList":[]}}