{"title":"Easy MP3 Downloader v4.3.0.8 Portable [ak]","uid":6385022,"size":8343463,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:bac9ef370a949704fc969143fe1ecfee459c819f&amp;dn=Easy+MP3+Downloader+v4.3.0.8+Portable+%5Bak%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Anacondaz","files":-1,"time":1305172842,"description":"Easy MP3 Downloader v4.3.0.8 Portable\n\n\nEasy MP3 Downloader is a revolutionary new tool which provides you an easy, efficient and legitimate method to search and download music. Over 100 million songs are available. It is not a Peer-to-Peer program and it is 100% clean, safe and legal.\n\nYou're not sharing music with others and what you download is 100% safe MP3 files form the fastest servers. You don't have to worry about downloading virus or sources problem. Besides, Easy MP3 Downloader recommends you the USA Airplay Hot 100 of each week and lists the hottest songs of 14 categories to ensure that you download the latest music you desire.\n\nYou can try the songs first to decide which one to download and edit ID3v2 tag of the MP3 file including the title, artist and album before you download it. It's really easy to use with the super friendly interface and compatible with any portable device: iPod, iPhone, PSP, PDA, cell phone, etc.\n\nHere are some key features of &quot;Easy Mp3 Downloader&quot;:\n\nEasy to use with super friendly interface:\nÃ‚Â· All you need to do is just to type in the music you want and click search and download. That's it! The super friendly interface will ensure you to have the wonderful experience of using Easy MP3 Downloader.\n\nRecommend hot songs to download:\nÃ‚Â· Ensure you have the latest music that you desire. If you can't find the music you want, you could try again in one or two days. New songs appear on the internet almost every minute; you'll definitely find the latest music that you desire! Just keep trying!\n\nTry music first before you download:\nÃ‚Â· You can try the searched results to decide which one to download.\n\nEnable edit ID3v2 tag:\nÃ‚Â· You could edit ID3v2 tag of the MP3 file including the title, artist and album before you download it.Compatible with iPod and all the other portable devices\n\nHome Page - www.easymp3downloader.com/","torrent":{"xt":"urn:btih:bac9ef370a949704fc969143fe1ecfee459c819f","amp;dn":"Easy+MP3+Downloader+v4.3.0.8+Portable+%5Bak%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bac9ef370a949704fc969143fe1ecfee459c819f","infoHashBuffer":{"type":"Buffer","data":[186,201,239,55,10,148,151,4,252,150,145,67,254,30,207,238,69,156,129,159]},"announce":[],"urlList":[]}}