{"title":"Bob Hope Tribute Collection - Give me a Sailor (1941) Xvid 1cd [","uid":9845633,"size":802981888,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:bb4e31c142945d142278fb9e107a10fab6913750&amp;dn=Bob+Hope+Tribute+Collection+-+Give+me+a+Sailor+%281941%29+Xvid+1cd+%5B&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"SaM","files":3,"time":1396063252,"description":"Bob Hope Tribute Collection - Give me a Sailor (1941) Xvid 1cd - Martha Raye, Betty Grable [DDR]\n\nCAST:-\nMartha Raye as Letty Larkin\nBob Hope as Jim Brewster\nBetty Grable as Nancy Larkin\nJack Whiting as Walter Brewster\nClarence Kolb as Captain Tallant\n\n\nSYNOPSIS:- Give Me a Sailor (1941)\nJim and Walter are two brother sailors in the United States Navy. Walter tells Jim as soon as they get home he is going to ask his beautiful girlfriend, Nancy Larkin to marry him. But Jim is also in love with Nancy so he begs Nancy's ugly duckling sister, Letty to help break Walter and Nancy up. Letty agrees only under one condition, he help her to win Walter!\n\nBob Hope and Jack Whiting are amorous sailors. Martha Raye is the &quot;ugly duckling&quot; sister of beautiful Betty Grable. The complication? Everyone's in love with the wrong person: Martha pines for Jack who pines for Betty who pines for Bob, and so it goes. The casting seems to be mixed up as well. Betty Grable would have been the likely candidate for the roles of Legs Larkin, but this in fact is the character name of Martha Raye, who (in the picture) defeats Grable in a beautiful legs contest! Because Paramount was trying to build up a Raye-Hope team, Martha ends up with Bob at fadeout time, while Jack and Betty have to make do with each other. Martha Raye is clearly the star of Give Me a Sailor, though Bob Hope, in his third feature film, has a few worthwhile moments.\n\nSince boyhood, Naval Lt. Walter Brewster and his brother, Ensign Jim Brewster, have vied for the love of Nancy Larkin, a flirtatious beauty, but an incompetent homemaker. Nancy's less attractive sister Letty is an outstanding cook and is in love with Walter. She and Jim use a secret code and various plots to disrupt Walter and Nancy's courtship. Letty makes a special cake for Walter's shore leave and plans on entering a photograph of the cake in a contest, but her cousin Meryl accidentally takes a picture of her legs instead and sends that photo to a different contest. Jim is determined to prevent Nancy from accepting Walter's marriage proposal. Because Nancy has already made another date to a town picnic, she advises Walter to invite Letty, and they agree to ditch their dates. Letty finds out that Walter plans to ditch her and refuses to attend the picnic. To console her, Jim steals from the picknickers all the picnic food she prepared and stays with her. When she overhears Walter's plans to take his captain fishing at Paradise Lake, Letty packs pots and pans and hides in the trunk of his car. Unknown to Letty, Walter sends Jim in his place to check out the cabin. On arrival, Jim checks out the rotting cabin while Letty cooks flapjacks over a campfire, hoping to win Walter's heart through his stomach. Jim and Letty are shocked to see one another, and their spirits further dampen when Letty accidentally parks the car over the fire and it explodes, forcing them to walk in a drenching storm to find an inn. When Letty's aunt Minnie, Walter and Nancy find Letty and Jim in a hotel room together, they assume the worst and arrange a marriage. Letty wins a contest for her great legs through the photo Meryl sent in and instantly becomes wealthy. At home, Nancy displays her ineptitude in the kitchen and ruins the captain's dinner, embarrassing Walter. Letty arrives wearing furs and jewels, and whips up a fabulous meal for the captain, who is completely charmed by her. Disappointed in Nancy, Walter proposes to Letty, who has suddenly blossomed and acquired national fame. Jim and Nancy plan to elope on the wedding day, which also happens to be Navy Day. Before the wedding, Walter kisses Letty for the first time, and to her astonishment, she feels nothing special. She rushes to find Jim and insists he kiss her, and they discover that they are in love.\n\nTECHNICAL SPECIFICATIONS:-\nVideo Bitrate: 1295 kbps\nVideo Resolution: 640x480\nVideo Aspect Ratio: 1.333:1\nFrames Per Second: 29.970\nAudio Codec: 0x2000 (Dolby AC3) AC3\nAudio Bitrate: 192kb/s CBR 48000 Hz\nAudio Streams: 2\nAudio Languages: English\nRunTime: 91 mins\nSubtitles: None\nRipped by: Trinidad [DDR]\nDuration: 91 mins","torrent":{"xt":"urn:btih:bb4e31c142945d142278fb9e107a10fab6913750","amp;dn":"Bob+Hope+Tribute+Collection+-+Give+me+a+Sailor+%281941%29+Xvid+1cd+%5B","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bb4e31c142945d142278fb9e107a10fab6913750","infoHashBuffer":{"type":"Buffer","data":[187,78,49,193,66,148,93,20,34,120,251,158,16,122,16,250,182,145,55,80]},"announce":[],"urlList":[]}}