{"title":"Duke Ellington - Live in Mexico TQMP","uid":4715644,"size":337574841,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:bb77983497e4d3ede659a6409746c304ae82d910&amp;dn=Duke+Ellington+-+Live+in+Mexico+TQMP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"zootallure","files":21,"time":1234265760,"description":"Edward Kennedy &quot;Duke&quot; Ellington was an American composer, pianist, and bandleader.\n\nDuke Ellington was recognized during his life as one of the most influential figures in jazz, if not in all American music. His reputation has increased since his death, including a special award citation from the Pulitzer Prize Board.\n\nEllington called his style and sound &quot;American Music&quot; rather than jazz, and liked to describe those who impressed him as &quot;beyond category.&quot; These included many of the musicians who served with his orchestra, some of whom were considered among the giants of jazz and performed with Ellington's orchestra for decades. While many were noteworthy in their own right, it was Ellington who melded them into one of the most well-known orchestral units in the history of jazz. He often composed specifically for the style and skills of these individuals, such as &quot;Jeep's Blues&quot; for Johnny Hodges, &quot;Concerto for Cootie&quot; (&quot;Do Nothing Till You Hear from Me&quot;) for Cootie Williams and &quot;The Mooche&quot; for Tricky Sam Nanton. He also recorded songs written by his bandsmen, such as Juan Tizol's &quot;Caravan&quot; and &quot;Perdido&quot; which brought the &quot;Spanish Tinge&quot; to big-band jazz. After 1941, he frequently collaborated with composer-arranger Billy Strayhorn, whom he called his alter-ego.\n\nOne of the 20th century's best-known African-American artists, Ellington recorded for many American record companies, and appeared in several films. Ellington and his orchestra toured the United States and Europe regularly before and after World War II. Ellington led his band from 1923 until his death in 1974.\n\nBrought to you by TQMP. (The Quality Music Project)\n\nIn this project we, fellow pirates share only quality items out of our CD collections in lossless FLAC and include covers, especially for those who like to burn and print and put it in a nice and shiny jewelcase. Well, you all know the drill :)\n\nRipped by Exact Audio Copy V0.99 from 01-23-2008, encoded to FLAC with 1024kb/s\nGet Your Free Copy of the EAC and FLAC suite at: &lt;a href=&quot;\nhttp://www.exactaudiocopy.de/en/index.php/resources/download/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.exactaudiocopy.de/en/index.php/resources/download/&lt;/a&gt;\n\nPlease feel free to join the TQMP project!\nThe &quot;rules&quot; are simple: Rip your CD (no 1980's cassettetapes or vinylrips please!) in lossless format AND include artwork. Include cue- and logfiles for the purists and the TQMP searchtag in your title, so it can easily be found. (Yes, on Google as well..)\n\n\nSay Ã‚Â»thank youÃ‚Â« by seeding... just seed, it is not harmful to your health","torrent":{"xt":"urn:btih:bb77983497e4d3ede659a6409746c304ae82d910","amp;dn":"Duke+Ellington+-+Live+in+Mexico+TQMP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bb77983497e4d3ede659a6409746c304ae82d910","infoHashBuffer":{"type":"Buffer","data":[187,119,152,52,151,228,211,237,230,89,166,64,151,70,195,4,174,130,217,16]},"announce":[],"urlList":[]}}