{"title":"Cannabis Collection - Grass - the history of marijuana","uid":7325565,"size":2669522944,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:bbe16ed691c73b596f6b93da1e21327b38535867&amp;dn=Cannabis+Collection+-+Grass+-+the+history+of+marijuana&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"GRNS3","files":-1,"time":1338744161,"description":"\n\n\nThe Cannabis Collection - a series of educative and entertaining info dvd's\n\nPlease enjoy, share with friends and seed :\n\n\nGrass - the History of Marijuana - 1999\n\n\nGrass: History of Marijuana is a 1999 Canadian documentary film directed by Ron Mann, premiered in Toronto Film Festival, about the history of the United States government's war on marijuana in the 20th century. The film was narrated by actor Woody Harrelson.\n\nThe film follows the history of US federal policies and social attitudes towards marijuana, beginning at the turn of the twentieth century. The history presented is broken up into parts, approximately the length of a decade, each of which is introduced by paraphrasing the official attitude towards marijuana at the time (e.g. &quot;Marijuana will make you insane&quot; or &quot;Marijuana will make you addicted to heroin&quot;), and closed by providing a figure for the amount of money spent during that period on the &quot;war on marijuana.&quot;\n\nThe film places much of the blame for marijuana criminalization on Harry Anslinger (the first American drug czar) who promoted false information about marijuana to the American public as a means towards abolition. It later shows how the federal approach to criminalization became more firmly entrenched after Richard Nixon declared a &quot;War on Drugs&quot; and created the Drug Enforcement Agency in 1973, and even more so a decade later and on, as First Lady Nancy Reagan introduced the &quot;Just Say No&quot; campaign and President George H.W. Bush accelerated the War on Drugs. The film ends during the Bill Clinton administration, which had accelerated spending even further on the War on Drugs.\n\nGrass is almost completely composed of archival footage, much of which is from public domain U.S. propaganda films and such feature films as Reefer Madness made available by the Prelinger Archives. Woody Harrelson agreed to narrate the film free-of-charge.\n\n\nCheck this account for updates regularly :)\n","torrent":{"xt":"urn:btih:bbe16ed691c73b596f6b93da1e21327b38535867","amp;dn":"Cannabis+Collection+-+Grass+-+the+history+of+marijuana","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bbe16ed691c73b596f6b93da1e21327b38535867","infoHashBuffer":{"type":"Buffer","data":[187,225,110,214,145,199,59,89,111,107,147,218,30,33,50,123,56,83,88,103]},"announce":[],"urlList":[]}}