{"title":"Storage Wars Texas - Season 01 (Episodes 01-14) 720p HDTV","uid":9673339,"size":9789055170,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:bbf05b5fa5335ca721654deecc58eb8b2826f63f&amp;dn=Storage+Wars+Texas+-+Season+01+%28Episodes+01-14%29+720p+HDTV&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Albe_Sure","files":-1,"time":1393510598,"description":"Storage Wars Texas - Season 01 (Episodes 01-14) 720p HDTV\n\nThis is an INCOMPLETE collection which includes only the first 14 episodes (and is [*MISSING*] episodes 15 and 16) of Storage Wars Texas - Season 1, EACH of the following are presented in 720p High-Definition...\n\nIncluded Episodes\n\n1. &quot;Texas Sold 'Em&quot; (Originally aired December 6, 2011)\nThe Storage Wars spread to the lone star state. Buyers Ricky and Bubba Smith look past the grime to find a vintage air compressor. Antique Aficionado Dr. Moe Prigoff sniffs out some stunning lithographs. Slick New Yorker Victor Rjesnjansky stumbles across a unit with a disturbing past. And new storeowner Lesa Lewis bids to keep her doors open and her assistant Jerry's mouth closed.\n\n2. &quot;Bounty Hunter Bubba Fett&quot; (Originally aired December 13, 2011)\nThe auction action heads to Irving, TX -- a town located directly between Dallas and Ft. Worth. Lesa Lewis and Moe Prigoff go toe-to-toe for a unit with a mystical item. Victor Rjesnjansky flips a small locker for twenty-five times his initial investment. And Ricky and Bubba hit pay dirt with a locker containing sci-fi memorabilia.\n\n3. &quot;Snake, Rattle, and Roll&quot; (Originally aired December 20, 2011)\nFrom stadiums to amusement parks, Arlington has the Texas buyers on the lookout for memorabilia and collectables. Ricky and Bubba play up their country roots in an attempt to juke the competition. Lesa Lewis treads on a snakeskin ensemble. And Victor Rjesnjansky goes after a scooter with a three thousand dollar potential.\n\n4. &quot;Mo' Money, Moe Prigoff&quot; (Originally aired December 27, 2011)\nAs the bidders arrive at Walt's Longview auction, they notice one major problem. There's a 100-buyer swarm--all of whom are geared up to spend. Ricky and Lesa duke it out for a power tool bonanza. Victor Rjesnjansky strikes it big with a midcentury unit, while Moe Prigoff uses an old friend to transform his locker of junk into a unit of &quot;fabulous&quot; furnishings.\n\n5. &quot;The Good, the Bad, and the Hungry&quot; (Originally aired December 27, 2011)\nWhen a recently deceased tycoon's unit goes up for sale, the buyers ready themselves for all-out war. Bubba and Ricky find some antique kitchen gear. Moe Prigoff unearths some &quot;mad&quot; finds. While Victor Rjesnjansky and Lesa Lewis fight tooth-and-nail to become the new tycoons of storage.\n\n6. &quot;Remember the Alamo?&quot; (Originally aired January 10, 2012)\nThe storage warriors journey back to Ft. Worth, Texas to a facility known for its deceptively bad looking lockers. Lesa Lewis tries to find value in an old cookie jar. Victor Rjesnjansky becomes a New York Yankee in King Arthur's court. And Moe Prigoff hopes for a high score after missing Walt's auction. Looks can be deceiving, as the worst-looking locker delivers the biggest payout.\n\n7. &quot;Home on the Strange&quot; (Originally aired March 6, 2012)\nWhen the buyers head to the conservative town of Burelson, Texas, they find items that are anything but ordinary! Moe Prigoff is on the hunt for oddities. Lesa and Victor battle for a store display worth $8000. While Ricky and Bubba find what they believe is an electric hemorrhoid donut.\n\n8. &quot;The Surgeon, The Witch, and the Wardrobe&quot; (Originally aired March 6, 2012)\nA tornado is coming! When the buyers head to East Texas, the race is on to grab a locker before the storm hits. Ricky and Bubba go after a table with an ancient purpose. Victor tries to talk Moe out of a disastrous investment. While Jerry and Lesa stumble across some radioactive materials. In the wake of the storm, two buyers will have to band together to turn a profit.\n\n9. &quot;Puffy in the Sky with Diamonds&quot; (Originally aired March 13, 2012)\nIn the city of Irving, the buyers are on the hunt for old heirlooms. Victor employs some underhanded tactics to rattle the competition. Lesa and Jerry find some valuable roping gear. Ricky and Bubba try to get the inside scoop from their connections. And one team scores a locker with a potential 50 grand hit. The big question at this auction: who will find the diamond (or diamonds) in the rough?\n\n10. &quot;If I Were a Tibettin' Man&quot; (Originally aired March 13, 2012)\nThe buyers venture to a Ft. Worth facility with the potential for low costs and huge finds. Ricky and Bubba find football autographs, which may or may not prove authentic. Lesa Lewis buys a unit to prove she's no bottom feeder. And Victor Rjesnjansky goes head to head with hell on wheels.\n\n11. &quot;Dallas Cowboys and Indians&quot; (Originally aired March 20, 2012)\nThe buyers head to Ft. Worth, Texas in search of western collectables and old heirlooms. Ricky and Bubba bring a legendary cowboy for some celebrity help. Victor Rjesnjansky tries to make peace with the locals. And Lesa Lewis finds the ultimate weapon to squash her New York adversary. Though a civil war relic is found, the real question remains: how much is it Ft. Worth?\n\n12. &quot;Who Bought JFK?&quot; (Originally aired March 20, 2012)\nThe buyers head to a high-end facility in Lake Highlands, Texas. Lesa Lewis battles against retired NFL star, Roy Williams, for a locker with a dark item. Victor Rjesnjansky hunts for the key to a padlocked treasure chest. And one buyer stumbles across a real piece of American History. With conspiracies and collaborations afoot, the question on everyone's mind--who bought JFK?\n\n13. &quot;High Tea Tighty&quot; (Originally aired March 27, 2012)\nLewisville, Texas is known for its glittering lakes and well-to-do residence--meaning it's the perfect place for the buyers to strike it rich. Victor and Lesa duke it out for a locker with a player piano. Roy Williams finds an alarming item, while Ricky and Bubba learn a thing or two about tea parties. The treasure is everywhere, but who will take home the winning item is anybody's guess.\n\n14. &quot;For a Few Lockers More&quot; (Originally aired March 27, 2012)\nThe Storage Stampede hits the Dallas metroplex with back-to-back auctions. If the buyers can't keep up with the crowd, they risk missing a locker of a lifetime. Ricky and Bubba enlist a fisherman's strategy. Victor Rjesnjansky gambles on some video poker machines. Jerry forces Lesa to buy a contractors unit, while Moe Prigoff gets caught up in some monkey business.\n\n[*MISSING*] 15. &quot;Fandom of the Opera&quot; (Originally aired April 3, 2012)\nIn the refined country town of Tyler, Texas--the hunt begins for rare art and designer furniture. A tantrum from Lesa Lewis forces Jerry to carry the weight of the team. Bubba Smith's claustrophobia jeopardizes the Rangers' chance of scoring. And Roy Williams unearths a six flag brochure from the 1970s.\n\n[*MISSING*] 16. &quot;A Fistful of Auctions&quot; (Originally aired April 3, 2012)\nThe buyers have a big decision to make: go to an auction with safe &quot;bread and butter&quot; lockers or risk it all at an auction in a developing neighborhood. The claws come out, when Lesa battles with a hot young buyer. Ricky and Bubba find a collection of antique gunslingers toys. Victor Rjesnjansky tries to wash over the competition, while Roy Williams calculates a new strategy.\n\n\nMy genuine thanks and appreciation go to the original poster(s) of the above individual episodes.  I will only be able seed this collection myself for as much as a week or two...so, if you want to see it survive beyond that, then PLEASE SEED!!!\n\nThank you so much! ;)\n\n\n-A.S.","torrent":{"xt":"urn:btih:bbf05b5fa5335ca721654deecc58eb8b2826f63f","amp;dn":"Storage+Wars+Texas+-+Season+01+%28Episodes+01-14%29+720p+HDTV","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bbf05b5fa5335ca721654deecc58eb8b2826f63f","infoHashBuffer":{"type":"Buffer","data":[187,240,91,95,165,51,92,167,33,101,77,238,204,88,235,139,40,38,246,63]},"announce":[],"urlList":[]}}