{"title":"The Church - The Unguarded Moment [promo].VOB","uid":6377849,"size":196218880,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:bc6ec5e4143c9ceef8d2b07eb6c27fe54539ec9f&amp;dn=The+Church+-+The+Unguarded+Moment+%5Bpromo%5D.VOB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SgtRlee","files":-1,"time":1304933179,"description":"The Church - The Unguarded Moment [promo].VOB\n\n\nHQ rare promo music video. &quot;The Unguarded Moment&quot; is a song from Of Skins and Heart, the debut album by Australian alternative rock band The Church. It was released in April 1981 by EMI/Parlophone records and reached No. 22 on the Australian Kent Music Report Albums Chart. It is the only album to feature founding member Nick Ward on drums and is largely dominated by simple-structured, post-punk songs. It was produced by Chris Gilbey and Bob Clearmountain. Seven songs were entirely written by lead singer and bass guitarist Steve Kilbey and two co-written with others. The first single, &quot;She Never Said&quot;, did not chart on the Australian Kent Music Report Singles Chart. The second single, &quot;The Unguarded Moment&quot;, brought early attention and significant radio play to the band, it peaked at No. 22 in Australia and No. 19 in New Zealand. The track &quot;Is This Where You Live&quot; became a live staple over the following years. By the time of the album's release, Ward was replaced by Richard Ploog on drums.\n\nThe album was re-sequenced and released internationally as The Church (1982) by Capitol Records in North America and Carrere Records in Europe. The 1989 CD release by Arista Records included three extra tracks: &quot;Too Fast for You&quot;, &quot;Tear It All Away&quot; and &quot;Sisters&quot;, which originally appeared on the double 7&quot; single/extended play, Too Fast for You in 1981.\n\nThe Church is an Australian rock band formed in Sydney in 1980. Initially associated with New Wave and the neo-psychedelic sound of the mid 1980s, their music later became more reminiscent of progressive rock, featuring long instrumental jams and complex guitar interplay. Founding members are Steve Kilbey on lead vocals and bass guitar, and Peter Koppes and Marty Willson-Piper on guitars, while Tim Powles has played on drums since 1994. Three of the members recorded material as The Refo:mation in 1997.\n\nThe Church's debut album, Of Skins and Heart (1981), delivered their first radio hit &quot;The Unguarded Moment&quot;. They were signed to major labels in Australia, Europe and the United States. However, the US label was dissatisfied with their second album and dropped the band without releasing it. This put a dent in their international success, but they returned to the charts in 1988, with the album Starfish and the US Top 40 hit &quot;Under the Milky Way&quot;. Subsequent commercial success proved elusive, however, and the band weathered several line-up changes in the early 1990s. The last decade has seen them settle on their current line-up. On 27 October 2010, The Church were inducted into the ARIA Hall of Fame in Sydney.\n(video does not have any logos)\n\n\n    &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Of_Skins_and_Heart&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Of_Skins_and_Heart&lt;/a&gt; \n      &lt;a href=&quot;\nhttp://bayimg.com/OaHLdAaDp&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/OaHLdAaDp&lt;/a&gt; \n   \n\n\nFile properties info using Media Player Classic:     \n   Video: MPEG2 Video 720x480 (4:3) 29.97fps 8000kbps\n   Audio: PCM 48000Hz stereo 1536kbps [DVD LPCM, 16 bit]\n   Duration: 00:04:14\n\n\n\n\n*Install the &quot;Media Player Classic&quot; player if you can't play this file, \nor for better visual and audio quality playback of all your videos. \nIt's 100% free to download and use. Just updated January 31, 2011\n\n*Media Player Classic Home Cinema*         &lt;a href=&quot;\nhttp://mpc-hc.sourceforge.net/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://mpc-hc.sourceforge.net/&lt;/a&gt; \n\nSgtRlee (Sgt.R.Lee) \n\t","torrent":{"xt":"urn:btih:bc6ec5e4143c9ceef8d2b07eb6c27fe54539ec9f","amp;dn":"The+Church+-+The+Unguarded+Moment+%5Bpromo%5D.VOB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bc6ec5e4143c9ceef8d2b07eb6c27fe54539ec9f","infoHashBuffer":{"type":"Buffer","data":[188,110,197,228,20,60,156,238,248,210,176,126,182,194,127,229,69,57,236,159]},"announce":[],"urlList":[]}}