{"title":"Coats &amp; Schauberger - Living Energies - Viktor Schauberger's Br","uid":3494267,"size":12825820,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:bcb10f9b0c03e4865e028ff23086a9dd1a842dc6&amp;dn=Coats+%26+Schauberger+-+Living+Energies+-+Viktor+Schauberger%5C%27s+Br&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"red_gonzo","files":1,"time":1149938084,"description":"British architect Callum Coats edited and translated this book from Viktor Schauberger&amp;#039;s works with the full title Living Energies - Viktor Schauberger&amp;#039;s Brilliant Work With Natural Energy Explained (2001). Schauberger, a famous austrian natural philosopher, predicted the ecological catastrophes which are occuring all around us and proposed the solution - return to the principles of mother nature.  Among other topics discussed here, this is probably the best expose of Schauberger&amp;#039;s pioneer work in new forestry and water methods. 310 pages, many pictures. A must read for everyone.\n\nFrom the backcover:\nWhy are so many species of plant and animal life disappearing?\nHow is it that Earth is losing more fresh water than it is producing?\nWhat are the effects of chlorination and flouridation of water?\nThe answers to these and many more pressing environmental questions are to be found in this remarkable book - the first in-depth examination of the life and work of the brilliant forester, scientist and pioneering inventor, Viktor Schauberger.\nSchauberger&amp;#039;s insights into Nature pivoted on the essential characteristics of water as a living and pulsating substance that energises all of life, both organic and inorganic. He frequently asserted, &quot;Water is a living substance!&quot; - an idea to which many philosophers have subscribed.\nSchauberger was passionate about forestry and warned how deforestation would deplete the world of water and soil fertility, causing deserts and climatic chaos.\nWith his ground-breaking concepts on energy, biomagnetism and the true function of trees, he showed how a world that exploited its resources rather than cherishing them was doomed to destroy itself. Above all, he demonstrated how Nature&amp;#039;s abundance is the result of a complex interaction of energies that actually create matter, not the other was around as orthodox science believes. For him energy was primary, and physical form the secondary effect.\n","torrent":{"xt":"urn:btih:bcb10f9b0c03e4865e028ff23086a9dd1a842dc6","amp;dn":"Coats+%26+Schauberger+-+Living+Energies+-+Viktor+Schauberger%5C%27s+Br","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bcb10f9b0c03e4865e028ff23086a9dd1a842dc6","infoHashBuffer":{"type":"Buffer","data":[188,177,15,155,12,3,228,134,94,2,143,242,48,134,169,221,26,132,45,198]},"announce":[],"urlList":[]}}