{"title":"Jon Sable Freelance","uid":4384382,"size":937424197,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:be7c9aa2e303f8101ec67bf86bbf577df759f917&amp;dn=Jon+Sable+Freelance&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"gilgamesh07","files":38,"time":1220833769,"description":"By request from the forums. This torrent contains all of the Jon Sable Freelance comics that I have been able to collect.\n\nThis is a combination of TBP volumes and single issues to present a complete run of v1. There are other items included in addition to possibly spark the interest in locating and distributing more.\n\nSable Freelance was an American comic book, one of the first series created for the fledging publisher First Comics in 1983. It was written and drawn by Mike Grell and was a fully creator-owned title, as were all of First Comics&amp;#039; titles.\n\nSable was a bounty hunter and mercenary who previously had been an athlete in the 1972 Munich Olympic Games. After witnessing the terrorist outrages at those games, he married a fellow athlete and they relocated to Rhodesia, where Sable became an organiser of safaris for tourists, and later a game warden. It was during this time his family was murdered by poachers. After avenging his slain family, Sable returned to the USA and became a free-lance mercenary.\n\nHe also has a double identity as a successful children&amp;#039;s book writer under the name of &quot;B.B. Flemm&quot;. Unlike many such characters, his literary agent is aware of his other identity&amp;#039;s activities, but is most persuasive in enforcing his writing contract obligations as well.\n\nThe character was heavily influenced by Ian Fleming&amp;#039;s James Bond novels as well as drawing on pulp fiction crime stories. Also, many of the stories of Sable&amp;#039;s hunting exploits in Africa were influenced by Peter Hathaway Capstick&amp;#039;s novels.\n\nAt a convention in the late 1980s, Grell stated that his idea for Sable was &quot;something like a cross between James Bond and Mickey Spillane&amp;#039;s Mike Hammer.&quot;\n\nJon Sable Freelance lasted 56 issues from 1983 to 1988 before being cancelled. While Grell wrote and did all the covers, he stopped drawing the stories after #44. Late in this run Grell announced in the comic&amp;#039;s own text pages that Tony DeZuniga would soon join him as the new artist. Just what happened to these plans is unclear, but soon the series was suspended, and after a few months, Marv Wolfman was writing and Bill Jaaska was drawing a new series called Sable, with Grell having no part. This lasted 27 issues before cancellation. Marv Wolfman abruptly left the series after issue #23 and comic book fan Steve Kaye took over the writing chores for the final four issues. Fan favorite artist Tim Vigil provided covers for the remaining issues.\n\nThe feature also spawned a short lived ABC 1987 TV series, called Sable. Two pilots were actually produced by ABC and The Taft Entertainment Company, the first starring Gene Simmons of KISS fame. That episode was scrapped (all except one dark, pudgy-bellied shot of Sable) and a new pilot was filmed with relative newcomer Lewis Van Bergen. Seven episodes were filmed. The aired pilot also included Lara Flynn Boyle, as a kidnap victim, in her first acting role.\n\nThe TV series was notable only for its changes to the premise, and for introducing supermodel turned actress Rene Russo to audiences as one of the leads. In the TV series, instead of Sable being the public face and masquerading as a children&amp;#039;s book author, &quot;Nicholas Fleming&quot; was the children&amp;#039;s book author and Sable the mysterious masked do-gooder. Sable was wanted for murder in Africa, it was explained, and the vaguely effete Fleming persona was the only way he could live safely in Chicago. A new character for the TV series was &quot;Cheesecake&quot; Tyson, played by Broadway actor Ken Page as a hacker friend who inevitably supplied exposition.\n\nA third First Comics series, Mike Grell&amp;#039;s Sable, reprinted the first ten issues of the original Jon Sable Freelance series. There was also a tie-in miniseries featuring one of the semi-recurring characters, a thief called Maggie The Cat, at Image Comics in 1996. Only 2 issues were released and the series was never completed.\n\nAfter the title&amp;#039;s cancellation (and First&amp;#039;s ceasing operations), the character made some cameo appearances in some of Grell&amp;#039;s other titles over the years. He did not receive his own series again until March 2005, when IDW Publishing released the first of a new six-issue mini-series titled Jon Sable Freelance: Bloodtrail (originally announced as Jon Sable, Freelance: Conspiracy) written and drawn by Grell. IDW have also been reprinting the entire original run in a series of trade paperbacks.\n\nA new series, Jon Sable: Ashes of Eden, is being serialized on-line beginning in December, 2007. It will be published as a graphic novel in 2008.\n\nGrell wrote a prose novel featuring the character, simply titled Sable, which was published in hardcover in 2000 and in paperback in 2001. The book was partly adapted from early issues of the comic series, with some changes in chronology.\n\nThanks to the scanners and to the Shiverman for providing the links to the majority of what exists in this torrent.\n\nPlease seed. Please enjoy.","torrent":{"xt":"urn:btih:be7c9aa2e303f8101ec67bf86bbf577df759f917","amp;dn":"Jon+Sable+Freelance","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"be7c9aa2e303f8101ec67bf86bbf577df759f917","infoHashBuffer":{"type":"Buffer","data":[190,124,154,162,227,3,248,16,30,198,123,248,107,191,87,125,247,89,249,23]},"announce":[],"urlList":[]}}