{"title":"[2006] The Same Side - Lucie Silvas - 140mb @ 320kbs [only1joe]","uid":5244792,"size":147543153,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:becd68eb4ee366c11fa1ca22cd45d686957b98fc&amp;dn=%5B2006%5D+The+Same+Side+-+Lucie+Silvas+-+140mb+%40+320kbs+%5Bonly1joe%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"only1joe","files":-1,"time":1261941390,"description":"The Same Side - Lucie Silvas [2006]\n &lt;a href=&quot;\nhttp://img200.imageshack.us/img200/7652/thesamesideluciesilvas.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img200.imageshack.us/img200/7652/thesamesideluciesilvas.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://bayimg.com/KakodaACL&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/KakodaACL&lt;/a&gt;\n\nWikipedia - The Same Side is officially the second studio album by British singer-songwriter Lucie Silvas. It was released on October 20, 2006 in the Netherlands and 12 March 2007 in the UK. The album debuted in the Dutch Albums Chart at number five.. The Dutch edition of the album includes the song &quot;Everytime I Think of You&quot;, a duet with Dutch singer Marco Borsato, as the 12th track of the album with &quot;Stolen&quot; as a hidden track (&quot;Almost&quot; is missing on this edition, too). &quot;Everytime I Think of You&quot; was released as the first single off the album and charted within the Dutch Top 40 at number 35 on downloads only, before rising to Number 1 the following week. It has been at #5 on the HMV.co.uk pre-order chart, selling 5,000 copies, but soon fell down the chart. The album has been released in the United Kingdom on March 12, 2007. The second and final single, &quot;Sinking In&quot;, was altered to a 'download only' single, and failed to reach the top 200. Which is unsurprising considering the single &amp; video had no airplay. As of the 18/03/07 the album has peaked at #62 on the UK Albums Chart.\n\nusicomh.com Review By Ben Hogwood - There's a depressing inevitability about much of the current batch of singer/songwriters 'gracing' the charts and airwaves. Yet one of the more accomplished is Lucie Silvas, who continues to deliver her own songs with an untempered, undecorated emotion. She's no slouch on the piano either, a quality that caught the eye of Sir Elton John soon after the release of her debut album. The Same Side is her second record, and though it features a bit more studio pampering, Silvas' best assets shine through, namely her voice and her piano playing. Not for her the anguished whining of a James Blunt, or the empty over-emoting that comes easily to Nerina Pallot. With Silvas, you can be sure that what you get is coming straight from the heart.\nIt's a brave start to the album, too, not the big killer anthem but understated single Last Year, surprisingly low key as it makes the observation that &quot;you don't gimme the words I wanna hear&quot;. It's not the only part of the album that finds Silvas questioning and worrying. She seems to be dwelling on something of an enigma, that finds her wondering that &quot;you're still here but you're already gone&quot; (Already Gone) or that &quot;we're together, but I'm still alone&quot; (Alone). It's an indication that lyrically there's more to this album than meets the eye. Counting finds an inner resolve, Silvas convincing herself that &quot;I won't let all these silly things bug me no more&quot;. Elsewhere she's digging in, and holding out for happiness. Alone again - &quot;So just give me space, some time away, it's a place only for me but I'll be back again&quot;. The production leaves room for Silvas' vocals and piano but finds opportunity for a nice cello line here and there, or a lightly applied Hammond. And yet, with all these good things to note, the feeling persists that this album is going to do some serious time in the coffee bars.\n\n\nI Have Split Track 12 Into Two Separate Tracks And I Have Left The Original Track 12 Included.\n\n\nTrack Listings\n\n[01] Last Year\n[02] Sinking In\n[03] The Same Side\n[04] Trying Not To Lose\n[05] Something About You\n[06] Place To Hide\n[07] Almost\n[08] Right Here\n[09] Counting\n[10] Already Gone\n[11] Alone\n[12] Passionate You \t[Stolen Bonus Hidden Track]\n\t\n[12] Passionate You \t[Split]\n[13] Stolen \t\t[Split Bonus Hidden Track]\n \n\nTotal Mp3 Play Time\t&gt; 00h:47m:59s\t[Excluding Split Tracks]\n\t&gt; 00h:54m:34s\t[Including Split Tracks]\n\nTotal File Size\t&gt; 140mb (Including MP3s, Art Covers &amp; File)\n\nTotal Bit Size\t&gt; 320kbps\n\nMusic File Type\t&gt; I-Tunes v8.1.1.10 MP3 Format\n\nMusic Video Format\t&gt; N / A\n\nScanned Artwork\t&gt; Yes @ 300dpi\n\nOriginal CD Rip\t&gt; Yes - only1joe\n\nOriginal Uploader\t&gt; Yes - only1joe \n\nUpload Speed\t&gt; 33-35KB/s\n\nMusic Genre\t&gt; Pop\n\nRelease Date\t&gt; 20 October 2006 [Netherlands] [12 March 2007 - UK]\n\nRecord Company\t&gt; Mercury Records\n\nArtists WebSite\t&gt; \n\n&gt; http://www.luciesilvas.net \n&gt; http://en.wikipedia.org/wiki/Lucie_Silvas \n&gt; http://www.azlyrics.com/l/luciesilvas.html \n&gt;\n\n\n* * * Please Seed To A Ratio Of 1:1 Or Greater * * *\n* * * I Will Only Re-Seed If There Is More Than 10 Peers Waiting * * *\n* * * Any Problems - Leave Comments On My Most Recent Torrents * * *\n* * * This Is A Multi-Tracker Torrent Check Your Bit Torrent Client For A True Number Of Seeds * * *\n\n","torrent":{"xt":"urn:btih:becd68eb4ee366c11fa1ca22cd45d686957b98fc","amp;dn":"%5B2006%5D+The+Same+Side+-+Lucie+Silvas+-+140mb+%40+320kbs+%5Bonly1joe%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"becd68eb4ee366c11fa1ca22cd45d686957b98fc","infoHashBuffer":{"type":"Buffer","data":[190,205,104,235,78,227,102,193,31,161,202,34,205,69,214,134,149,123,152,252]},"announce":[],"urlList":[]}}