{"title":"Italian Racing Red. F1 Book (.PDF)","uid":7061628,"size":138962113,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:bfe0a85b9cb0d428fb84c78b39c651127a51ef21&amp;dn=Italian+Racing+Red.+F1+Book+%28.PDF%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Spetses","files":-1,"time":1330367344,"description":"The 3rd book in this great series.\n &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/6981783/German_Racing_Silver._F1_Book.&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/6981783/German_Racing_Silver._F1_Book.&lt;/a&gt;\n &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/6970498/British_Racing_Green.___F1_Book.&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/6970498/British_Racing_Green.___F1_Book.&lt;/a&gt;\n\n\n\nProduct Description.\n&quot;The great cars, drivers and races from the top motor-sporting nations form the theme of this spectacular new series of magnificently illustrated \nvolumes. Each country boasts its bloodlines, companies, engineers, executives and enthusiasts whose powerful competitive spirit and dauntless courage \ndrives them to dominate in motor racing.\n\nContinuing in this incredible new series, Italian motor racing experts reveal the dramatic stories behind their successes and failures, the great \nclassic endurance races and Grand Prix contests in which they dominated - or faced disaster. Motor racing, which has no equal in the ecstasy of \nvictory and agony of defeat, comes vividly to life in the colorful pages of these magnificent books.\n\nFerrari is the quintessential bearer of Rosso Corsa, Italian Racing Red, in the 21st Century. Rightly so, because Ferrari Grand Prix cars have \nrepresented Italy in Formula 1 racing since the World Championship was established in 1950. Ferrari sports cars too have carried the flag with \neight victories at Le Mans. But as Karl Ludvigsen explains in his authoritative text, there is much more to Rosso Corsa than Ferrari. In the sport's \nearly years the power to reckon with was Fiat, who also set the pace after World War I. Then a feisty newcomer, Alfa Romeo, carried the Italian flag \nalongside, into the 1930s, the Maserati brothers. Two racing drivers, Felice Nazzaro and Vincenzo Lancia, created their own car marques, one of which \nstormed into prominence in the 1950s.\n\nItalian drivers were to the fore with Tazio Nuvolari, Achille Varzi, Nino Farina, Gigi Villoresi and father and son Antonio and Alberto Ascari. Great \nraces such as the Targo Florio and Mille Miglia, and the iconic circuit Monza, hosted many titanic battles. Shoals of creative specialists competed in \nsmaller classes including Abarth, OSCA, Cisitalia, Nardi, Siata, Stanguellini and Bandini, many of whom backed Gianni Lurani's popular Formula Junior.\n\nMaserati, which scored two Indianapolis wins at the end of the 1930s, held epic contests with Ferrari through the 1960s.\n\nFromm Ferrari to Maserati, the Italians have certainly held a prime position in world motor racing. These colorful contestants and many others come to \nlife in the pages of this volume, with rare images from the world-famous Ludvigsen Library and specially commissioned portraits of key racers by Steven \nCavalieri.&quot;","torrent":{"xt":"urn:btih:bfe0a85b9cb0d428fb84c78b39c651127a51ef21","amp;dn":"Italian+Racing+Red.+F1+Book+%28.PDF%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bfe0a85b9cb0d428fb84c78b39c651127a51ef21","infoHashBuffer":{"type":"Buffer","data":[191,224,168,91,156,176,212,40,251,132,199,139,57,198,81,18,122,81,239,33]},"announce":[],"urlList":[]}}