{"title":"JP Morgan Chase And FDIC Takedown Of Washington Mutual","uid":5205112,"size":3651900,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c14e0b697001f2cefc463fea3a0a3ff2a21177a9&amp;dn=JP+Morgan+Chase+And+FDIC+Takedown+Of+Washington+Mutual&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":null,"files":2,"time":1260344566,"description":"Thought some of you might get a kick out of this since in 15 months the press has barely scratched the surface. I've included an article recently published in the Seattle Business Journal that showcases that WaMu wasn't insolvent when they were seized. It's a pay site, that's why it's not just a link.\n\nI've also included a court document filed in Texas which claims the following...\n\ni) entering into false negotiations with the Washington Mutual, Inc. under the guise of a good-faith bidder during the summer of 2008;\n\n(ii) gaining access to Washington Mutual's confidential and proprietary information through a variety of deceptive practices; and\n\n(iii) disclosing Washington Mutual's confidential information as well as false information to the media and investors in an effort to drive down WMI's credit rating and stock price, cause depositors to withdraw deposits as a result of fear, and hamper efforts of Washington Mutual, Inc. to find a purchaser for itself.\nThe filing suggests that additional claims that could arise in the bankruptcy proceeding might include, without limitation, unfair competition, tortious interference, interference with prospective economic advantage, breach of contract, misappropriation of confidential information and trade secrets, and conversion. The filing further suggest that by way of these claims, JPMC may be held responsible for the destruction of Washington Mutual, Inc. and the total losses suffered by its creditors and shareholders.\n\nIn addition, the underlying Texas action alleges that JP Morgan Chase &amp; Co. used plants or moles (e.g., the Rotella allegations) inside of Washington Mutual, Inc. for the purposes of gaining insider information and exploiting that information for economic gain.\n\nIt's mind numbing in scope and JPM literally signed a contract with WaMu saying they wouldn't purchase the bank or any of it's assets from anyone but WaMu's holding company for 18 months and then turned around and did it anyway.\n\nThey got a 300 billion dollar solvent bank for 1.8 billion dollars...\n\nThis is a story that is brewing under the radar and it's beginning to come to a head. I just thought some of you conspiracy minded folks might get a kick out of it.\n &lt;a href=&quot;\nhttp://www.wamutruth.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.wamutruth.com/&lt;/a&gt;\n\n\nConspiracyHub Member Share.\n  ____                      _                      _   _       _\n / ___|___  _ __  ___ _ __ (_)_ __ __ _  ___ _   _| | | |_   _| |__\n| |   / _ \\| '_ \\/ __| '_ \\| | '__/ _` |/ __| | | | |_| | | | | '_ \\\n| |__| (_) | | | \\__ \\ |_) | | | | (_| | (__| |_| |  _  | |_| | |_) |\n \\____\\___/|_| |_|___/ .__/|_|_|  \\__,_|\\___|\\__, |_| |_|\\__,_|_.__/\n                     |_|                     |___/\n   ____\n  / ___|___  _ __ ___\n | |   / _ \\| '_ ` _ \\\n | |__| (_) | | | | | |\n(_)____\\___/|_| |_| |_|\n\n\nPLEASE KEEP SEEDED TO PASS ON MESSAGE.  PLEASE VISIT OUR SITE AND SHARE THE WORD!\nMAYBE SLOW BUT SURE! PLEASE ASSIST IN BANDWIDTH!\n\n* Don't Be Fooled Any Longer on Darwinism, Evolution, Global Warming Lies, Internationalism, etc.\n* Getting The Message Out, Openly!\n","torrent":{"xt":"urn:btih:c14e0b697001f2cefc463fea3a0a3ff2a21177a9","amp;dn":"JP+Morgan+Chase+And+FDIC+Takedown+Of+Washington+Mutual","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c14e0b697001f2cefc463fea3a0a3ff2a21177a9","infoHashBuffer":{"type":"Buffer","data":[193,78,11,105,112,1,242,206,252,70,63,234,58,10,63,242,162,17,119,169]},"announce":[],"urlList":[]}}