{"title":"FFH The Creation of Italy","uid":9402753,"size":652817536,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:c2a871939c9ccb092d2aec3d5a4e47e544153015&amp;dn=FFH+The+Creation+of+Italy&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"stew_dent","files":1,"time":1388105741,"description":"1. Using Puppets to Teach Italian History (03:08)\n\nPuppets are useful tools for teaching about the Italian Wars of Independence. In reality, French Emperor Napoleon III became the puppet master who helped free northern Italy from Austrian rule and thus establishing a united Italy.\n\n2. Alliance Between France and Italy Against Austria (03:52)\n\nIn 1848, a series of European revolutions led to uprisings in Italy to overcome Austrian rule in the northern Italian kingdom of Lombardy-Venetia. With France prospering, Napoleon III decided to help the Italians.\n\n3. Austro-Sardinian War (03:43)\n\nKing Victor Emmanuel II declared war on Austria. His prime minister, Count Cavour, aimed to unify Italy under the House of Savory. Republicans Mazzini and Garibaldi distrusted Cavour but continued their own fight for the Italian republic.\n\n4. Austria's Army (01:54)\n\nThe Austrian army, an ethnically diverse group of soldiers, marched towards Turin but preferred a defensive strategy. This idea gave time for the Italians to hold them back by flooding the Lombardy plains until the French army arrived.\n\n5. Defeating the Austrians in Milan (05:38)\n\nThe Austrians lost their opportunity to attack the smaller Italian army when the well-equipped French soldiers arrived by train. Napoleon executed a flanking maneuver and attacked Milan, freeing the Italians from Austrian rule.\n\n6. Garibaldi: Italy's Revolutionary Hero (02:33)\n\nIn Tuscany, Cavour established provisional governments, but the papal states remained under threat by growing national and liberal movements springing up throughout Italy, led by Garibaldi, the personification of an idealistic revolutionary.\n\n7. Battle of Solferino Begins (05:12)\n\nIn June, 1859, the 29-year-old Austrian emperor, Franz Joseph, took command of his army to face his enemies, the French and Italians, at the foot of the tower in Solferino.\n\n8. Victory at the Battle of Solferino (04:47)\n\nWith Napoleon's strategies, the French and Italians defeated the Austrian army, which took advantage of the dark and storm and retreated to Austria.\n\n\n9. Price of War in Solferino (02:24)\n\nThe great victory came with a high cost for all three armies. After witnessing the horrors of the battle, Henri Dunant, a Swiss banker, created the International Red Cross, an organization designed to bring some humanity to war.\n\n10. Independence for Italy (03:30)\n\nIn July, 1859, Napoleon and Franz-Joseph signed a peace agreement giving Venice to Austria. Feeling betrayed, the Italians declared Napoleon a traitor. Garibaldi's volunteers conquered Naples and Sicily. Ten years later Italy became one country.","torrent":{"xt":"urn:btih:c2a871939c9ccb092d2aec3d5a4e47e544153015","amp;dn":"FFH+The+Creation+of+Italy","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c2a871939c9ccb092d2aec3d5a4e47e544153015","infoHashBuffer":{"type":"Buffer","data":[194,168,113,147,156,156,203,9,45,42,236,61,90,78,71,229,68,21,48,21]},"announce":[],"urlList":[]}}