{"title":"Legion of Super-Heroes Annual 01 (1982-08) (DobisP.R.-Novus-HD)","uid":8122748,"size":108823392,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:c2c661e213298c161226c9e4e6fd6be7c5774059&amp;dn=Legion+of+Super-Heroes+Annual+01+%281982-08%29+%28DobisP.R.-Novus-HD%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"blackcanary","files":-1,"time":1360427659,"description":"English | CBR | 43 Pages\n\nLegion of Super-Heroes Annual #1\nPublisher:  DC Comics\nPublication Date:  August 1982\n\nWriter:  Paul Levitz\nPenciller and Co-Plotter:  Keith Giffen\nInk Artist:  Bruce Patterson\nColorist:  Carl Gafford\nLetterer:  John Costanza\n\nScience Police Officer Shvaughn Erin becomes the first liaison between the Science Police and the Legion of Super-Heroes. Element Lad, the new acting leader of the Legion, gives Officer Erin a tour of the brand new Legion headquarters to acclimate her. As they continue to peruse the new facilities, they arrive to their new medical unit where Brainiac 5 and Dream Girl are examining a girl named Danielle Foccart. Danielle Foccart's brother, Jacques Foccart, is also in the headquarters caring for his ill sister. Brainiac 5 is set to begin computer-assisted surgery when the computer explodes from feedback and Danielle rises from the bed with her eyes glowing red. Soon all computer-based components within the Legion headquarters goes haywire and Danielle Foccart is the source of the problem. It is soon revealed that Danielle Foccart is being controlled by Computo, a renegade AI computer created by Brainiac 5 that fought against the Legion of Super-Heroes in the past. As Computo causes the Legion Headquarters attack and hold the Legion, the Science Police evacuate the city and try to assist from outside. The Green Lantern Corps offer assistance, but the President of Earth declines their offer, as per Earth's policy to never have Green Lantern on their planet anymore. Brainiac 5 comes up with a plan for Jacques Foccart to drink the invisibility serum that the original Invisible Kid created so he could use stealth to stop the possession of his younger sister by Computo. He is able to defeat Computo and restore his sister back to her human self, though Brainiac 5 is still trying to find a cure for her original illness. Brainiac 5 is impressed with Jacques Foccart's contribution and nominates him to join the Legion of Super-Heroes. The Legion agrees and he becomes the newest member on the team.\n\nThanks goes to DobisP.R. for this release.","torrent":{"xt":"urn:btih:c2c661e213298c161226c9e4e6fd6be7c5774059","amp;dn":"Legion+of+Super-Heroes+Annual+01+%281982-08%29+%28DobisP.R.-Novus-HD%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c2c661e213298c161226c9e4e6fd6be7c5774059","infoHashBuffer":{"type":"Buffer","data":[194,198,97,226,19,41,140,22,18,38,201,228,230,253,107,231,197,119,64,89]},"announce":[],"urlList":[]}}