{"title":"Talking Heads - Remain In Light DVD","uid":5161341,"size":771910112,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:c3ed47db0ccb7ecd60b31847edba989f7d4c933b&amp;dn=Talking+Heads+-+Remain+In+Light+DVD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"miona45","files":-1,"time":1258163412,"description":"Talking Heads - Remain In Light DVD\n\nThis is the companion disc that goes with the Remain In Light FLAC torrent I already uploaded.  This is in DVD format and has 8 tracks in dolby digital 5.1 \nsurround sound (or stereo dolby) and 2 concert videos.  If you burn the disc as a\nDVD, it should play in most stand alone players.\n\nFrom Wikipedia:\n\nRemain in Light is the fourth studio album by American New Wave band\nTalking Heads, released on 8 October 1980 on Sire Records. It was recorded\nat locations in the Bahamas and the United States between July and August 1980\nand was produced by the quartet's long-time collaborator Brian Eno. The album\nentered the Billboard 200 in the US at number 19 and peaked at number 21 on\nthe UK Albums Chart. Two singles were released from Remain in Light: \n&quot;Once in a Lifetime&quot; and &quot;Houses in Motion&quot;. The record was certified Gold\nin the US and in Canada during the 1980s.  The members of Talking Heads wanted\nto make an album that dispelled notions of frontman and chief lyricist \nDavid Byrne leading a back-up band. They decided to experiment with African\npolyrhythms and, with Eno, recorded the instrumental tracks as a series of \nsamples and loops, a novel idea at the time. Additional musicians were frequently\nused throughout the studio sessions. The lyric writing process slowed Remain in\nLight's progress, but was concluded after Byrne drew inspiration from academic\nliterature on Africa. The artwork was crafted with the help of the Massachusetts\nInstitute of Technology's computers and designing company M&amp;Co.. Following the \nalbum's completion, Talking Heads expanded to nine members for promotional concerts.  Remain in Light was widely acclaimed by critics. Praise centred on its \ncohesive merging of disparate genres and sonic experimentation.  The record \nhas featured in several publications' lists of the best albums of the 1980s \nand the best albums of all time. It is often considered Talking Heads' magnum opus.\n\n\n \n\n\nTalking Heads - Remain in Light (DVD)\n\n01. Born Under Punches (The Heat Goes On)    [0:05:49.28]\n02. Crosseyed and Painless    [0:04:47.82]\n03. The Great Curve    [0:06:27.56]\n04. Once in a Lifetime    [0:04:22.56]\n05. Houses in Motion    [0:04:33.20]\n06. Seen and Not Seen    [0:03:24.52]\n07. Listening Wind    [0:04:42.90]\n08. The Overload    [0:06:10.93]\n\nConcert Videos:\n\n1. Crosseyed and Painless\n2. Once in a Lifetime\n","torrent":{"xt":"urn:btih:c3ed47db0ccb7ecd60b31847edba989f7d4c933b","amp;dn":"Talking+Heads+-+Remain+In+Light+DVD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c3ed47db0ccb7ecd60b31847edba989f7d4c933b","infoHashBuffer":{"type":"Buffer","data":[195,237,71,219,12,203,126,205,96,179,24,71,237,186,152,159,125,76,147,59]},"announce":[],"urlList":[]}}