{"title":"Snooky Pryor Snooky(blues)(mp3@320)[rogercc]","uid":6418811,"size":98940928,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:c497511758a95514d06e690ea15a9925a6ead599&amp;dn=Snooky+Pryor+Snooky%28blues%29%28mp3%40320%29%5Brogercc%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"rogercc1","files":12,"time":1306246818,"description":"SNOOKY PRYOR SNOOKY\nLabel Blind Pig \nOriginal Year 1987\nFormat:Mp3@320\n\n\n\nSnooky Pryor was a true pioneer of the postwar blues sound. Born in Lambert, Mississippi on September 15, 1921, James Edward Pryor took up the harp at the age of 14 despite the objections of his minister father, copping licks from old Sonny Boy Williamson 78's. \nStationed with the army outside Chicago in 1940, Snooky jammed on weekends with the likes of Sonny Boy and Homesick James and played on the Maxwell Street scene. 1945 saw his musical career begin in earnest. In 1948, he made his recording debut with &quot;Telephone Blues&quot; on the tiny Planet label, now considered one of the earliest postwar Chicago blues classics. He recorded intermittently throughout the '50s for J.O.B., Parrot, and VeeJay, and with his natural, swinging harp sound, was also highly in demand as a session musician, playing on sides with Sunnyland Slim, Floyd Jones, Homesick James, and others of the &quot;Maxwell Street School&quot;. His other now venerated recordings include &quot;Someone To Love Me&quot;, &quot;Snooky and Moody's Boogie&quot;, and &quot;Judgment Day&quot;. \nAn extremely devout and principled man, he became disillusioned with the music business and retired to downstate Illinois for most of the '60s and '70s to pursue carpentry, fishing, and to see after his large family. Finally, a series of successful European tours lured him back to performing regularly. With his children grown, Snooky found the time to write new material, and eight of those compositions are on Snooky, his first domestic album of material ever released. Snooky chose Sunnyland slim band members Robert Stroger on bass, Steve Freund on guitar, and Muddy Waters' band alumnus Willie &quot;Big Eyes&quot; Smith on drums. Released in 1987, the recording forced Snooky out of semi-retirement as the attention garnered from this release increased the demand for his personal appearances both here in the United States and abroad. \n\nTracklist\n1 Broke And Hungry \n2 Nine Below Zero\n3 Judgment Day \n4 Why You Want to Do Me Like That \n5 It Hurts Me Too \n6 Look What You Doin' to Me \n7 Cheatin' and Lyin' \n8 Crazy 'Bout My Baby \n9 Key To the Highway \n10 That's the Way to Do It \n11 Money and Women \n12 Don't Worry 'Bout Me \n\nRecorded at Acme Studios, Chicago, Illinois.\n\nPersonnel: Snooky Pryor (vocals, harmonica); Steve Freund (guitar); Willie &quot;Big Eyes&quot; Smith (drums).\n","torrent":{"xt":"urn:btih:c497511758a95514d06e690ea15a9925a6ead599","amp;dn":"Snooky+Pryor+Snooky%28blues%29%28mp3%40320%29%5Brogercc%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c497511758a95514d06e690ea15a9925a6ead599","infoHashBuffer":{"type":"Buffer","data":[196,151,81,23,88,169,85,20,208,110,105,14,161,90,153,37,166,234,213,153]},"announce":[],"urlList":[]}}