{"title":"Dead Can Dance - Spleen And Ideal (1986) 2008 MFSL-SACD-DFF","uid":11107198,"size":1600670830,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:c6d5f6bc4c4fd6ab663913de5f0d1275cf9d6d54&amp;dn=Dead+Can+Dance+-+Spleen+And+Ideal+%281986%29+2008+MFSL-SACD-DFF&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"hal4000","files":-1,"time":1411741950,"description":"Dead Can Dance is an English-Australian musical project that formed in 1981 in Melbourne by Lisa Gerrard and Brendan Perry. The band relocated to London, England, in May 1982. Australian music historian Ian McFarlane described Dead Can Dance's style as &quot;constructed soundscapes of mesmerising grandeur and solemn beauty; African polyrhythms, Gaelic folk, Gregorian chant, Middle Eastern mantras and art rock.&quot;\n\nWith this amazing album, Dead Can Dance fully took the plunge into the heady mix of musical traditions that would come to define its sound and style for the remainder of its career. The straightforward goth affectations are exchanged for a sonic palette and range of imagination. Calling it &quot;haunting&quot; and &quot;atmospheric&quot; barely scratches even the initial surface of the album's power. The common identification of the duo with a consciously medieval European sound starts here -- quite understandable, when one considers the mystic titles of songs, references to Latin, choirs, and other touches that make the album sound like it was recorded in an immense cathedral. Opening number &quot;De Profundis&quot; sets this mood so thoroughly, with bells and drones and more supporting another bravura performance from Gerrard, while the immediately following &quot;Ascension&quot; builds on this initial effort with further style and grace. It's limiting to think of either album or band strictly in terms of simple revivalism of old music. While the elements being drawn on are certainly of an older range, the results owe as much to the technologies of arrangement and production and a consciously cinematic feeling as much as they do antique pasts. Similarly, the feeling is not simply European but worldwide, with Gerrard's glossolalia intentionally reaching beyond easy understanding. Perry's vocal efforts are no less compelling, his own high point occurring with the vast-sounding &quot;Enigma of the Absolute,&quot; as a steady, massive drum pound echoes behind a similarly treated guitar/harpsichord combination, tinged with a striking string arrangement. The overall feeling is of an ancient religious service suddenly brought to life in a truly modern way, with stunning results.\n\nDFF files extracted with Scarletbook\n  &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/10942620/Scarletbook-SACD-Extractor&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/10942620/Scarletbook-SACD-Extractor&lt;/a&gt;\n\nfrom the 2008 Mobile Fidelity Sound Lab SACD.\n\nSACD-ISO-DFF-1Bit-2.8Mhz.\n\n","torrent":{"xt":"urn:btih:c6d5f6bc4c4fd6ab663913de5f0d1275cf9d6d54","amp;dn":"Dead+Can+Dance+-+Spleen+And+Ideal+%281986%29+2008+MFSL-SACD-DFF","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c6d5f6bc4c4fd6ab663913de5f0d1275cf9d6d54","infoHashBuffer":{"type":"Buffer","data":[198,213,246,188,76,79,214,171,102,57,19,222,95,13,18,117,207,157,109,84]},"announce":[],"urlList":[]}}