{"title":"Crash Proof - How to Profit From The Coming Economic Collapse- P","uid":4480632,"size":2827315,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c718d921bc177990796407a9db166c9a9515c80d&amp;dn=Crash+Proof+-+How+to+Profit+From+The+Coming+Economic+Collapse-+P&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"john5246","files":1,"time":1225553307,"description":"The economic tipping point for the United States is no longer theoretical. It is a reality today. The country has gone from the world's largest creditor to its greatest debtor; the value of the dollar is sinking; domestic manufacturing is winding down - and these trends don't seem to be slowing. Peter Schiff casts a sharp, clear-sighted eye on these factors and explains what the possible effects may be and how investors can protect themselves. For more than a decade, Schiff has not only observed the U.S. economy, but also helped his clients reposition their portfolios to reflect his outlook. What he sees is a nation facing an economic storm brought on by growing federal, personal, and corporate debt, too-little savings, a declining dollar, and lack of domestic manufacturing.\n\nCrash-Proof is an informed and informative warning of a looming period marked by sizeable tax hikes, loss of retirement benefits, double digit inflation, even - as happened recently in Argentina - the possible collapse of the middle class. However, Schiff does have a survival plan that can provide the protection that readers will need in the coming years.\n\n\n\nCrash Proof: How to Profit From The Coming Economic Collapse by Peter D. Schiff\n\nPDF File 2.71MB\n\n\n\nPeter Schiff's Website is http://www.europac.net/","torrent":{"xt":"urn:btih:c718d921bc177990796407a9db166c9a9515c80d","amp;dn":"Crash+Proof+-+How+to+Profit+From+The+Coming+Economic+Collapse-+P","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c718d921bc177990796407a9db166c9a9515c80d","infoHashBuffer":{"type":"Buffer","data":[199,24,217,33,188,23,121,144,121,100,7,169,219,22,108,154,149,21,200,13]},"announce":[],"urlList":[]}}