{"title":"Deine Lakaien - White Lies[FLAC - LOSSLESS]","uid":4188541,"size":337147806,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:c76b6d359b658e03813a99910ee892b983bd602b&amp;dn=Deine+Lakaien+-+White+Lies%5BFLAC+-+LOSSLESS%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"99AM","files":19,"time":1210808898,"description":"FLAC files + CUE sheet + Covers.\nRelease dat: Jan 7, 2002.\n\n\nTrack Listing:\n1. Wunderbar (4:15)\n2. Generators (4:45)\n3. Where You Are (4:10)\n4. Prayer (4:57)\n5. Stupid (3:46)\n6. Kiss (4:00)\n7. Silence in Your Eyes (4:37)\n8. Hands White (Mane Bianchi) (5:52)\n9. Lost (5:59)\n10. Fleeting (4:05)\n11. Life Is a Sexually Transmitted Disease (5:03)\n12. One Minus One (4:44)\n\n\n\nThe German duo of Ernst Horn and Alexander Veljanov are minor legends in their German homeland. Like contemporaries Wolfsheim, they compete with international corporate megastars at the top of their countries charts and attract huge crowds wherever they happen to be playing live. And unlike Wolfsheim, they retain their reputation for being a little bit &amp;#039;odd&amp;#039;, that little bit &amp;#039;quirky&amp;#039;, the thing that keeps their sound distinctive. This despite hardly ever singing in their native tongue. At least it means that me, muggins here can understand it.\n\nWhich brings me to &amp;#039;White Lies&amp;#039; - Deine Lakaien&amp;#039;s 2002 album. The first thing to strike me level of &amp;#039;accessibility&amp;#039; - the ratio of &amp;#039;weird to conventional&amp;#039; is similar to that of &amp;#039;Kasmodiah&amp;#039;, but even the really experimental tracks don&amp;#039;t take THAT much effort to get into. Not that this is any bad thing in moderation - I mean, face it, who really ever got their head round &amp;#039;Winter Fish Testosterone&amp;#039;? It&amp;#039;s not like DL have suddenly discovered the art of songwriting (we always knew what they could do), it more that they&amp;#039;ve achieved balance over an entire album.\n\nAnd where better to start than album opener &amp;#039;Wunderbar&amp;#039;. And no, they are still singing in English. Mostly. What we get here is a gentle guitar ballad, Veljanov&amp;#039;s soft, sonorous voice detailing the love affair between a wandering drunk and a lamp post! With delicate strings floating past in the background, and Horn&amp;#039;s keyboards and piano filling in the gaps, it makes for strong introduction - deceptively innocent, impeccably produced but with a dark undercurrent. Or in other words, it pulls off the Depeche Mode trick without sounding the slightest bit like them.\n\n&amp;#039;Generators&amp;#039; takes us to a more familiar Lakaien territory. The lead single from the album gets a fresh treatment hear, a subtle, pithy little synth-ballad, the kind of thing this duo do so well, and do so many times on this CD. Like all the best songs, it seems to have some kind of hidden meaning which may or may not exist - which of course results in many a repeated listen. Picking up the pace is &amp;#039;Where You Are&amp;#039;, the other single from the album, a sort of life-changing tribute to person or persons unknown.\n\nThings start getting odd with &amp;#039;Prayer&amp;#039;. It makes vague reference to advances in genetic engineering, specifically cloning technology, and trying to out-do Mother Nature at her own game by creating some kind of master race. I might have misread this one totally, but this interpretation does make the song sound just a little unnerving to the ears that are mine. Then we get the diversion of &amp;#039;Stupid&amp;#039;, a purposefully silly synth-popper, cynically answering those that dare criticise the songwriting talents of others (guilty? moi!?). As &amp;#039;joke&amp;#039; songs go, this one is at least acceptable in it&amp;#039;s mere existence.\n\nNow we get &amp;#039;The Kiss&amp;#039;, a hurdy-gurdy driven folk song about cheating on one&amp;#039;s lover during a dirty weekend in France. Veljanov is in his element here, really getting behind the songs dynamics and driving it through to it&amp;#039;s conclusion. The following track &amp;#039;Silence In Your Eyes&amp;#039; is something of an anticlimax. The minimalistic approach they opt for is one that can be made to work under the right circumstances, but this particular song is too insubstantial and vague to really succeed, despite some nice melodic keyboard work from Horn.\n\nThe next song is &amp;#039;Hands White (Mani Bianche)&amp;#039;, the point at which the album reaches it&amp;#039;s least accessible point. The trick here is Sabrine Lutzenberger (from the Helium Vola project) echoing Veljanov&amp;#039;s vocals in the form of an Italian translation. It&amp;#039;s a reasonable attempt at trying something different, not particularly catchy but a fair attempt at what appears to be a left-of-centre anthem for political unity.\n\n&amp;#039;Lost&amp;#039; is another one of those low-key ballady ones, but still effective as tribute to ones failures, building up to an increasingly complex and chaotic sound as the song reaches it&amp;#039;s climax. Now on the home straight, &amp;#039;Fleeting&amp;#039; deals with the impending end of a relationship in almost resigned fashion. Featuring the return of live string instruments, it&amp;#039;s a rich, professional-sounding number that&amp;#039;s typically the sign of a band at home with themselves and their music, even if the song itself is not their strongest.\n\nThe penultimate track is also the best, which is surprising as it&amp;#039;s not even a &amp;#039;new&amp;#039; song as such. The track is &amp;#039;Life Is A Sexually Transmitted Disease&amp;#039;, the latest part in the &amp;#039;Reincarnation&amp;#039; series and the closest we&amp;#039;ve got to a remake of the lead track from the ancient &amp;#039;Dark Star&amp;#039; album. This version drives the song to new levels, with that title line remaining the single most memorable aspect of the whole album. The album then just fades out quietly with outro track &amp;#039;One Minus One&amp;#039;.\n\nIt&amp;#039;s very tricky to try and work out who to recommend this album to. Unlike other so-called &amp;#039;synth-pop&amp;#039; bands (and to a lesser extent, some of Deine Lakaien&amp;#039;s earlier songs), it&amp;#039;s not really music for dancing to. Symbolising as it does Deine Lakaien&amp;#039;s &amp;#039;maturity of sound&amp;#039; in full bloom, it&amp;#039;s the kind of album you need to sit back and listen to, and in that respect it works both within the musical remit of this site and possibly outside it as well. I can quite imagine your normal, everyday German music lover, popping into &amp;#039;World of Musik&amp;#039; to bag a copy. I guess that&amp;#039;s a suggestion that you should now go to your local German-import friendly vendor and do likewise. Unless you&amp;#039;re already in Germany, in which case you probably already have this anyway...\n\n(Review from EOL-Audio)\n\n\nEnjoy!\n","torrent":{"xt":"urn:btih:c76b6d359b658e03813a99910ee892b983bd602b","amp;dn":"Deine+Lakaien+-+White+Lies%5BFLAC+-+LOSSLESS%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c76b6d359b658e03813a99910ee892b983bd602b","infoHashBuffer":{"type":"Buffer","data":[199,107,109,53,155,101,142,3,129,58,153,145,14,232,146,185,131,189,96,43]},"announce":[],"urlList":[]}}