{"title":"Mediterranean Diet For Dummies by Rachel Berman","uid":9343097,"size":2255117,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c781d82f8f466437ed62232c878fdd4aa8569379&amp;dn=Mediterranean+Diet+For+Dummies+by+Rachel+Berman&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"420weedman","files":4,"time":1386971645,"description":"Expert advice on transitioning to this healthy lifestyle \nThe Mediterranean diet is a widely respected and highly acclaimed diet based on the food and lifestyles common to the people of Greece, Cyprus, Southern France, Spain, and coastal Italy. In addition to being a healthy, extremely effective way of losing weight, the Mediterranean diet is considered an effective means of avoiding or reversing many health problems, such as cardiovascular issues, pre-Diabetes, and obesity. \nThis hands-on, friendly guide covers the numerous health benefits of the Mediterranean diet and encourages meals that consist largely of healthy foods such as whole grains, fresh fruits and vegetables, olive oil and other healthy fats, fish, and foods high in Omega-3 fat content, such as seafood, nuts, beans, and dairy products. Featuring 20 delicious and nutritious recipes and chock-full of tips from consuming the best oils to whether wine is okay with meals (it is), Mediterranean Diet For Dummies serves as the formula for maximizing success in achieving ideal weight and health.","torrent":{"xt":"urn:btih:c781d82f8f466437ed62232c878fdd4aa8569379","amp;dn":"Mediterranean+Diet+For+Dummies+by+Rachel+Berman","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c781d82f8f466437ed62232c878fdd4aa8569379","infoHashBuffer":{"type":"Buffer","data":[199,129,216,47,143,70,100,55,237,98,35,44,135,143,221,74,168,86,147,121]},"announce":[],"urlList":[]}}