{"title":"Leading Global Projects","uid":4734843,"size":1268696,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c8bb0929452cbfbbdedf17c641b4f45e8255d1ba&amp;dn=Leading+Global+Projects&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"VasiaZozulia","files":-1,"time":1235230063,"description":"This book is a must-read for anyone responsible for projects and initiatives that span functional and geographical divides. Authors Moran and Youngdahl bring extensive experience and learning from industry practice to present a clear and straightforward treatment of the leadership skills and knowledge required to lead projects that are global in nature. They have written the first book of its kind to address the three essential skills of global project leaders - strategic project management, project leadership, and cross-cultural leadership.\n\nThe authors argue that global project leadership is an essential skill in our project-based world and that we are all either intentional or accidental project leaders. Intentional project leaders pursue formal project management education and even certification whereas accidental project leaders find themselves leading global project and initiatives as a result of a special assignment or promotion. Moran and Youndahl have found that the vast majority of global projects leaders fall into the accidental category and have written the book to be accessible to those who have not necessarily pursued formal project management education. Experienced intentional project managers can skip the single chapter on project management fundamentals to move to the more advanced chapters addressing topics such as influencing without formal authority across functional and geographical boundaries and leading global projects at the edge of crisis.\n\nThe only book that combines themes of strategic project management, project leadership and cross-cultural leadership\n\nRich with examples and stories to illustrate key skills and knowledge required to lead global projects\n\n*Only book to focus on leadership and cross-cultural skills in global project management\n*Robert Moran is well-known author in these fields\n*Book is designed for easy use in executive education courses ","torrent":{"xt":"urn:btih:c8bb0929452cbfbbdedf17c641b4f45e8255d1ba","amp;dn":"Leading+Global+Projects","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c8bb0929452cbfbbdedf17c641b4f45e8255d1ba","infoHashBuffer":{"type":"Buffer","data":[200,187,9,41,69,44,191,187,222,223,23,198,65,180,244,94,130,85,209,186]},"announce":[],"urlList":[]}}