{"title":"Madden NFL 12 [wii] [ntsc] [scrubbed]","uid":6641537,"size":2323568856,"categoryP":"games","categoryS":"wii","magnet":"?xt=urn:btih:c9b57480937ff970b39d72f17e088e42608ef074&amp;dn=Madden+NFL+12+%5Bwii%5D+%5Bntsc%5D+%5Bscrubbed%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"flat480","files":-1,"time":1314770057,"description":"    The new system uses a player's momentum and over 100 new tackle animations, including 40 gang tackles, to provide more impactful hits, stolen tackles, and consecutive hit tackling.\n    Players in zone and man coverage will properly recognize and react to plays, including the ability to break out of assignments when appropriate, resulting in a defensive team that truly works together.\n    The Number 1 most requested feature allows you to build the ultimate game plan by modifying an existing playbook or creating your own by selecting up to 400 offensive or defensive plays from 75 different playbooks.\n    Experience NFL Sundays including 32 team specific run outs, over 500 dynamic broadcast cameras and a network broadcast graphics package.\n    Visual improvements including new player equipment, helmet stickers, pylon and ball physics, player degradation system that affects uniforms and helmets based on weather and field surface, 3D grass, and new player specific animations.\n\n\n\nGameplay\n\n    The kickoffs are now at the 35-yard line due to the 2011 NFL lockout rule change.\n    Onside kicks can be executed from standard kickoff formations.\n    Tuner sets can be downloaded in order for developers to improve gameplay code without the distribution of official patches.\n    To support awareness for concussions, players who suffer a concussion during gameplay will no longer be allowed to return to the game.[5]\n    A new collision system uses momentum to produce more authentic tackling and hits with 100 new tackle animations, including 40 gang tackles.\n    AI enhancements allow players in zone and man coverage to correctly recognize and react to plays with the capability to break out of assignments when necessary.\n    The custom playbooks feature allows the player to modify an existing playbook or create his or her own by selecting plays from 75 playbooks.\n    The opening presentation for games includes mascots and cheerleaders for all teams that have them.\n    Player traits change dynamically throughout a game based on his performance.\n    Quarterbacks have distinct throwing motions, making them look much more like their real-life counterparts.\n\n[edit] Franchise mode\n\n    During free agency in franchise mode, players bid auction-style against other general managers for free agents.\n    Expanded rosters in the preseason allow teams to have 75 players on the roster and need to make roster cuts each week.\n    Unlike previous versions of Madden NFL, players can trade for future draft picks.\n    There are also hot and cold streaks that will affect player ratings throughout the season.\n\n\n\nenjoy  please seed!!!!\n\n**************** this game is confirmed working *****************                 \n\nworks on ntsc 4.1u \nusb loader gx 2.1 ios 249 R(17) \ndisk channel (darkcorp v1.1)\n","torrent":{"xt":"urn:btih:c9b57480937ff970b39d72f17e088e42608ef074","amp;dn":"Madden+NFL+12+%5Bwii%5D+%5Bntsc%5D+%5Bscrubbed%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c9b57480937ff970b39d72f17e088e42608ef074","infoHashBuffer":{"type":"Buffer","data":[201,181,116,128,147,127,249,112,179,157,114,241,126,8,142,66,96,142,240,116]},"announce":[],"urlList":[]}}