{"title":"The Dresdent Dolls - A Is for Accident","uid":3458681,"size":80054405,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:ca90c151f0ea0fda5fd17a9e64ac3fe1925edfa4&amp;dn=The+Dresdent+Dolls+-+A+Is+for+Accident&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Tarvos","files":10,"time":1142605226,"description":" &lt;a href=&quot;http://www.dresdendolls.com/main1.htm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.dresdendolls.com/main1.htm&lt;/a&gt;\n\n&quot;Cabaret-punk&quot; is one of the most misapplied coinages floating around. You&amp;#039;ve seen dozens of musicians tagged with it, from Gavin Friday to Gogol Bordello-- all more or less in error. If the term meant delivering three-chord anthems in pancake makeup, or simply amping the theatricality, then the best current cabaret-punk act would be KISS. Boston&amp;#039;s Dresden Dolls supply the genre&amp;#039;s true definition: they take Weimar chords and Tin Pan Alley wordplay (the latter thematically and linguistically updated to include skateboarders and sodomy), and present them with the wide-eyed, fuck-all urgency of vintage CBGB&amp;#039;s.\n\nHead Doll Amanda Palmer&amp;#039;s voice can slide from shipwreck bullhorn to girly twitter and back within the same line. To gauge the confused awe she inspires in the listener, you have to think back to the first time you&amp;#039;ve heard air through the vocal cords of Polly Jean Harvey. Palmer&amp;#039;s huge sound appears to come almost infuriatingly easy: a natural on stage, she carelessly whispers, sniffles, scat-sings, murmurs asides, and frequently cracks up at her own lyrics, all the while playing respectable piano. Mime-faced drummer Brian Viglione supplies tactful brushwork for her verses, and sets mighty tom rolls for grand finales.\n\nThis is the first time I&amp;#039;m writing a review knowing that the act will be huge. I&amp;#039;m not exactly famous for clairvoyance (having shrugged off Interpol in 1999 with five lines in the Village Voice), so by no means take my word for it. But the signs are all there-- the hypnotically effective live show, the celebrity fans (among them Beck and Perry Farrell), and the long line for crappy homemade demos after each gig. For now, the fame is mostly confined to Massachusetts, where the Dresden Dolls won a battle of the bands and scored admirers at the Boston Phoenix. They have also developed an odd entourage of teenage goths who do ballroom-dancing routines at their concerts (and appear to follow the band around the Northeast).\n\nA Is For Accident is not the Dolls&amp;#039; proper debut: it&amp;#039;s a shrewd feature-length trailer for it, a collection of live recordings from the last two years, a handicap to give you a general idea of what you&amp;#039;ve missed so far. This transitional status-- most songs, I&amp;#039;m guessing, are soon to reappear in studio versions-- is the only factor that keeps it from a higher rating here.\n\nThe songs were recorded all over the Northeast, and the quality varies accordingly-- from clean soundboard mixes to what sounds like the work of a drunken groupie careening through the crowd with a MiniDisc recorder. The immediate standout is &quot;Mrs. O&quot;, an anthem of denial in 3/4 that recalls &quot;Hey Jupiter&quot; (one of Tori Amos&amp;#039;s strongest songs) in its main melody but outdoes Amos on absolutely every other level. The oblique horror of the verses (&quot;April trains may bring strange showers&quot;) gives way to the tragic swell of the chorus (&quot;The truth can&amp;#039;t save you now/ The sky is falling down&quot;). It is haunting, campy and, beyond all else, smart.\n\n&quot;Christopher Lydon&quot; is by all appearances a gag, and a clumsy one at that-- a lovelorn paean to the crusty NPR broadcaster who once ran for mayor of Boston. Miraculously, it manages to break your heart. &quot;Will&quot; is a sole studio cut-- an outtake from the upcoming album, recorded in New York with great producer Martin Bisi, who, having worked with the likes of Sonic Youth and Swans, knows better than to obscure Palmer&amp;#039;s voice or to dilute the simplicity of the setup: the big-studio version of the Dolls&amp;#039; sound involves a bare minimum of trickery. Bisi adds wisps of harmony vocal, an ambient bed and a couple of vintage effect touches to Palmer&amp;#039;s slowest and prettiest song. &quot;Will&quot; is clearly not a castoff but a strategic early unveiling: the pre-single single off a tentative album, by a band whose greatness is currently in previews.","torrent":{"xt":"urn:btih:ca90c151f0ea0fda5fd17a9e64ac3fe1925edfa4","amp;dn":"The+Dresdent+Dolls+-+A+Is+for+Accident","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ca90c151f0ea0fda5fd17a9e64ac3fe1925edfa4","infoHashBuffer":{"type":"Buffer","data":[202,144,193,81,240,234,15,218,95,209,122,158,100,172,63,225,146,94,223,164]},"announce":[],"urlList":[]}}