{"title":"Duskers v1.0","uid":14648188,"size":96286164,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:cb4bcbdbf63fac1cfef7bc48decaecd54c0819e1&amp;dn=Duskers+v1.0&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dauphong","files":1,"time":1463609076,"description":"About This Game\r\nIn Duskers you pilot drones into derelict spaceships to find the means to survive and piece together how the universe became a giant graveyard.\r\nExplore\r\nYou are a drone operator, surrounded by old gritty tech that acts as your only eyes and ears to the outside world. What you hear comes through a remote microphone. What you see is how each drone sees the world. Motion sensors tell you something's out there, but not what. And when you issue commands, you do it through a command line interface.\r\nAdapt\r\nYou have to earn everything in Duskers, scavenging drone upgrades, drones, and even ship upgrades. But dangerous creatures lurk in these derelict ships, and weapons are rare, so you may need to think of a clever way to explore a military outpost using only a motion sensor and a lure.\r\nBut even if you find a way, the sensor that you rely on may break down, or you may run out of lures, even your drone's camera feed can start to fail. A favorite strategy can't be exploited for long, so you'll have to continually adapt.\r\nSurvive\r\nDuskers is set in a procedurally generated Universe, and when you die you lose everything. You not only need to worry about what hazards lay waiting for you in the derelicts, but also running out of fuel, or parts to modify your drones and ship.\r\nYou are alone, isolated in the dark reaches of space. Only by sifting through what ship logs remain un-corrupted can you piece together what happened.\r\n\r\nFeatures\r\n- Use a Command Line Interface to control drones &amp; ship systems\r\n- Explore procedurally generated derelict ships and universe\r\n- Upgrade and modify drones with the salvage you find\r\n- Discover ship logs and piece together what happened","torrent":{"xt":"urn:btih:cb4bcbdbf63fac1cfef7bc48decaecd54c0819e1","amp;dn":"Duskers+v1.0","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cb4bcbdbf63fac1cfef7bc48decaecd54c0819e1","infoHashBuffer":{"type":"Buffer","data":[203,75,203,219,246,63,172,28,254,247,188,72,222,202,236,213,76,8,25,225]},"announce":[],"urlList":[]}}