{"title":"Nova - The Bible's Buried Secrets","uid":4605816,"size":1153011712,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:cc463b79379b6609767cc9ed3ffc07fb9206912c&amp;dn=Nova+-+The+Bible%5C%27s+Buried+Secrets&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"godking","files":1,"time":1230424158,"description":" &lt;a href=&quot;http://www.pbs.org/wgbh/nova/bible/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.pbs.org/wgbh/nova/bible/&lt;/a&gt;\n\nTaken from IMDB, where the user &quot;Classicalsteve&quot; does a fantastic job of describing this work, thus saving me the trouble:\n\nNOVA again hits it out of the ballpark with an outstanding exploration of how archeology can help sift through the ancient history of the Hebrew Scriptures, aka the Old Testament, and Hebrew/Jewish tradition. Several of the conclusions are quite startling in which both archeology and tradition corroborate each other in some instances and contradict each other in several unexpected circumstances. The documentary presents time lines to show where the Bible references particular events and periods and where the archaeological evidence places those same events and periods. Simultaneously, it is also a kind of treasure hunt for the origins of the Bible. It sets out to answer the questions of who wrote and who re-wrote the Old Testament, and when was it written. And how did the idea of monotheism, the worship of one God, originate. \n\nFor example, according to the documentary's presentation of the archaeological evidence, Israelites and Canaanites were not completely separate people who were always adversarial. By literally sifting through the sands of time at archaeological digs, it has been proved that Israelites were in fact of Canaanite origin. Canaanites who became Israelites splintered off after some kind of rebellion in a major Canaanite urban center. It is hypothesized that this splinter group and another group of Canaanite slaves from Egypt (hence the Moses story of Exodus) may have joined to become the first Israelites. No archaeological evidence has ever been found to corroborate the mass exodus as described in the Pentateuch (i.e the first five books of the Old Testament, aka The Book of Moses). How these scholar-archaeologists piece together the evidence is truly amazing through the discovery of similarities between Canaanite language and culture with Hebrew language and culture.\n\nSimultaneously, through painstaking research, the excavation of a large fortress and palace in the oldest area of Jerusalem, and the excavation of other sites and artifacts, scholars confirm the existences of King David and King Solomon. They determine most of the buildings of these structures probably occurred under Solomon around the 10th century. This is generally consistent with Biblical tradition and texts. However, it appears that many groups of Israelites practiced both polytheism and idol worship during a much longer stretch of history than previously believed. This is proved through excavations of carved idols in known ancient Hebrew/Israelite households dating from 700 to 1000 years before the time of Jesus of Nazareth. This does not corroborate with Judeo-Christian tradition which contends that Moses stopped his people from idol worship after the destruction of the Fatted Calf and God's bequeathal of the Ten Commandments.\n\nThey also distinguish between the several writers or scribes of biblical texts, determining that several different hands composed the Bible at different times, sometimes centuries apart. Through research, they determine that certain writers had particular conventions. For example, one scribe uses the more sacred name of God, Yaweh, while another uses the more familiar name Elohim for God. Another &quot;revelation&quot; is that the Bible that has been handed down to modern times is not the text as written supposedly over 3000 years ago, but in fact just a few hundred years before the time of Jesus. Circumcision was introduced at this time and was not practiced by the first Israelites, i.e. Abraham, which contradicts the older tradition.\n\nHowever, through an amazing piece of archaeological luck, they prove the existence of the Hebrew scriptures by at least 400 years before the writing of the Dead Seal Scrolls. An exemplary piece of both fact-finding and a survey of the origins of religious tradition. A fitting prequel to Frontline's From Jesus to Christ. ","torrent":{"xt":"urn:btih:cc463b79379b6609767cc9ed3ffc07fb9206912c","amp;dn":"Nova+-+The+Bible%5C%27s+Buried+Secrets","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cc463b79379b6609767cc9ed3ffc07fb9206912c","infoHashBuffer":{"type":"Buffer","data":[204,70,59,121,55,155,102,9,118,124,201,237,63,252,7,251,146,6,145,44]},"announce":[],"urlList":[]}}