{"title":"Back Door Slam - Roll Away (2007)","uid":4087679,"size":66324712,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:cd07fd8bcbbcdd7aeae15896dd51c63c2a4763a4&amp;dn=Back+Door+Slam+-+Roll+Away+%282007%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ToddPhilly","files":16,"time":1205904018,"description":"This is Back Door Slam&amp;#039;s debut album, &quot;Roll Away&quot; Released June 2007. Encoded as MP3 160 kbps via iTunes 7.5. Includes cover art. \n\nThe band will play Bonnaroo &amp;#039;08 Also see their videos on YouTube. \n\nMy first torrent - be kind if I screw up &lt;grin&gt; \n\nHailing from the United Kingdom s Isle of Man hardly a bastion for the blues Back Door Slam is fronted by 20-year-old singer, songwriter and guitar prodigy Davy Knowles, and has already begun to develop a following in the U.S. via high profile performances at SXSW in Austin and the Beale Street Music Festival in Memphis. From the same Running Media Group management stable as multi-platinum Grammy nominee Corinne Bailey Rae, they recorded the album at the Isle of Man s DAM Studios with RMG s Dave Armstrong producing.\n\nOne of the season s most compelling debuts, ROLL AWAY finds Back Door Slam displaying its powers of what has been described as &quot;Back To The Future Blues&quot; on a diverse program of tough rockers, moving ballads and cleanly executed blues. Highlights include the guitar-driven opener Come Home, the dark Albert King-styled Heavy on My Mind, rock-funk groover Takes a Real Man, and the album s one cover song, the highly-charged Outside Woman Blues. Too Good for Me is a quiet, change-of-pace piece featuring mandolin and guitar; it is more folk than blues, more Bruce Springsteen than Stevie Ray Vaughan. Stay is a powerful paean to a fallen comrade (the band s original rhythm guitarist, Brian Garvey, killed in an auto accident in 2004), while the title song, a reflective, largely acoustic track with Celtic overtones, deals with a young man s love of his safe, idyllic home and his need to break away for the uncertainties of the world beyond.\n\nBack Door Slam s name comes from the Robert Cray blues classic, and Cray s influence and that of other blues greats like Eric Clapton, John Mayall, Rory Gallagher, early Fleetwood Mac plus the late Stevie Ray Vaughan imbues their intoxicating, guitar-driven sound. Knowles, who also writes most of the songs, first picked up the guitar at age 11 after hearing Dire Straits Sultans of Swing on his father s cassette. Skipping the usual three-chord songbook approach to learning the instrument, he taught himself to play the classic song in its entirety and, in doing so, also discovered his destiny.\nAfter hearing Back Door Slam at SXSW in March, 2007, Patrick MacDonald wrote in the Seattle Times: I heard the spirit of Jimi Hendrix coming from the open, streetside windows of a joint called B.D. Riley&amp;#039;s. It was Red House, executed superbly by a surprisingly young trio called Back Door Slam, from the Isle of Man in the U.K. The club was packed and so was the street outside. Folks were transfixed by this kid on guitar, who played with a fiery spirit and sang with conviction, making the song his own.","torrent":{"xt":"urn:btih:cd07fd8bcbbcdd7aeae15896dd51c63c2a4763a4","amp;dn":"Back+Door+Slam+-+Roll+Away+%282007%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cd07fd8bcbbcdd7aeae15896dd51c63c2a4763a4","infoHashBuffer":{"type":"Buffer","data":[205,7,253,139,203,188,221,122,234,225,88,150,221,81,198,60,42,71,99,164]},"announce":[],"urlList":[]}}