{"title":"THE ULTIMATE RAMBO BOXSET IN H.264 BY+WINKER","uid":5240186,"size":3779502806,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:cdff6d2cf85b1d9ed8f9f40e0bdda132d17ebdcc&amp;dn=THE+ULTIMATE+RAMBO+BOXSET+IN+H.264+BY%2BWINKER&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"alanwatson","files":13,"time":1261727621,"description":"my internet will be down between 6pm and 8pm each night\n\n\nThis special edition box set features all four Rambo films!\n\nRambo: First Blood (Dir. Ted Kotcheff, 1982): He never fought a battle he couldn't win - except the conflict raging within his soul. Academy Award-nominee Sylvester Stallone stars as war hero John Rambo. An ex-Green Beret haunted by memories of Vietnam, he was once the perfect killing machine. Now he's searching for peace, but finds instead an over-zealous, small-town sheriff who's spoiling for a fight. All hell breaks loose when an unjustly imprisoned Rambo escapes and becomes the target of a massive manhunt. Now he must use his cunning, combat skills, and weapons training to stay alive and outwit his pursuers. Co-starring Brian Dennehy and Richard Crenna, First Blood is an explosive action-thriller that will keep you on the edge of your seat until the final, powerful frame. This pulse-pounding saga has been digitally remastered and contains an exciting featurette, First Blood: A Look Back.\n\nRambo: First Blood Part II (Dir. George P. Cosmatos, 1985): He's back! Superstar Sylvester Stallone is John Rambo, the ultimate action hero, in this explosive Oscar-nominated sequel to First Blood that boasts a riveting screenplay by Stallone and James Cameron (Titanic). Although the Vietnam War is officially over, Rambo remains the perfect fighting machine. But his survival skills are tested with a vengeance on a top-secret mission that takes him back to the jungles of Vietnam in search of American POW's. For when Rambo is double-crossed, this &quot;expendable&quot; hero, armed with just his bow, arrows and knife, must defeat savage enemies equipped with deadly firepower. Co-starring Richard Crenna and Charles Napier, Rambo: First Blood Part II is a must for every action-adventure fan! This adrenaline-charged tale has been digitally remastered and contains exciting, behind-the-scenes footage in the newly produced documentary An American Hero's Journey.\n\nRambo III (Dir. Peter MacDonald, 1988): The battle rages on as superstar Sylvester Stallone detonates the third and most explosive blast in the action-packed Rambo trilogy. Combat has taken its toll on John Rambo (Stallone), but he has finally begun to find inner peace inside a monastery - until his friend and mentor Col. Sam Trautman (Richard Crenna) shows up to ask for his help on a top-secret mission to Afghanistan. A war-weary Rambo declines, but when Trautman is captured, Rambo erupts into a one-man firestorm to rescue his former commanding officer and deciminate the enemy. It's an intense, pulse-pounding adventure that boasts unrelenting action and suspense from start to finish! Digitally remastered, Rambo III contains an exciting featurette, Rambo III: Full Circle.\n\nRambo (Dir. Sylvester Stallone, 2008: Twenty years after the last film in the series, John Rambo (Sylvester Stallone) has retreated to northern Thailand, where he's running a longboat on the Salween River. On the nearby Thai-Burma (Myanmar) border, the world's longest-running civil war, the Burmese-Karen conflict, rages into its 60th year.\n\nA group of human rights missionaries search out the &quot;American river guide&quot; John Rambo and ask him to guide them up the Salween and drop them off, so they can deliver medical supplies\nand food to the Karen tribe. After initially refusing to cross into Burma, Rambo takes them and drops them off close to one of the Karen villages.\n\nLess than two weeks later, he receives a visit from a pastor tellng him the aid workers did not return and the embassies will not help to locate them.The pastor has hired mercenaries to free the missionaries and needs Rambo's help...","torrent":{"xt":"urn:btih:cdff6d2cf85b1d9ed8f9f40e0bdda132d17ebdcc","amp;dn":"THE+ULTIMATE+RAMBO+BOXSET+IN+H.264+BY%2BWINKER","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cdff6d2cf85b1d9ed8f9f40e0bdda132d17ebdcc","infoHashBuffer":{"type":"Buffer","data":[205,255,109,44,248,91,29,158,216,249,244,14,11,221,161,50,209,126,189,204]},"announce":[],"urlList":[]}}