{"title":"Secret Societies - 08 - The New Atlantis &amp; Riddles in Stone","uid":13281402,"size":4124831929,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:ceb753a1826d394541946efab891462be59bddcb&amp;dn=Secret+Societies+-+08+-+The+New+Atlantis+%26amp%3B+Riddles+in+Stone&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"POtHS11","files":24,"time":1453496011,"description":"SECRET MYSTERIES OF AMERICA'S BEGINNINGS - The New Atlantis (Size: 329.02 MB)\r\n \t\tSecret Mysteries of America's Beginnings I - The New Atlantis.ogg\t \r\n \r\n\r\nThe New AtlantisHave you ever wondered why President Bush ordered American forces to invade Iraq and Afghanistan?\r\n\r\nSecret Mysteries of America's Beginnings unfolds the fascinating history behind the founding of America, and exposes the esoteric underbelly of its design. Why is Washington, D.C. built on the 77th Meridian? Are the Revolutionary War cities really built in perfect alignment with Stonehenge? If America was founded as a Christian nation, why are many of its symbols based on Pagan traditions? There is no doubt that much of America's national heritage was Christian, but just as a coin has two sides, our national heritage has a second side - one based squarely on occult secret societies and their values.\r\n\r\nTo find the answer to these questions, we follow the journey of secret societies from England to the New World and learn of their ancient hope: to rebuild the lost empire of Atlantis.\r\n\r\nIn the 16th century, Sir Francis Bacon was at the helm of the secret societies in England. When Bacon penned his classic work, &quot;The New Atlantis&quot; he believed that America and Atlantis were one and the same. He outlined his vision for the perfect society, and some suggest the program he set forth has been the driving force behind the course of modern history. While he did not originate the concept, it was Bacon who articulated an ancient plan to be carried out by all the secret orders. \r\n\r\n\r\n&quot;Riddles In Stone: \r\n\r\nSecret Architecture of Washington, D.C.&quot;, will continue to explore the fascinating history behind the origins and focus of the world's most powerful nation: America. Why was this nation founded? How was the precise location of Washington, D.C., determined? What is the meaning of the seemingly countless occult images in our nation's capitol? Volume II zeroes in on the Masonic &amp; Rosicrucian influence so prevalent amongst our Founding Fathers as they planned, and began to implement, the layout of America's Capitol. For years, extreme controversy has abounded as to the exact meaning of the occult symbols found within the street layout, the buildings, and the monuments of Washington, D.C. Is there really an inverted Pentagram formed by the street layout just north of the White House? We have discovered the esoteric reason why this Pentagram is missing one segment. Was this city laid out to reflect the vision of a Masonic Christ foreseen by Sir Francis Bacon? Is it true that America's capitol was laid out &quot;according to the stars&quot;, i.e., in the astrological shapes of certain planets and stars so revered by occultists? Why did our Masonic Founding Fathers perform &quot;Corn, Wine, and Oil&quot; ceremonies at cornerstone layings and at the dedication of the finished structure? Does this occult &quot;wisdom&quot; represent the interests of America, or a hidden agenda? As with Volume I, this &quot;Secret Mysteries&quot; series will continue to explore current -- and possibly future -- events by examining America's past. What can these realities mean for the unfolding destiny of America and the world? Now you will know that, when President Bush said he was fulfilling the &quot;Ancient Hope&quot; of the &quot;New Order of the Ages&quot; (as we show in Volume I), he was merely acting out the plan reflected in the street layout and in the architecture of Washington, D.C. 3 hour video","torrent":{"xt":"urn:btih:ceb753a1826d394541946efab891462be59bddcb","amp;dn":"Secret+Societies+-+08+-+The+New+Atlantis+%26amp%3B+Riddles+in+Stone","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ceb753a1826d394541946efab891462be59bddcb","infoHashBuffer":{"type":"Buffer","data":[206,183,83,161,130,109,57,69,65,148,110,250,184,145,70,43,229,155,221,203]},"announce":[],"urlList":[]}}