{"title":"In the Land of Invisible Women: A Female Doctor's Journey in the","uid":8352382,"size":2670031,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ceedc3fcb1e517821b926b7dfa5585ae7bf4583f&amp;dn=In+the+Land+of+Invisible+Women%3A+A+Female+Doctor%27s+Journey+in+the&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mdusanjay","files":-1,"time":1365380602,"description":"Qanta Ahmed, &quot;In the Land of Invisible Women: A Female Doctor's Journey in the Saudi Kingdom&quot;\nEnglish | 2008 | ISBN: 1402210876 | 464 pages | EPUB | 2.55 MB\n\n&quot;In this stunningly written book, a Western trained Muslim doctor brings alive what it means for a woman to live in the Saudi Kingdom. I've rarely experienced so vividly the shunning and shaming, racism and anti-Semitism, but the surprise is how Dr. Ahmed also finds tenderness at the tattered edges of extremism, and a life-changing pilgrimage back to her Muslim faith.&quot; - Gail Sheehy\n\nThe decisions that change your life are often the most impulsive ones.\n\nUnexpectedly denied a visa to remain in the United States, Qanta Ahmed, a young British Muslim doctor, becomes an outcast in motion. On a whim, she accepts an exciting position in Saudi Arabia. This is not just a new job; this is a chance at adventure in an exotic land she thinks she understands, a place she hopes she will belong.\n\nWhat she discovers is vastly different. The Kingdom is a world apart, a land of unparralled contrast. She finds rejection and scorn in the places she believed would most embrace her, but also humor, honesty, loyalty and love.\n\nAnd for Qanta, more than anything, it is a land of opportunity. A place where she discovers what it takes for one woman to recreate herself in the land of invisible women.","torrent":{"xt":"urn:btih:ceedc3fcb1e517821b926b7dfa5585ae7bf4583f","amp;dn":"In+the+Land+of+Invisible+Women%3A+A+Female+Doctor%27s+Journey+in+the","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ceedc3fcb1e517821b926b7dfa5585ae7bf4583f","infoHashBuffer":{"type":"Buffer","data":[206,237,195,252,177,229,23,130,27,146,107,125,250,85,133,174,123,244,88,63]},"announce":[],"urlList":[]}}