{"title":"Standup Comedy - Kyle Cease - One Dimple","uid":4319869,"size":47065977,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:cf9a08618aa7eb9946f994fa17850912184dcca3&amp;dn=Standup+Comedy+-+Kyle+Cease+-+One+Dimple&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"rambam1776","files":16,"time":1217371110,"description":"I finally got an invitation to join Demonoid, where my Google searches for torrents I cannot find here keep showing great stuff. I spent all last week grabbing comedy albums which I am now going to upload here. Other than going to the trouble of fixing tags and getting artwork and details, these torrents are as the original posters seeded them. I am not endorsing or recommending all of these. In fact, I think some of them suck. However, there is a major lack of well seeded comedy torrents here, and I hope to encourage more people to post new ones. Also, who says *MY* taste matches somebody elses? The reviews are from ALLMUSIC or from AMAZON. As usual, much thanks to the OPs who put these out and about.\n\nRambam1776\n\n\n\nKYLE CEASE ? ONE DIMPLE\n\n\nBiography\tby David Jeffries\nAn irreverent, quirky standup comedian from Seattle, Kyle Cease began headlining comedy clubs at 18, making him one of the youngest headliners in America. Performing in front of his classmates since the age of seven helped him gain the confidence he needed, but it was his sharp, sometimes bizarre material and lively delivery that had club owners willing to take such a risk on a young main attraction. By 21 he was touring nationally and had landed his first acting gig, playing the memorable Bogey Lowenstein in the hit film 10 Things I Hate About You. The film&amp;#039;s success influenced Cease to make the move to Los Angeles, where he would work the local standup scene hard, catching the eye of the Comedy Central cable network along the way. After appearing in the 2001 film Not Another Teen Movie, he made his Comedy Central debut on the network&amp;#039;s standup revue series Premium Blend. In 2006 he landed his own special on the network, Comedy Central Presents: Kyle Cease, and released his first album, One Dimple, on Comedy Central Records. \n\n\nReview\tby David Jeffries\nStandup comedian Kyle Cease became a hit with the nostalgic geek squad in early 2006 when his &quot;Generation Nintendo&quot; routine became the hot MP3/video to forward. Remembering the good old days when you&amp;#039;d have to blow into the cartridge to get Super Mario Brothers to play on your slowly dying, always buggy machine, &quot;Generation Nintendo&quot; is Cease&amp;#039;s masterwork as it hilariously flows from two button controllers to how Sunny Delight tasted like a blend of orange juice and baby medicine. Cease makes another Sunny D analogy that&amp;#039;s funny, gross, and not good for repeating in mixed company, and if you can&amp;#039;t stand a little trash with your wit, you better steer clear. He may dip into scatological humor, but he doesn&amp;#039;t use it as a crutch, and in the end he comes off as a cross between Dane Cook and Adam Sandler, just as hyper as the former and willing to get as obtuse as the latter. His &quot;My Weird Jokes&quot; is truly weird but it warrants repeat listenings and gets funnier with every return. The first couple tracks are clever as Cease talks about CD players counting up tracks ? watch your display, pretty cool ? and his whole set flows well, becoming looser and more rewarding as things progress. Cook fans, Sandler addicts, and anyone looking for a new irreverent oddball to latch onto should check it. [One Dimple was initially released with a bonus DVD featuring Cease&amp;#039;s appearance on Comedy Central&amp;#039;s Premium Blend and a tour documentary.] \n &lt;a href=&quot;\nhttp://allmusic.com/cg/amg.dll?p=amg&amp;sql=10:3xfpxqldldde&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://allmusic.com/cg/amg.dll?p=amg&amp;sql=10:3xfpxqldldde&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:cf9a08618aa7eb9946f994fa17850912184dcca3","amp;dn":"Standup+Comedy+-+Kyle+Cease+-+One+Dimple","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cf9a08618aa7eb9946f994fa17850912184dcca3","infoHashBuffer":{"type":"Buffer","data":[207,154,8,97,138,167,235,153,70,249,148,250,23,133,9,18,24,77,204,163]},"announce":[],"urlList":[]}}