{"title":"Heart - Break [promo].VOB","uid":8908159,"size":92123136,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:d0c7ee70fdf63a3096c993ed931f65debab43e16&amp;dn=Heart+-+Break+%5Bpromo%5D.VOB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SgtRlee","files":-1,"time":1378955080,"description":"Heart - Break [promo].VOB\n\n\nHQ very rare promo music video from a promo DVD. &quot;Break&quot; is a song from  Bebe le Strange, the fifth studio album by the American rock band Heart. It was released on February 14, 1980 through Epic Records. It was the first album without Roger Fisher on lead guitar, who left the band months prior. The album was a commercial success, peaking at number five on the U.S. Billboard 200 and staying in the charts for 22 weeks. It also was certified Gold by the RIAA. However it did not sell as well as their previous albums (which went Platinum and Multi-Platinum). The record contained the hit singles &quot;Even It Up&quot; (backed by the Tower of Power horns section) and the title track. Some of the backing vocals were provided by Don Wilhelm, who had been in a group called The Army with Steve Fossen and Roger Fisher in the 1960s. The album was re-released in an expanded edition in 2004. It contained two additional songs: A live version of Break and the studio outtake Jackleg Man.\n\nHeart is an American rock band which first found success in Canada and later in the United States and worldwide. Over the group's four-decade history, the band has had three primary lineups, with the constant center of the group since 1974 being sisters lead singer Ann Wilson and guitarist Nancy Wilson. Heart rose to fame in the mid-1970s with music influenced by hard rock and heavy metal as well as folk music. Their popularity declined in the early 1980s, but the band enjoyed a comeback starting in 1985 and experienced even greater success with album oriented rock (AOR) hits and hard rock ballads into the 1990s. With Jupiter's Darling (2004), Red Velvet Car (2010), and Fanatic (2012), Heart made a return to their hard rock and acoustic folk roots.\n\nTo date, Heart has sold over 30 million records worldwide, including over 22 million in album sales in the U.S. The group was ranked number 57 on VH1's &quot;100 Greatest Artists of Hard Rock&quot;. With Top 10 albums on the Billboard Album Chart in the 1970s, 1980s, 1990s, and 2010s, Heart is among the most commercially enduring hard rock bands in history. They were inducted into the Rock and Roll Hall of Fame in 2013.\n\nAt the Rock and Roll Hall of Fame induction ceremony on April 18, 2013, the original members of Heart (The Wilson Sisters, Howard Leese, Michael DeRosier, Steve Fossen, and Roger Fisher) reunited for the first time in 34 years to play &quot;Crazy on You&quot;. In addition, the modern version of Heart joined with fellow Seattlites Jerry Cantrell (Alice in Chains), Chris Cornell (Soundgarden), and Mike McCready (Pearl Jam) to play a version of the classic &quot;Barracuda&quot;.\n\nThe band was inducted by Chris Cornell.\n\nIn addition to their own recording careers, the Wilson sisters have played a role on the Seattle music scene. Among the artists that have used their Bad Animals Studio are Neil Young, R.E.M., Pearl Jam, Soundgarden and Alice in Chains.\n(video does not have any logos)\n\n\n    &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Bebe_le_Strange&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Bebe_le_Strange&lt;/a&gt; \n      &lt;a href=&quot;\nhttp://bayimg.com/JApIjAAEh&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/JApIjAAEh&lt;/a&gt; \n   \n\n\nFile properties info using Media Player Classic:     \n   Video: MPEG2 Video 720x480 (4:3) 29.97fps 6000kbps\n   Audio: Dolby Digital AC3 48000Hz stereo 192kbps\n   Duration: 00:02:33\n\n\n\n\n*Install the &quot;Media Player Classic&quot; player if you can't play this file, \nor for better visual and audio quality playback of all your videos. \nIt's 100% free to download and use. Latest stable build is v1.6.8\n\n*Media Player Classic Home Cinema*         &lt;a href=&quot;\nhttp://mpc-hc.sourceforge.net/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://mpc-hc.sourceforge.net/&lt;/a&gt; \n\nSgtRlee (Sgt.R.Lee) \n\t","torrent":{"xt":"urn:btih:d0c7ee70fdf63a3096c993ed931f65debab43e16","amp;dn":"Heart+-+Break+%5Bpromo%5D.VOB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d0c7ee70fdf63a3096c993ed931f65debab43e16","infoHashBuffer":{"type":"Buffer","data":[208,199,238,112,253,246,58,48,150,201,147,237,147,31,101,222,186,180,62,22]},"announce":[],"urlList":[]}}