{"title":"Marvel 1997 October","uid":4289409,"size":877277652,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:d1881fd56be68ccd7f6f622e6830858b940e9e39&amp;dn=Marvel+1997+October&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"MarvChronoCoop","files":59,"time":1215849599,"description":"Marvel October 1997\nTorrent Release Notes\n\nThis torrent contains comics published by Marvel with a cover date of October 1997 (all of which were released in August 1997).\n\nThere were no new ongoing series or miniseries introduced this month. One-shots hitting the racks for the first time were: Colossus and Doctor Strange: What Is It That Disturbs You, Stephen?. Finishing their runs were: Untold Tales of Spider-Man with issue 25, Daydreamers (3), Conan Stalker of the Woods (3), Hercules and the Heart of Chaos (3) and Venom - Sign of the Boss (2).\n\nDr. Strange: What Is It That Disturbs You, Stephen? by P. Craig Russell and Marc Andreyko was nominated for the Best Graphic Album of Original Work Harvey award. Thunderbolts 007 is one of the issues for which Kurt Busiek won the 1998 Harvey award for Best Writer.  James Robinson was nominated for the same award for work including the issue of Cable found here. Mark Waid&amp;#039;s work on Ka-Zar was part of his nomination, also for Best Writer. Tim Townsend got a nomination for Best Inker for work including this month&amp;#039;s issue of Uncanny X-Men.  Comicraft got a Best Lettering nomination for work including this edition of Avengers.  And finally, Joe Kelly was nominated as Best New Talent for his work including these issues of Daredevil and Deadpool.\n\nThis month there are fill sub-directories for August and September as well as one for bonus material.  The bonus folder contains items encountered while compiling the collection that don&amp;#039;t belong in the main set. The August 1997 fill folder contains a 3D version of the Gen13 Generation X crossover that was released the month after the 2D version.  The September directory contains an upgraded version of Amazing Spider-Man Annual 1997 which  replaces the issue incorrectly named Spider-Man Annual 1997 in the September torrent, as well as a copy of the missing Maverick 1.  The Thundercats Annual &amp;#039;97 in the September release was actually supposed to be a fill for the August torrent.  After you finish seeding September, you might want to move it to the proper month (August).  Sorry for the inconvenience.\n\nAvailable issues from all Marvel imprints (including Marvel UK) will be included in this and future releases.  The ongoing Marvel Dr. Who magazine for September (255) is only available as a partial scan of just the comic portion of the book.  It is included here.\n\nThese are the October Marvel titles missing from the collection:\n\n    * The Return of the Amalgam Age of Comics: The Marvel Comics Collection TPB (reprint)\n    * Clandestine vs X-Men (TPB) (reprint)\n    * Squadron Supreme (TPB) (reprint)\n\n\nFrom the Panini Reprint line (UK)\n\n    * Astonishing Spider-Man 27\n    * Essential X-Men 27 \n\n\nThis month Marvel had 8 of the top 10 selling books (15 of 25), although Image&amp;#039;s Spawn was number one.  Marvel was the market leader again with 35.75% of books ordered and 32.58% of revenue.  Their chapter 11 saga continued.\n\nFrom the soapbox:\n\nStan reminisced over his sorrow at the death of Gwen Stacy, agreeing it was the one thing other writers had done to his characters that he regretted.\n\nIn the news for October 1997:\nMARVEL ENTERTAINMENT: Toy Biz Wants to Combine Businesses\n---------------------------------------------------------\nToy Biz, Inc., says it has proposed a plan for the combination of its business with Marvel Entertainment Group, Inc.  The plan put forward by Toy Biz would result in the merger of Toy Biz and Marvel (except for the Panini subsidiary), and Marvel?s senior secured lenders would receive about $230 million in cash and securities equal to a 40 percent stake in the new company, together with the proceeds from the sale of Panini.\n\nJoseph Ahearn, Toy Biz CEO, stated, &quot;We believe that this proposal represents an opportunity for both Toy Biz stockholders as well as Marvel creditors and stockholders to participate in a meaningful way in a combined Marvel/Toy Bizon terms that we believe should be acceptable to all parties involved.\n\nAccording to a Marvel spokesperson, the company has not yet received any proposal nor has it had any discussions with Toy Biz about a proposal.  Marvel said it is highly skeptical of the proposal, given Toy Biz&amp;#039;s track record of abandoning three prior agreements-in-principle on this matter.\n\nA few notes on how this was compiled: It started with fordor&amp;#039;s collection for the month (thank you fordor). Each issue was checked for errors, cover date and completeness. Filenames were altered accordingly and normalized. Where possible, scans from the Official Marvel DVD set replaced the earlier versions (thank you Citaltras).\n\nA general search was made to locate either higher quality or c2c scans for all comics issued during the month.  Searches were performed at Comic Book DB, at The Unofficial Handbook of Marvel Comics Creators and at CBDB to identify any books not in the collection. Diamond sales data, Marvel Age and/or Marvel Visions were also reviewed when available. Copies of the available issues were added to the collection.  Not all titles are issued with cover dates.  Undated books were added into the torrent containing cover-dated books released in the same month.  The proto-torrent was then made available to a group of editors and reviewers for comment and any resulting issues were addressed.\n\nFrom the MCC Mailbag:\nAlthough time constraints prevent responding individually to comments and PMs, thank you for all the supportive words and messages, they are very much appreciated. Here are answers to the questions received since the last posting.\n\nWhen are you going to release the 1979-89 chronology?  The short answer is:  when they are ready, which should be relatively soon.  1998 will follow 1997, but 1979 may be interleaved or released simultaneously depending on verification progress.\n\nAnd now, a few standing requests:\n\n    * If you have any interesting Marvel related information for a particular month in time, please PM the details. It may be included in a future torrent release notes issue.\n    * If you locate a better quality scan of any issue, or when you find one of the errors, please send a PM with a pointer so it can be fixed in a future release.\n    * If you have (or know where to find) any of the Marvel online cybercomics (originally an AOL exclusive) from the late 90s, please make them available to the community (either through this project or as an independent posting).\n\n\nThe Marvel Chronology Cooperative greatly appreciates all thanks and other comments, but politely requests the content of said comments be related specifically to the torrent, and not the habits, character, generosity or judgment of any individual/group/website.\n\nA sincere thank you is owed to the legion of writers, artists, scanners, &amp; uploaders who made this possible. And to you, the downloader:\n\nThank you, Good Night and Good Luck\n\nNext up: November 1997.\n","torrent":{"xt":"urn:btih:d1881fd56be68ccd7f6f622e6830858b940e9e39","amp;dn":"Marvel+1997+October","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d1881fd56be68ccd7f6f622e6830858b940e9e39","infoHashBuffer":{"type":"Buffer","data":[209,136,31,213,107,230,140,205,127,111,98,46,104,48,133,139,148,14,158,57]},"announce":[],"urlList":[]}}