{"title":"Mark Danielewski - House of Leaves","uid":4927358,"size":371830644,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d1b4b2cc14020f050383d7ab9a5fa23534d3e568&amp;dn=Mark+Danielewski+-+House+of+Leaves&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"weisjohn","files":2,"time":1243894606,"description":"House of Leaves (Paperback)\nby Mark Z. Danielewski\n\n# Paperback: 709 pages\n# Publisher: Pantheon; 2nd edition (March 7, 2000)\n# Language: English\n# ISBN-10: 0375703764\n# ISBN-13: 978-0375703768\n\n\nUploader's notes:\n\nThe PDF you are going to download is made after scanning each page at 300DPI.\nPages containing colors were scanned in color mode, so these page have a yellowish look compared to the pages scaned in greyscale mode.\n\nAfter several attempts at performing OCR on the book, I have decided against it, the reasons being several:\n\n1. Some pages have intentional spelling errors, &quot;fake&quot; defects, dots and signs that may be lost at OCR\n2. There are a lot of pages where text is upside down, written verticaly or diagonally and this is part of the book\n\nIf you wish to try your luck at OCRing the book, you should be able to export each page to BMP and try.\n\n\nI have spent several days at scanning this book so a thanks will go a long way in motivating me to upload future books.\n\n\n- end of Uploader's notes -\n\n\nAmazon.com Sales Rank: #1,700 in Books (See Bestsellers in Books)\n\nPopular in these categories: (What's this?)\n#32 in \t Books &gt; Literature &amp; Fiction &gt; Genre Fiction &gt; Horror\n#82 in \t Books &gt; Literature &amp; Fiction &gt; Literary\n\n\nCustomer Reviews\n\n578 Reviews\n5 star: \t49% \t (284)\n4 star: \t21% \t (123)\n3 star: \t11% \t (66)\n2 star: \t6% \t (36)\n1 star: \t11% \t (69)\n \t\n \nAverage Customer Review  [**** ] (578 customer reviews) \n\nEditorial Reviews\n\nAmazon.com Review\nHad The Blair Witch Project been a book instead of a film, and had it been written by, say, Nabokov at his most playful, revised by Stephen King at his most cerebral, and typeset by the futurist editors of Blast at their most avant-garde, the result might have been something like House of Leaves. Mark Z. Danielewski's first novel has a lot going on: notably the discovery of a pseudoacademic monograph called The Navidson Record, written by a blind man named ZampanÃƒÅ¡, about a nonexistent documentary film--which itself is about a photojournalist who finds a house that has supernatural, surreal qualities. (The inner dimensions, for example, are measurably larger than the outer ones.) In addition to this Russian-doll layering of narrators, Danielewski packs in poems, scientific lists, collages, Polaroids, appendices of fake correspondence and &quot;various quotes,&quot; single lines of prose placed any which way on the page, crossed-out passages, and so on.\n\nNow that we've reached the post-postmodern era, presumably there's nobody left who needs liberating from the strictures of conventional fiction. So apart from its narrative high jinks, what does House of Leaves have to offer? According to Johnny Truant, the tattoo-shop apprentice who discovers ZampanÃƒÅ¡'s work, once you read The Navidson Record,\nFor some reason, you will no longer be the person you believed you once were. You'll detect slow and subtle shifts going on all around you, more importantly shifts in you. Worse, you'll realize it's always been shifting, like a shimmer of sorts, a vast shimmer, only dark like a room. But you won't understand why or how. \nWe'll have to take his word for it, however. As it's presented here, the description of the spooky film isn't continuous enough to have much scare power. Instead, we're pulled back into Johnny Truant's world through his footnotes, which he uses to discharge everything in his head, including the discovery of the manuscript, his encounters with people who knew ZampanÃƒÅ¡, and his own battles with drugs, sex, ennui, and a vague evil force. If The Navidson Record is a mad professor lecturing on the supernatural with rational-seeming conviction, Truant's footnotes are the manic student in the back of the auditorium, wigged out and furiously scribbling whoa-dude notes about life.\nDespite his flaws, Truant is an appealingly earnest amateur editor--finding translators, tracking down sources, pointing out incongruities. Danielewski takes an academic's--or ex-academic's--glee in footnotes (the similarity to David Foster Wallace is almost too obvious to mention), as well as other bogus ivory-tower trappings such as interviews with celebrity scholars like Camille Paglia and Harold Bloom. And he stuffs highbrow and pop-culture references (and parodies) into the novel with the enthusiasm of an anarchist filling a pipe bomb with bits of junk metal. House of Leaves may not be the prettiest or most coherent collection, but if you're trying to blow stuff up, who cares? --John Ponyicsanyi\n\nFrom Publishers Weekly\n\nDanielewski's eccentric and sometimes brilliant debut novel is really two novels, hooked together by the Nabokovian trick of running one narrative in footnotes to the other. One-the horror story-is a tour-de-force. Zampano, a blind Angelino recluse, dies, leaving behind the notes to a manuscript that's an account of a film called The Navidson Report. In the Report, Pulitzer Prize-winning news photographer Will Navidson and his girlfriend move with their two children to a house in an unnamed Virginia town in an attempt to save their relationship. One day, Will discovers that the interior of the house measures more than its exterior. More ominously, a closet appears, then a hallway. Out of this intellectual paradox, Danielewski constructs a viscerally frightening experience. Will contacts a number of people, including explorer Holloway Roberts, who mounts an expedition with his two-man crew. They discover a vast stairway and countless halls. The whole structure occasionally groans, and the space reconfigures, driving Holloway into a murderous frenzy. The story of the house is stitched together from disparate accounts, until the experience becomes somewhat like stumbling into Borges's Library of Babel. This potentially cumbersome device actually enhances the horror of the tale, rather than distracting from it. Less successful, however, is the second story unfolding in footnotes, that of the manuscript's editor, (and the novel's narrator), Johnny Truant. Johnny, who discovered Zampano's body and took his papers, works in a tattoo parlor. He tracks down and beds most of the women who assisted Zampano in preparing his manuscript. But soon Johnny is crippled by panic attacks, bringing him close to psychosis. In the Truant sections, Danielewski attempts an Infinite Jest-like feat of ventriloquism, but where Wallace is a master of voices, Danielewski is not. His strength is parodying a certain academic tone and harnessing that to pop culture tropes. Nevertheless, the novel is a surreal palimpsest of terror and erudition, surely destined for cult status. (Mar.)\n\n\nFor Sale By Owner, June 16, 2001 By C. Fletcher (California) - See all my reviews\n\nI first heard of &quot;House of Leaves&quot; about a year ago on the Internet. Somebody said it was the best new horror novel they had read in years. Then when I started working at a bookstore in town, one of my new friends there told me it was the scariest book he had ever read.\n\nAll of this quite intrigued me. So I bought the book and read it over a period of about six months. It's not a quick read, or at least it wasn't for me. I had to have other, more normal, sane books going on at the same time. &quot;House of Leaves&quot; is over seven hundred pages long and it's loaded with literary detour signs, unespected landmines (some duds, some live), and good old &quot;holding the book upside down in a mirror so you can read the words printed that way&quot; fun.\n\n&quot;House of Leaves&quot; is a contortionist's daydream, and a conservative reader's nightmare. I fall somewhere in the middle of the spectrum and found myself admiring the new unhallowed ground Danielewski was breaking, but at other times longing for a more conventional, satisfying structure.\n\nThis whole thing is very postmodern. The house is aware of itself as a house, and the book is aware of itself as a book. There is a story of a family moving into a house, trying to sort out its interpersonal demons, and finding that the insides of things (lives, minds, houses) can often be darker, scarier, stranger, and more convoluted than they would appear from the outsides.\n\nThat alone would have made a great book, told with inventive language and a compelling psychological subtext.\n\nBut that's just the beginning, the backstory really. &quot;House of Leaves&quot; is a story inside a story inside a story, etc. In fact, it puts the dizzying structure of Mary Shelly's &quot;Frankenstein&quot; to shame.\n\nIn &quot;House of Leaves,&quot; there's a young guy named Johnny Truant who's acting as literary editor, presenting the compelling and disturbing scribblings and ramblings on an old man named Zampano. Zampano's papers, which are presented posthumously, recount, at times blow-for-blow, a documentary film called &quot;The Navidson Record&quot; of a family moving into a house which proves to be larger on the inside than it is on the outside.\n\nThere is also another editor above Johnny, who makes comments on top of Johnny's comments. Johnny finds himself wondering if the old man didn't just make up the whole story about the young family moving into the house, because Johnny is unable to find any corroborating scrap of proof that the film exists.\n\nOf course, add into the mix that Johnny is a self-admitted fibber and story teller extroidinaire. He tells us how much fun he has making up completely bogus stories for the benefit of strangers her meets in bars.\n\nKnowing this, the reader has to start to wonder if the old man, Zampano, even exists, or if he's just an invention of Johnny's. And if you follow that line of thinking too far, you might even start to wonder if the heavy black book you're holding exists.\n\nThis is the haunted house that's in the film that the old man made up and wrote about as if it were as real as he was, but who was really just a figment of the narrator's fertile imagination, the narrator that doesn't really exist, except on paper and in the reader's mind and imagination...so maybe none of it exists...or all of it does. Maybe the house has turned on its porch lights somewhere deep, deep inside of you, down all those twisting tunnels and swirling, dark echoing caves.\n\nMaybe there's a sign out front. &quot;For Sale By Owner.&quot; And under that, in small print, in French, upside down and backwards, &quot;Buyer Beware.&quot; \n\n\n\n","torrent":{"xt":"urn:btih:d1b4b2cc14020f050383d7ab9a5fa23534d3e568","amp;dn":"Mark+Danielewski+-+House+of+Leaves","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d1b4b2cc14020f050383d7ab9a5fa23534d3e568","infoHashBuffer":{"type":"Buffer","data":[209,180,178,204,20,2,15,5,3,131,215,171,154,95,162,53,52,211,229,104]},"announce":[],"urlList":[]}}