{"title":"The Noonday Demon - An Atlas of Depression","uid":4920704,"size":192508870,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:d23eea7a39c88fc45fa9dc61361dc31aab64664f&amp;dn=The+Noonday+Demon+-+An+Atlas+of+Depression&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"arzendiq","files":124,"time":1243642201,"description":"The Noonday Demon - An Atlas of Depression\nby Andrew Solomon\n\nWith uncommon, candor, wit, and erudition, National Book Award winner Andrew Solomon takes the listener on a journey of incomparable range and resonance into the most pervasive of family secrets.\n\nThe Noonday Demon examines depression in personal, cultural and scientific terms. Drawing on his own struggles with the illness and interviews with fellow sufferers, doctors and scientists, policymakers and politicians, drug designers and philosophers, Solomon reveals the subtle complexities and sheer agony of the disease. He confronts the challenge of defining the illness and describes the vast range of available medications, the efficacy of alternative treatments, and the impact the malady has had on various demographic populations around the world and throughout history. He also explores the thorny patch of moral and ethical questions posed by emerging biological explanations for mental illness.\n\nThe depth of human experience Solomon chronicles, the range of his intelligence, and his boundless curiosity and compassion will change the listener's view of the world.\n\nRead by the author. For more information, visit www.noondaydemon.com\n\n6 CDs, approx. 6.5 hours. 64kbps 44kHz mono Ogg Vorbis","torrent":{"xt":"urn:btih:d23eea7a39c88fc45fa9dc61361dc31aab64664f","amp;dn":"The+Noonday+Demon+-+An+Atlas+of+Depression","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d23eea7a39c88fc45fa9dc61361dc31aab64664f","infoHashBuffer":{"type":"Buffer","data":[210,62,234,122,57,200,143,196,95,169,220,97,54,29,195,26,171,100,102,79]},"announce":[],"urlList":[]}}