{"title":"Battlestar Galactica Razor Flashbacks webisodes v2 1080p","uid":10216319,"size":462029492,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:d2ea1fd9082e0df769284dc941d7ffce1cc136b3&amp;dn=Battlestar+Galactica+Razor+Flashbacks+webisodes+v2+1080p&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bsg4you","files":3,"time":1400971984,"description":"Battlestar.Galactica.Razor.Flashbacks.webisodes.v2.1080p.mkv\n\nTHIS IS THE SAME CONTENT AS VERSION1 JUST MUCH SMALLER WITH THE SAME QUALITY\n\nBattlestar Galactica Razor Flashbacks integrated fanedit with 1080p/480p source\nversion2 18min21sec Handbrake0.9.9 462,001,607bytes\nV: 2-Pass Encoding (Turbo first pass) Preset = 09 (very slow) 3000Kbps AVC\nA: 5.1 384Kbps AAC\n\nThis is a new encode of the final MPEG-2/AC3 fanedit of the Razor Flashbacks. The original was:\nversion1 Handbrake0.9.8 1,968,089,016bytes CRF21.5 13.6Mbps AVC, 5.1 448Kbps AC3\n\nThis new version2 was 2-pass encoded instead of using constant quality and the result is a much smaller file with no discernible visual or audible differences. Stills and video sections were carefully evaluated during the review but if *any* issue is detected please leave a comment with the timecode describing the issue so it can be addressed as soon as possible.\n\nThis fanedit is the Razor Flashbacks from Battlestar Galactica in a single 18minute 21second file formatted as a single episode. The source for this fanedit was the excellent Battlestar Galactica Blu-Ray set and used the 1080p/5.1 Razor (Unrated) movie and the 480p/2.0 Razor Flashbacks. Both the video and sound quality of the 480p Razor Flashbacks is much higher than The Resistance webisodes or the 360p deleted scenes from regular episodes. All of the Razor Flashbacks episodes 3, 4, 5, 6 and part of 7 are contained within the Razor (Unrated) movie which is 1080p with surround sound.\n\n00.00-02.30 Razor Flashbacks episode1 480p\n02.30-04.54 Razor Flashbacks episode2 480p\n04.54-15.08 Razor (Unrated) 1080p\n15.08-18.21 Razor Flashbacks episode7 480p\n\nEpisode7 only has 1minute 17 seconds of content, the rest is credits and the hilarious R&amp;D TV stinger at the very end:\n15.07-16.25 Razor Flashbacks episode7 flash forward to Galactica's decommissioning\n16.25-18.16 Razor Flashbacks credits\n18.16-18.20 R&amp;D TV stinger with David saying &quot;me, me, me ...&quot; and Ron pushing his stomach in and saying &quot;big head&quot;\n\nChanges:\n* hid the &quot;TO BE CONTINUED&quot; text overlays and removed the associated sound effects at the end of episode 1 and episode 2\n* removed the episode 2 establishing shot of an exterior zoom into Galactica\n* left the very funny R&amp;D stinger from the very end of episode 7 after the credits; this R&amp;D stinger wasn't used at the end of any normal episodes so it's a bit of an Easter Egg\n\nNote: The webisodes are stereo 2.0 and the Razor (Unrated) material is surround 5.1. The final file is mastered as 5.1 and the sound levels sound about right with surround speakers but listening with just stereo speakers might make the webisodes sound a bit louder than the movie portion. If the video player has a speaker setting, be sure to set it to 2.0 if you only have stereo speakers.\n\nPlease check out other Battlestar Galactica posts plus Rifftrax, Star Trek Enterprise, DC Comics, documentaries and more at:\n &lt;a href=&quot; https://thepiratebay.se/user/bsg4you/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; https://thepiratebay.se/user/bsg4you/&lt;/a&gt;  \nand leave any corrections, criticism, comments and requests.\n\nThanks, bsg4you","torrent":{"xt":"urn:btih:d2ea1fd9082e0df769284dc941d7ffce1cc136b3","amp;dn":"Battlestar+Galactica+Razor+Flashbacks+webisodes+v2+1080p","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d2ea1fd9082e0df769284dc941d7ffce1cc136b3","infoHashBuffer":{"type":"Buffer","data":[210,234,31,217,8,46,13,247,105,40,77,201,65,215,255,206,28,193,54,179]},"announce":[],"urlList":[]}}