{"title":"POtHS - SNR - UFOs Angels Spirits Witches and Demons Vol 66 - De","uid":10125179,"size":8781563625,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:d32cb19201265926826185b13aa1949855639533&amp;dn=POtHS+-+SNR+-+UFOs+Angels+Spirits+Witches+and+Demons+Vol+66+-+De&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"POtHS11","files":106,"time":1399753514,"description":"\n\nVote a &quot;LIKE&quot; for Little NEO here:\n &lt;a href=&quot;\nhttp://vube.com/Havaiia+Family+Band/Neo-Counting-Stars-Havaiia-Family-Band-cover/EZlSiFTm9s?t=s&amp;u=tjjRiRO0C6&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://vube.com/Havaiia+Family+Band/Neo-Counting-Stars-Havaiia-Family-Band-cover/EZlSiFTm9s?t=s&amp;u=tjjRiRO0C6&lt;/a&gt;\nand here\n &lt;a href=&quot;\nhttp://vube.com/Havaiia+Family+Band/neo-fireflies-live-cover/JesiFwtoWk?t=s&amp;u=tjjRiRO0C6&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://vube.com/Havaiia+Family+Band/neo-fireflies-live-cover/JesiFwtoWk?t=s&amp;u=tjjRiRO0C6&lt;/a&gt;\n\nHelp them Produce their New Album Here:\n &lt;a href=&quot;\nhttps://www.kickstarter.com/projects/havaiia/havaiia-family-bands-first-all-original-album-and&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://www.kickstarter.com/projects/havaiia/havaiia-family-bands-first-all-original-album-and&lt;/a&gt;\n\n\n PO t HS\n\nPouring Out the Holy Spirit\n\n\nPOtHS - SNR - UFOs Angels Spirits Witches and Demons Vol 66 - Declassified NAZI and Air Force UFO Secrets\n\nDescription:\n\nALDEBARAN MYSTERY II - NAZI UFO SECRETS:\nDoes The lurid tabloid myth of Nazi contact with space aliens and building flying saucers sound like the most outrageous science fiction? This same legend reconsidered from the radically altered view of Quantum Physics takes on dramatic plausibility! Was the German 'Vril Society' simply making practical application of universal, free-energy Quantum-Physics technology?&quot; These questions and more are explored in this shocking documentary film that reveals the inside story about the Vril Society which became the inner circle of the Thule Society, who's focus was on establishing communications with a group of Extraterrestrials, that began colonizing the planet Earth over a half billion years ago from a dieing star system know as Aldebaran.  A UFOTV presentation.\n----------------------------------------------------------------------------------------------------------------\n\nDeclassified Air Force UFO Tapes:\nDeclassified Air Force UFO Tapes 2013, Full Documentary.  This documentary and the rest of the documentaries presented relate to important times and figures in history, historic places and sites, archaeology, science, conspiracy theories, and education.\n------------------------------------------------------------------------------------------------------------------\n\n&quot;Project Blue Book: An Insider Speaks&quot; - Brigadier General Stephen Lovekin, Esq.:\nBrigadier General Lovekin entered the military in 1958. In 1959 he joined the White House Army Signaling Agency and served under President Eisenhower and then under President Kennedy with an above top secret clearance. He was familiar with Project Blue Book and related how that project documented highly scientific and specific UFO cases from very reliable sources. They reviewed photos taken from Air Force pilots, Marine Air Corps pilots and some foreign pilots and multiple reports of radar lock-ons. He was also shown a piece of metallic debris taken from the Roswell crash. While working under President Eisenhower, he discovered that Eisenhower had a keen interest in UFO's, but that Eisenhower came to realize that he had lost control of the subject.\n------------------------------------------------------------------------------------------------------------------\n\nSecret Projects at McDonnell Douglas:\nDr Robert Wood worked in a senior capacity as an aerospace engineer at McDonnell Douglas for his entire 43-year career. In his testimony, he states that he was involved in a specific project at McDonnell Douglas to study the propulsion systems of UFOs. In addition, he confirms the existence of other projects within the aerospace industry, and gives his assessment of the fact that this subject is not only real, but is of extraterrestrial nature. He also confirms the extreme secrecy surrounding the subject.\n------------------------------------------------------------------------------------------------------------------\n\nHOLES IN HEAVEN HD - SECRET TESLA TECHNOLOGY HD Movie:\nBased on discoveries by Nikola Tesla, HAARP is a controversial technology operated by the US military beaming high level energy into the Earth's upper atmosphere. HAARP also locates hidden oil reserves and missile silos around the world. However, critics of HAARP say this technology could blow a massive hole in the upper atmosphere as well as disrupt the subtle magnetic energies of all life on Earth. Narrated by Martin Sheen this film presents an investigation of a subject that could have a dramatic effect on all life.\n-----------------------------------------------------------------------------------------------------------------\n\nThe Secret Code of UFO ET Crop Circles - Feature Film:\n(90 Min) Winner of 2 EBE Awards! Peoples Choice Award &amp; Best Film In A UFO Related Theme - International UFO Congress Film Festival. Produced by Italian UFO Investigator Giorgio Bongiovanni. Presented for the first time in this investigative film is the discovery of a hidden symbolic language or meaning, a &quot;Cosmic Code&quot; in the Crop Circle formations which began to appear in a whirlwind of mystery in the early 1990s and continues to this day with stunning geometric complexity, grandeur and beauty.\n\nIMPORTANT Reviewer Comments:\nThis film projects many &quot;New Age&quot; interpretations (order out of chaos, oneness, and etc.) to explain the phenomena, however the film does provide worthy evidence for the occurrences.  Everyone should be forewarned of the &quot;New Age&quot; doctrine since it's simply another spin-off from other pagan traditions and religions.  As such, one should be aware that these formations, UFOs and related phenomena are a result of the demons/nephilim and their satanic agendas as mentioned in the Bible that will help usher in the &quot;End of Days&quot;.  Don't be deceived by these increasing trends, descriptions and their ultimate agenda.  Better to understand now in order to prevent the later ultimate deception of the Fake Alien Invasion and the resulting &quot;Global Unity&quot; to formalize the New World Order (because it already exists) and One World Religion.\n-----------------------------------------------------------------------------------------------------------------\n\nTOP 10 UFO Government Wistleblowers of All Time 2014:\nNow presenting the Top 10 UFO Government Whistleblowers of All Time. All of the greats are represented and presented in detail. Now celebrating The Top 10 UFO Government Whistle-blowers of All Time from UFOTV.\n-----------------------------------------------------------------------------------------------------------------\n\nOther main videos included...\nTime Travel by shieldoftheson\nUFOs The Secret Evidence\nVarious SNR short videos and UFO clips from arouns the world\n","torrent":{"xt":"urn:btih:d32cb19201265926826185b13aa1949855639533","amp;dn":"POtHS+-+SNR+-+UFOs+Angels+Spirits+Witches+and+Demons+Vol+66+-+De","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d32cb19201265926826185b13aa1949855639533","infoHashBuffer":{"type":"Buffer","data":[211,44,177,146,1,38,89,38,130,97,133,177,58,161,148,152,85,99,149,51]},"announce":[],"urlList":[]}}