{"title":"Soda Stereo - Ruido Blanco (1987) WMA320","uid":6112378,"size":117185139,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:d4ee9d59380527d18c78f9004f261cb312caeba0&amp;dn=Soda+Stereo+-+Ruido+Blanco+%281987%29+WMA320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"MARCELODRGZ","files":-1,"time":1295408366,"description":"Los dÃƒÂ­as 11 y 12 de febrero de 1987 Soda Stereo volviÃƒÂ³ a presentarse en Chile, esta vez en el exigente Festival de ViÃƒÂ±a del Mar, donde ganaron el premio Antorcha de Plata y sorprendieron a los medios de comunicaciÃƒÂ³n por la cantidad y pasiÃƒÂ³n de sus fans entre quienes se registraron 120 casos de ataques de histeria colectiva.[cita requerida] El Festival de ViÃƒÂ±a, transmitido por televisiÃƒÂ³n a muchos paÃƒÂ­ses latinoamericanos, expandiÃƒÂ³ la fama de la banda por todo el continente, que no tardÃƒÂ³ en transformarse en una masiva adhesiÃƒÂ³n incondicional que dio en llamarse Ã‚Â«sodamanÃƒÂ­aÃ‚Â». La presentaciÃƒÂ³n en el Festival de ViÃƒÂ±a fue seguida por una extensa gira por Chile: Puerto Montt (17/2), Valdivia (19/2), Talcahuano (21/2), ChillÃƒÂ¡n (22/2), Temuco (23/2), nuevamente en ViÃƒÂ±a del Mar (28/2) y cuatro funciones mÃƒÂ¡s en Santiago en dos dÃƒÂ­as (1 y 2 de marzo). En total asistieron 150.000 espectadores.\n\nDos meses despuÃƒÂ©s, el 23 de abril, batiÃƒÂ³ records de pÃƒÂºblico en un recital de rock en Paraguay con su presentaciÃƒÂ³n en el Yacht Club. Mientras tanto, Signos fue disco de platino en Argentina, triple disco de platino en PerÃƒÂº y doble platino en Chile.\n\nEl 2 de mayo se presentaban en la discoteca Highland Road de San NicolÃƒÂ¡s, Buenos Aires, cuando sucediÃƒÂ³ un derrumbe en el que murieron cinco jÃƒÂ³venes y hubo mÃƒÂ¡s 100 heridos mientras estaban tocando &quot;Persiana Americana&quot;. Con una carga emocional muy fuerte tocaron en Obras el 8 y 9 de mayo para presentar Signos en Buenos Aires. Como expresiÃƒÂ³n de duelo el grupo no utilizÃƒÂ³ la escenografÃƒÂ­a ni los juegos de iluminaciÃƒÂ³n que tenÃƒÂ­an preparados.\n\nEse mismo aÃƒÂ±o emprendieron una segunda gira por el continente con un repercusiÃƒÂ³n aÃƒÂºn mayor. El grupo se presentÃƒÂ³ en PerÃƒÂº, Bolivia, Ecuador, Chile, Colombia, Venezuela, Costa Rica y MÃƒÂ©xico (la primera presentaciÃƒÂ³n en MÃƒÂ©xico fue el 4 de agosto de 1987, en el Magic Circus del D.F.). Realizaron 22 conciertos en 17 ciudades frente a casi 350.000 personas, abriendo asÃƒÂ­ la idea misma de un Ã‚Â«rock latinoÃ‚Â», mÃƒÂ¡s allÃƒÂ¡ de la nacionalidad de cada banda, que fructificarÃƒÂ­a en la siguiente dÃƒÂ©cada. Con el material grabado en los distintos puntos del viaje se realizÃƒÂ³ el disco en vivo Ruido Blanco (1987), mezclado en la isla de Barbados y que fue considerado por la revista Rolling Stone {Argentina} como el 5Ã‚Âº entre los mejores ÃƒÂ¡lbumes en vivo del rock argentino.\n\nRuido Blanco es un ÃƒÂ¡lbum del grupo argentino Soda Stereo grabado en vivo en Argentina, Chile, PerÃƒÂº, MÃƒÂ©xico y Venezuela; y editado en 1987. Producido por Soda Stereo, Ruido Blanco fue hecho en una ÃƒÂ©poca en la que la banda se estaba dando a conocer a nivel latinoamericano, para muchos fans en Ruido Blanco se encuentran versiones de algunos temas mejores que las hechas en discos de estudio como es el caso de &quot;Persiana americana&quot; o &quot;Final caja negra&quot;.\n\nEn los temas PrÃƒÂ³fugos y Sobredosis de TV los coros son realizados por &quot;The Supremes&quot;, grupo que por muchos aÃƒÂ±os habÃƒÂ­a acompaÃƒÂ±ado a Diana Ross.\n\nRecuerda Gustavo Cerati:\n\n&quot;Tocamos muchÃƒÂ­simo en el circuito de discotecas, y cuando entrÃƒÂ¡s ahÃƒÂ­ tenÃƒÂ©s un ritmo infernal, pero ganas plata. Viajamos mucho al exterior y exportamos a otros paÃƒÂ­ses, como querÃƒÂ­a AlfonsÃƒÂ­n (risas).&quot;\n\npor WIKIPEDIA\n\nTRACKLIST:\n\n01 - Signos.wma                                                  \n02 - Juego De Seduccion.wma                                      \n03 - Persiana Americana.wma                                      \n04 - Sobredosis De T.V..wma                                      \n05 - Estoy Azulado.wma                                           \n06 - Final Caja Negra.wma                                        \n07 - Cuando Pase El Temblor.wma                                  \n08 - Vita-Set.wma                                                \n09 - Profugos.wma   \n\nWMA 320Kbps 44100Hz STEREO","torrent":{"xt":"urn:btih:d4ee9d59380527d18c78f9004f261cb312caeba0","amp;dn":"Soda+Stereo+-+Ruido+Blanco+%281987%29+WMA320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d4ee9d59380527d18c78f9004f261cb312caeba0","infoHashBuffer":{"type":"Buffer","data":[212,238,157,89,56,5,39,209,140,120,249,0,79,38,28,179,18,202,235,160]},"announce":[],"urlList":[]}}