{"title":"Talk Talk - Living in Another World [promo].VOB","uid":7800187,"size":286777344,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:d5b945012ff06b7da43124793add1471d611790f&amp;dn=Talk+Talk+-+Living+in+Another+World+%5Bpromo%5D.VOB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SgtRlee","files":-1,"time":1352260262,"description":"Talk Talk - Living in Another World [promo].VOB\n\n\nVery HQ rare promo music video from a promo DVD. &quot;&quot; is a song from The Colour of Spring, Talk Talk's third album and was released in 1986. It became the band's highest selling non-compilation studio album, reaching the Top 20 in numerous countries (topping the Dutch charts), including their homeland, where it reached No. 8 and stayed in the charts for 21 weeks. It did not quite match the sales of its predecessor in the United States, but was nonetheless their last album to enter the Billboard Top 200, reaching the Top 75. \n\nWith its international hit &quot;Life's What You Make It&quot;, Talk Talk expanded their fan base, and it earned the band the third of their three American hits, along with 1984's &quot;It's My Life&quot; and &quot;Such a Shame&quot;. \n\nMusically, The Colour of Spring was a major step away from the synthesised pop of early Talk Talk, with the focus on such songs as &quot;Life's What You Make It&quot;, &quot;Living in Another World&quot; and &quot;Give It Up&quot;. It had a sound described by the band as much more &quot;organic&quot; than their earlier records, with the improvisation that was to dominate on their later works already apparent in the recording process. \n\nPitchfork Media listed The Colour of Spring as 83rd best album of the 1980s. Slant Magazine listed the album at #96 on its list of &quot;Best Albums of the 1980s.&quot;\n\nTalk Talk began as a quartet consisting of Mark Hollis (vocals), Simon Brenner (keyboards), Lee Harris (drums) and Paul Webb (bass guitar). They were generally associated with the New Romantic movement; more specifically, in their early years, they were often compared with Duran Duran, as both bands sported a name which was a single word repeated twice, a Roxy Music-inspired musical direction, and shared the same record label (EMI) and producer (Colin Thurston).\n\nIn their later years the band's commercial appeal receded, but their critical reputation increased as they moved from synthpop to a more experimental form. Their final two albums, Spirit of Eden and Laughing Stock, were highly acclaimed and remain influential to experimental alternative rock genres, especially post-rock. \n\nTalk Talk's influence upon musicians has exceeded the band's visibility among the general public. Along with the band Slint, Talk Talk are credited with inventing post-rock in their last two albums, Spirit of Eden and Laughing Stock. Sigur Ros has played Talk Talk songs before their shows. \n\nBands and artists that have claimed to be influenced by and/or a fan of Talk Talk include Portishead, Bark Psychosis, The Catherine Wheel, Lights, Radiohead and DJ Shadow. The band Weezer covered their song &quot;Life's What You Make It&quot; and No Doubt scored a hit with a cover of &quot;It's My Life&quot; in 2003. John Taylor of Duran Duran also has expressed fondness for the group; Talk Talk opened for Duran Duran back in 1982. \n(video does not have any logos)\n\n\n    &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/The_Colour_of_Spring&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/The_Colour_of_Spring&lt;/a&gt; \n      &lt;a href=&quot;\nhttp://bayimg.com/GAFmlaaEK&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/GAFmlaaEK&lt;/a&gt; \n   \n\n\nFile properties info using Media Player Classic: \n   Video: MPEG2 Video 720x576 (4:3) 25fps 9800kbps\n   Audio: LPCM 48000Hz stereo 1536kbps [DVD LPCM, 16 bit]\n   Duration: 00:04:05\n\n\n\n\n*Install the &quot;Media Player Classic&quot; player if you can't play this file, \nor for better visual and audio quality playback of all your videos. \nIt's 100% free to download and use. Latest stable build is v1.6.4\n\n\n*Media Player Classic Home Cinema*  &lt;a href=&quot;\nhttp://mpc-hc.sourceforge.net/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://mpc-hc.sourceforge.net/&lt;/a&gt; \n\n\nSgtRlee (Sgt.R.Lee) \n\t","torrent":{"xt":"urn:btih:d5b945012ff06b7da43124793add1471d611790f","amp;dn":"Talk+Talk+-+Living+in+Another+World+%5Bpromo%5D.VOB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d5b945012ff06b7da43124793add1471d611790f","infoHashBuffer":{"type":"Buffer","data":[213,185,69,1,47,240,107,125,164,49,36,121,58,221,20,113,214,17,121,15]},"announce":[],"urlList":[]}}