{"title":"Ram Dass - 1979 - Miracle of Love - Stories about Neem Karoli Ba","uid":11086466,"size":14041607,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d6a7a666fef5381a3dbddef3ef405f652beb9650&amp;dn=Ram+Dass+-+1979+-+Miracle+of+Love+-+Stories+about+Neem+Karoli+Ba&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Anomalous","files":1,"time":1411463887,"description":"&quot;There can be no biography of him. Facts are few, stories many. He seems to have been known by different names in many parts of India, appearing and disappearing through the years. His western devotees of recent years knew him as 'Neem Karoli Baba,' but mostly as 'Maharajii'--a nickname so commonplace in India that one can often hear a tea vendor addressed thus. Just as he said, he was 'Nobody.' He gave no discourses; the briefest, simplest stories were his teachings. Usually he sat or lay on a wooden bench wrapped in a plaid blanket while a few devotees sat around him. Visitors came and went; they were given food, a few words, a nod, a slap on the head or back, and they were sent away. There was gossip and laughter for he loved to joke. Orders for running the ashram were given, usually in a piercing yell across the compound. Sometimes he sat in silence, absorbed in another world to which we could not follow, but bliss and peace poured down on us. Who he was was no more than the experience of him, the nectar of his presence, the totality of his absence--enveloping us now like his plaid blanket. --Anjani In 1967 I met Neem Karoli Baba, a meeting which changed the course of my life. In the depth of his compassion, wisdom, humor, power and love I found human possibility never before imagined...an extraordinary integration of spirit and form. I was with him only briefly for he left his body in 1973, still he entered my heart as living truth, and his presence continues to enrich and guide my life.","torrent":{"xt":"urn:btih:d6a7a666fef5381a3dbddef3ef405f652beb9650","amp;dn":"Ram+Dass+-+1979+-+Miracle+of+Love+-+Stories+about+Neem+Karoli+Ba","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d6a7a666fef5381a3dbddef3ef405f652beb9650","infoHashBuffer":{"type":"Buffer","data":[214,167,166,102,254,245,56,26,61,189,222,243,239,64,95,101,43,235,150,80]},"announce":[],"urlList":[]}}