{"title":"Asphalt Materials and Mix Design Manual - Irving Kett","uid":12754554,"size":8035584,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d7b2842a4d0113b5dafb6938cb1893dc606e35e7&amp;dn=Asphalt+Materials+and+Mix+Design+Manual+-+Irving+Kett&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1447427763,"description":"Asphalt Materials and Mix Design Manual - Irving Kett (Noyes, 1998).pdf\r\n\r\nISBN 0-8155-1425-5\r\n\r\nThe purpose of this manual is to familiarize industry and students with the technology of asphalt in its several forms namely asphalt cement, cutback asphalt, and asphalt emulsions. The laboratory work is designed to develop an understanding of asphalt properties, characteristics, testing procedures, and specifications. \r\nThe procedures outlined are all derived from ASTM designations and practice as recommended by the Asphalt Institute. Where the particular ASTM method permits alternate procedures, the one more applicable to the available equipment and the teaching situation was chosen. \r\nThe manual consists of the following: \r\no 35 of the frequently used ASTM tests in Asphalt Binder and Mix Design.\r\no Sample computations and easy to use data sheets, most of which have been developed specifically for the manual.\r\no An up-to-date overview of Asphalt Technology including sources, historical development, and classifications of asphalt products.\r\no Easy to understand explanations for Voids Mineral Aggregate, Absorbed Asphalt, Effective Asphalt Content, Percent Air Voids, and Percent of Voids filled with Asphalt.\r\no A stand-alone asphalt manual, written specifically for university laboratory instruction, yet applicable for a commercial testing laboratory. Rarely will other reference materials need to be referred to.\r\no Dimensions in both the SI and the US Standard systems of measurement.\r\no An appendix with conversion factors, rules of safety and procedures, overview of SHRP SUPERPAVE, explanation of asphalt emulsions, and additional data sheets on single-sided pages","torrent":{"xt":"urn:btih:d7b2842a4d0113b5dafb6938cb1893dc606e35e7","amp;dn":"Asphalt+Materials+and+Mix+Design+Manual+-+Irving+Kett","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d7b2842a4d0113b5dafb6938cb1893dc606e35e7","infoHashBuffer":{"type":"Buffer","data":[215,178,132,42,77,1,19,181,218,251,105,56,203,24,147,220,96,110,53,231]},"announce":[],"urlList":[]}}