{"title":"Osho_From Bondage To Freedom- #15.mp4","uid":14011516,"size":884471320,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:d91ebaa90e65d0414c31193f9172eea2356140ef&amp;dn=Osho_From+Bondage+To+Freedom-+%2315.mp4&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"drugarica","files":1,"time":1458831820,"description":"\nOsho_ from Bondage to Freedom #15 \r\nNow meditation is needed even more\r\nQuestion 1:\r\n\r\nBELOVED MASTER,\r\n\r\nI SEEM TO BE BALANCED ON THE TIGHTROPE OF PO. I NEVER BELIEVE NOR DISBELIEVE\r\nWHAT YOU SAY IN THAT OUTER POLITICAL WORLD OF FACTS AND FIGURES, THAT MERRY-\r\nGO-ROUND OF DIFFERENT VIEWS, THAT SHIFTING MIRAGE OF TRUTHS, HALF-TRUTHS,\r\nCONTRADICTIONS, AND PARADOXES THAT SLIP THROUGH MY MIND LIKE AN AUTUMN\r\nBREEZE. IT'S ALL PO NOW.\r\n\r\nWOULD I HIJACK A PLANE, STONE AN EMBASSY, OR FRUSTRATE A POLICE\r\nINVESTIGATION? PO, PO, PO - I DON'T KNOW. YET I DO KNOW THAT MY HEART STILL\r\nDANCES WITH YOU, YOUR SILENCE STILL PENETRATES ME WITH A DELICATE, EXQUISITE\r\nAWE. AND MY LAUGHTER IS BECOMING MORE AND MORE ROOTLESS, LIKE A MAD CHILD,\r\nGIGGLING AT NOTHING IN PARTICULAR. AM I MISSING, BELOVED MASTER?\r\n.....\r\nI was joking with the journalists, but idiots can't understand any sense of humor. The attorney general of Oregon has immediately put the National Guard on alert. It is good. To be alert is always good. That's my whole teaching! Keep the National Guard, your armies, twenty-four hours alert.\r\n\r\nThat's what I want. And I can go on making statements so that you have to keep them alert.\r\n\r\nBut just for you - privately, don't tell it to anybody - we are nonviolent people, vegetarians: we don't do such things.\r\n.........\r\nQuestion 2:\r\n\r\nBELOVED MASTER,\r\n\r\nI LOVE YOU. PLEASE TELL ME IF WE HAVE LET YOU DOWN. I FEEL HURT WHEN I HEAR\r\nQUESTIONS IN DISCOURSE THAT DON'T APPRECIATE YOU AND THE LOVE THAT YOU SO\r\nGENEROUSLY POUR ON ME. I HOPE THAT OUR LOVE IS ALSO ENOUGH TO HELP HEAL US,\r\nAND YOU NEVER FEEL WE TAKE YOU, OUR BELOVED, FOR GRANTED.\r\n\r\nPLEASE COMMENT ON WHETHER OUR NOT LOVING ENOUGH HAS ANYTHING TO DO WITH\r\nWHAT YOU SAID ABOUT NOT WEARING MALAS AND ONLY RED COLORS. ALSO, BELOVED\r\nMASTER, PLEASE SAY IF THERE IS ANYTHING WE AS A COMMUNE CAN DO TO HELP THE\r\nHEALING SO WE CAN REALLY CELEBRATE YOU AND YOUR LOVE FOR US, AND LET THIS\r\nCANDLE OF OUR LOVE BURN COMPLETELY AT EVERY END.\r\n\r\nI am grateful for your understanding. But it is not that your love is not enough for me. You love me more than anybody has ever been loved. You cannot let me down.\r\n\r\nTelling you that it is up to you to wear malas or not, it is up to you to be in red clothes or not, is not out of any hurt feeling in me.\r\n\r\nQuestion 3:\r\n\r\nBELOVED MASTER,\r\n\r\nYOU ARE A TOTAL STRANGER TO ME, YET A FRIEND AND LOVER. HOW CAN THIS BE?\r\n\r\nThis is the only way it can be. We are all strangers to each other....\r\n\r\nQuestion 4:\r\n\r\nBELOVED MASTER,\r\n\r\nYOU ARE THE MOST PRECIOUS JOY EVER TO HAVE COME INTO MY LIFE UPON THIS\r\nEARTH. IS IT POSSIBLE THAT I COULD REALLY FEEL THIS WAY ABOUT MY OWN BEING?\r\n\r\nRead it again.\r\n\r\nQuestion 5:\r\n\r\nBELOVED MASTER,\r\n\r\nYOU ARE THE MOST PRECIOUS JOY EVER TO HAVE COME INTO MY LIFE UPON THIS\r\nEARTH. IS IT POSSIBLE THAT I COULD REALLY FEEL THIS WAY ABOUT MY OWN BEING?\r\n\r\nIf you have not felt it about your own being - the preciousness, the ecstasy, the joy - how can you feel it about me? It is not possible. You are projecting, you are imagining. And this is the trouble.\r\nQuestion 6:\r\n\r\nBELOVED MASTER,\r\n\r\nYOU ARE THE CENTER OF THE CYCLONE. WHEN I AM NEAR YOU I FEEL FINE. BUT WHEN\r\nI AM A LITTLE AWAY FROM YOU I AM AGAIN IN THE STRONG WHORLS OF THE CYCLONE -\r\nTHE GREAT MOVEMENT OF EMOTIONS AND FEELINGS. HOW CAN I GET TO THE CENTER\r\nOF MY OWN CYCLONE?\r\n\r\nJust be a witness of all those emotions, thoughts, which you call the cyclone. Just be a witness, and that point of witnessing is the center of the cyclone.\r\n\r\nThis is the simplest method to realize oneself.\r\n\r\nQuestion 7:\r\n\r\nBELOVED MASTER,\r\n\r\nTHE OTHER DAY YOU CALLED THE BIBLE A PORNOGRAPHIC BOOK. PLEASE EXPLAIN\r\nWHAT YOU MEANT BY THIS REMARK.\r\nRead all here","torrent":{"xt":"urn:btih:d91ebaa90e65d0414c31193f9172eea2356140ef","amp;dn":"Osho_From+Bondage+To+Freedom-+%2315.mp4","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d91ebaa90e65d0414c31193f9172eea2356140ef","infoHashBuffer":{"type":"Buffer","data":[217,30,186,169,14,101,208,65,76,49,25,63,145,114,238,162,53,97,64,239]},"announce":[],"urlList":[]}}