{"title":"Bjerknes-Manufacture&amp;Sale of St. Einstein(Einstein hoax)","uid":4535169,"size":17797862,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:da1aa0a020582cdc20017e570d88310020fb5642&amp;dn=Bjerknes-Manufacture%26Sale+of+St.+Einstein%28Einstein+hoax%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"red_gonzo","files":1,"time":1227712256,"description":"This is Christopher Jon Bjerknes&amp;#039; explosive book The Manufacture and Sale of Saint Einstein (2006) which is simply the biggest expose of Albert Einstein&amp;#039;s plagiarism of Theory of relativity and his hidden role in the history of Zionism which needed a &quot;hero&quot; to promote its cause. Bjerknes is the author of several other books exposing that Einstein has fully plagiarised &quot;his&quot; theory from previous sources who were later strangely omitted or even erased from history of science as only Einstein took full glory for Theory of relativity. The author asks the logical question of who had the immense power of simply make some people vanish from history and the road to answers lead him to the Jewish mass movement called Zionism. Since it&amp;#039;s common knowledge that the Zionist lobby controls most of the press, finances and politics in USA it was an easy task to proclaim godhood on Einstein and in the meantime get rid of everyone else who greatly contributed to the advancement of science which is a team sport where many scientists all over the world contribute to a common goal. But the history of the infamous Theory of relativity is completely different since it was supposedly all made by one man only. Bjerknes looks deep into the Jewish history and especially Zionism which had the money and influence of completely distorting history so that today virtually everyone believes these lies and blindly takes them granted as truth. Mammoth in scope and filled with all possible references to original sources, he is able to reconstruct the complete history of how the sequence of events really followed and who is really responsible for what. Find out what the official science and politics simply doesn&amp;#039;t want you to know about the supposedly biggest genius of 20th century and especially about Zionism as a whole which is (ab)using Jews all over the world for its selfish goals. Is science just a playdoll of politics and can some scientists be made into gods with their theories becoming scientific dogma? It sure seems so and in The Manufacture and Sale of Saint Einstein you will find the most detailed investigation ever made on how it can be done and was actually done. Breathtaking 2830 pages long. A must read from everyone.\n","torrent":{"xt":"urn:btih:da1aa0a020582cdc20017e570d88310020fb5642","amp;dn":"Bjerknes-Manufacture%26Sale+of+St.+Einstein%28Einstein+hoax%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"da1aa0a020582cdc20017e570d88310020fb5642","infoHashBuffer":{"type":"Buffer","data":[218,26,160,160,32,88,44,220,32,1,126,87,13,136,49,0,32,251,86,66]},"announce":[],"urlList":[]}}