{"title":"A Branded World","uid":7854207,"size":299695489,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:da30db6fa81c7cb0018f92305378b604b00ae4e8&amp;dn=A+Branded+World&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"cloak-and-dagger","files":-1,"time":1353695854,"description":"Adventures in Public Relations and the Creation of Superbrands\nThe head of a celebrity public relations firm offers expert advice on the art of PR and branding\nIn A Branded World, renowned celebrity publicist and bestselling author Michael Levine explores the fascinating and complex world of branding. He explores the many facets of PR in the branding process, including packaging, damage control, and e-branding. By actually creating a fictional product and using it as a branding template throughout the book, this definitive work offers extraordinary advice for PR executives and marketing managers on how to build their brands and use the appropriate media to effectively promote those brands. With examples of successful and unsuccessful branding campaigns and an exploration of the idea of personalities as product, this is the definitive guide to branding.\nMichael Levine (Los Angeles, CA) has represented hundreds of major-name celebrities as head of a prominent public relations firm with offices in Los Angeles, New York, Washington, D.C., and London. His client list includes Janet Jackson, Fleetwood Mac, and Reebok, among others. His essays have appeared in USA Today, the National Review, the Los Angeles Times, and The New York Times.","torrent":{"xt":"urn:btih:da30db6fa81c7cb0018f92305378b604b00ae4e8","amp;dn":"A+Branded+World","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"da30db6fa81c7cb0018f92305378b604b00ae4e8","infoHashBuffer":{"type":"Buffer","data":[218,48,219,111,168,28,124,176,1,143,146,48,83,120,182,4,176,10,228,232]},"announce":[],"urlList":[]}}