{"title":"Anita Baker - My Everything - (2004)[ MP3 VBR]","uid":4434296,"size":82886627,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:da7d120561bddf5c918d8cdeb2941b10874ab8a4&amp;dn=Anita+Baker+-+My+Everything+-+%282004%29%5B+MP3+VBR%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"seanprince","files":15,"time":1223449656,"description":"Anita Baker - My Everything - (2004)[ MP3 VBR]\n\nTrack list\n\nAnita Baker - My Everything\n\n01. You're My Everything 05:03\n02. How Could You 04:21\n03. In My Heart 05:06\n04. Serious 05:25\n05. How Does It Feel 04:42\n06. Like You Used To 05:11\n07. Close Your Eyes 04:42\n08. You're My Everything Revisited 01:12\n09. I Can't Sleep 05:08\n10. Men In My Life 03:37\n\nBiography\n\nWith her classy, refined brand of romantic soul, Anita Baker was one of the definitive quiet storm singers of the '80s. Gifted with a strong, supple alto, Baker was influenced not only by R&amp;B, but jazz, gospel, and traditional pop, which gave her music a distinctly adult sophistication. Smooth and mellow, but hardly lifeless, it made her one of the most popular romantic singers of her time.\nBaker was born January 26, 1958, in Toledo, OH, and raised in nearby Detroit, where she grew up listening to female jazz singers like Sarah Vaughan, Nancy Wilson, and Ella Fitzgerald. At age 12, she began singing a gospel choir, and by age 16 she was performing with several local bands. In 1975, she successfully auditioned for Chapter 8, one of Detroit's most popular acts at the time; the group eventually signed with Ariola and released an album in 1979, but were immediately dropped when the label was acquired by Arista (which didn't care for Baker's vocals). Chastened, Baker worked low-paying jobs in Detroit and eventually found steady work as a receptionist at a law firm. In 1982, Otis Smith -- an executive who'd worked with Chapter 8 -- contacted Baker about recording for his new label Beverly Glen. Happy with her employment benefits and skittish over the experience with Arista, Baker was reluctant at first, but eventually flew out to the West Coast to record her debut album, The Songstress, in 1983. Though it didn't gain quite enough exposure to become a hit, it did help Baker build a strong fan base through word-of-mouth and she was signed by Elektra in 1985.\nWorking with producer Michael J. Powell (an old Chapter 8 cohort), Baker released her major-label debut Rapture in 1986. It was a platinum, Grammy winning smash, appealing to both urban and adult contemporary listeners and producing two all-time quiet storm classics in &quot;Caught Up in the Rapture&quot; and &quot;Sweet Love.&quot; Baker toured the world in 1987 and her guest appearance on the Winans track &quot;Ain't Got No Need to Worry&quot; won a Grammy. Her equally stylish follow-up album, Giving You the Best That I Got, appeared in 1988, spawning more staples in the title track and &quot;Just Because.&quot; &quot;Giving You the Best That I Got&quot; also won Baker two more Grammys, for Best Female R&amp;B Vocal and Best R&amp;B Song. For her third Elektra album, Baker decided to handle a greater share of the songwriting, hence the title Compositions, which was released in 1990 and featured even stronger jazz inflections than Baker's previous work (not to mention all live instruments).\nFollowing Compositions, Baker took a break from recording and touring; after having her first son in 1993, she returned to the studio to craft Rhythm of Love, which was released in 1994. In the years that followed, Baker was mostly silent, despite her fans' clamoring for a jazz album; instead, she raised her family and became embroiled in contract disputes with Elektra, which eventually led her to move to Atlantic. She began working on a new album in 2000, but had to start over from scratch due to defective recording equipment that made the original tracks unsalvageable. In 2004 it was announced that she had signed with Blue Note and still working on her new album. In the meantime, the Atlantic imprint Rhino released Night of Rapture: Live, a 1987 concert originally available on video. Baker finally returned to the studio in 2003 and issued My Everything, her first album in 10 years. Two years later she released her first holiday album, Christmas Fantasy.\n\nReview\n\nAnita Baker's My Everything is her first studio outing in a decade. Family life seems to have claimed most of that time, as the album's last cut, &quot;Men in My Life,&quot; seems to indicate. Baker co-wrote seven of the album's nine songs (one is a reprise of the title track), authored the aforementioned tune, and assisted producer Barry J. Eastmond in the arrangements. The disc's first single, &quot;You're My Everything,&quot; is indicative of the album's sound: finely wrought and executed urban adult soul. Most of the set falls into this category, too, with the exception of &quot;Like You Used to Do,&quot; a duet with Kenneth &quot;Babyface&quot; Edmonds that walks a line between it and new-school groove. Another cut, the stellar &quot;I Can't Sleep,&quot; offers Baker in full-on jazz mode, careening through a skittering and swinging arrangement with a full horn section pushing the groove; it showcases Baker's ability to croon, and she comes very close to Betty Carter's scat. Some may be frustrated that, after such a long time, Baker doesn't push the envelope more stylistically. This may be true in terms of the material itself, but that's not necessarily a bad thing. Right down the line, Baker delivers on what she does best. But in one sense she has expanded her palette. On these cuts, most of the rhythm section's tracks were cut live from the floor, and on three, the vocals were as well. This gives the album a reedy immediacy that contrasts sharply with the rest of her studio catalog. This is a worthy return, qualitatively standing head and shoulders above most everything else in its class.\n\nEnjoy.","torrent":{"xt":"urn:btih:da7d120561bddf5c918d8cdeb2941b10874ab8a4","amp;dn":"Anita+Baker+-+My+Everything+-+%282004%29%5B+MP3+VBR%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"da7d120561bddf5c918d8cdeb2941b10874ab8a4","infoHashBuffer":{"type":"Buffer","data":[218,125,18,5,97,189,223,92,145,141,140,222,178,148,27,16,135,74,184,164]},"announce":[],"urlList":[]}}