{"title":"Invasion of the Mind Snatchers: Television's Conquest of America","uid":9316732,"size":1824706,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:db2e44c1dc66c91155abfbfbcd94f926d082c04c&amp;dn=Invasion+of+the+Mind+Snatchers%3A+Television%27s+Conquest+of+America&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"K-Slender","files":3,"time":1386481932,"description":"Publisher: Temple University Press (May 28, 2010)\nLanguage: English\nISBN-10: 1439902887\nISBN-13: 978-1439902882\n\nWhen the first television was demonstrated in 1927, a headline in The New York Times read, &quot;Like a Photo Come to Life.&quot; It was a momentous occasion. But the power of television wasn't fully harnessed until the 1950s, when the medium was, as Eric Burns says, &quot;At its most preoccupying, its most life-altering.&quot; And Burns, a former NBC News correspondent who is an Emmy-winner for his broadcast writing, knows about the impact of television. Invasion of the Mind Snatchers chronicles the influence of television that was watched daily by the baby boomer generation. As kids became spellbound by Howdy Doody and The Ed Sullivan Show, Burns reveals, they often acted out their favorite programs. Likewise, they purchased the merchandise being promoted by performers, and became fascinated by the personalities they saw on screen, often emulating their behavior. It was the first generation raised by TV and Burns looks at both the promise of broadcasting as espoused by the inventors, and how that promise was both redefined and lost by the corporations who helped to spread the technology. Yet Burns also contextualizes the social, cultural, and political events that helped shape the Fifties--from Sputnik and the Rosenberg trial to Senator Joseph McCarthy's Red Scare. In doing so, he charts the effect of television on politics, religion, race, and sex, and how the medium provided a persuasive message to the young, impressionable viewers. ","torrent":{"xt":"urn:btih:db2e44c1dc66c91155abfbfbcd94f926d082c04c","amp;dn":"Invasion+of+the+Mind+Snatchers%3A+Television%27s+Conquest+of+America","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"db2e44c1dc66c91155abfbfbcd94f926d082c04c","infoHashBuffer":{"type":"Buffer","data":[219,46,68,193,220,102,201,17,85,171,251,251,205,148,249,38,208,130,192,76]},"announce":[],"urlList":[]}}