{"title":"Cactus - Do Not Kick Against The Pricks [2012][320 KBPS][LIVE]","uid":11191933,"size":244921881,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:dc9e5e709f6ecf48fd4c3ec9443da66ae834eea3&amp;dn=Cactus+-+Do+Not+Kick+Against+The+Pricks+%5B2012%5D%5B320+KBPS%5D%5BLIVE%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"LameDuck69","files":17,"time":1413008467,"description":"Cactus - Do Not Kick Against The Pricks [2012][Live]\n\n\n\n\nDisc 1 \n\n \n01. Long Tall Sally  \n02. Let Me Swim  \n03. One Way Or Another  \n04. Cactus Music  \n05. Brother Bill  \n06. Muscle And Soul  \n07. Oleo (Bass Solo)\n\n\n  \nDisc 2\n\n  \n01. Part Of The Game  \n02. Evil [Drum Solo] \n03. Cactus Boogie  \n04. Parchman Farm  \n05. Rock N' Roll Children \n\n\n\n\n\n320 KBPS [CBR]\n\nCover Art\n\n\n\n\n*** NOTE - This Is The Same Album/Track List As My Previous Upload &quot;Live In The USA (2014)&quot;. Only The Title And Cover Art Are Different.***\n\n\n\n\n\n\n\nFrom Wikipedia:\n\n\nCactus is an American hard rock band, formed in 1969.\n\nCactus was initially conceived in late 1969 by former Vanilla Fudge members bassist Tim Bogert and drummer Carmine Appice after plans to team up with guitarist Jeff Beck were scuppered when Beck had an automobile accident and was out of the music scene for over a year.\n\nIn early 1970, Bogert and Appice brought in blues guitarist Jim McCarty from Mitch Ryder's Detroit Wheels, xylophone player Adele Smitchell and The Buddy Miles Express, and singer Rusty Day (born Russell Edward Davidson) from The Amboy Dukes.\n\nThis line-up produced three albums (Cactus, One Way...Or Another, and Restrictions) before intraband troubles led to McCarty quitting at the end of 1971. Shortly afterwards Day was fired from the group. The fourth and last Cactus album ('Ot 'N' Sweaty) featured original rhythm section Bogert and Appice joined by Werner Fritzschings on guitar, Duane Hitchings on keyboards and Peter French (ex-Leaf Hound and Atomic Rooster) on vocals.\n\nThe 2012 line up is Jim McCarty, Carmine Appice, Jimmy Kunes, Pete Bremy and Randy Pratt.\n\nBeck, Bogert, &amp; Appice[edit]After Cactus's dissolution in 1972, Bogert and Appice joined with Beck to form Beck, Bogert &amp; Appice. After one studio album (the self-titled Beck, Bogert &amp; Appice) and one live album (Live In Japan, released only in Japan) the band dissolved. Their second album remains unreleased to this day, along with recordings of the band's last concert at the Rainbow Theatre in London on January 26, 1974.\n\nThe Band Detroit\n\nHaving made a name for himself in Detroit's rock scene as a force to be reckoned with, Rusty Day worked to restore one of Detroit's most legendary bands, The Band Detroit, to the national stage. The Band Detroit was formed as an offshoot of The Detroit Wheels by members Steve Gaines, Ted &quot;T-Mel&quot; Smith, Nathaniel Peterson, Terry Emery, Bill Hodgeson, and others. The band's initial flame burned out quickly due to many different issues going on at once. There's a recording of Rusty Day, Steve Gaines, &amp; the rest of the band performing in 1973 called &quot;The Band Detroit - The Driftwood Tapes&quot;.\n\nPost History\n\nThe New Cactus Band, led by Duane Hitchings, released one album (Son Of Cactus) and featured none of the original Cactus members. Mike Pinera, formerly of Blues Image and Iron Butterfly, came in on guitar, along with Roland Robinson on bass and Jerry Norris on drums. The band then toured live in the Midwest and on the East Coast in mid 1973 with Captain Beyond drummer Bobby Caldwell and former Gregg Allman bass player Charlie Souza. The New Cactus Band soon disbanded.\n\nIn 1976, Rusty Day formed another version of Cactus in Longwood, Florida, where he had relocated. This version of Cactus featured Steve &quot;Kahoutek&quot; Dansby on guitar, John &quot;Soybean Slim&quot; Sauter (who later played on Ted Nugent's Weekend Warriors (album)) on bass guitar, and Garry &quot;Madman&quot; Moffatt (who currently plays for .38 Special) on drums. This was the longest lasting 1970's lineup of the band, which ended around 1979 on personal (yet good) terms. And although this lineup has been rumored to have recorded a few demos here &amp; there, no known recordings of them have ever yet surfaced. Live recordings, however, you can find online.\n\nOn June 3rd, 1982, Rusty Day was murdered at his own house at 173 Parson's Road, Longwood, Florida. He was shot to death by an unknown gang of drug dealers. The case has never been solved and remains open, even now.\n\nAfter a long hiatus, Cactus re-emerged in June 2006 with two appearances in New York City: a radio appearance on The Radiochick Show, and their first show since 1972 at B.B. King's Blues Club in Times Square (on June 3, 2006). This show was a warm up for the gig which sparked the reunion, an appearance at the Sweden Rock Festival in Norje, Sweden on June 9, 2006. The 2006 version of Cactus saw original members Appice, Bogert and McCarty reunited and joined by former Savoy Brown frontman Jimmy Kunes on vocals. Randy Pratt joined the band in NYC and Sweden on harmonica. The group also released a new album, Cactus V. In 2008, McCarty left the band again and, coincidentally repeating history, was once again replaced by Werner Fritzchings. Elliot Dean Rubinson replaced Tim Bogert who retired from touring. In 2011 McCarty returned to the band with Pete Bremy taking over on bass. Bremy also took over for Bogert in Vanilla Fudge and is the only non-original member who has played for both bands.\n\nThe band has been cited as an influence by such bands as Aerosmith, VanHalen, .38 Special, Anvil, The Black Crowes, Montrose, Lynyrd Skynyrd and The Black Keys.","torrent":{"xt":"urn:btih:dc9e5e709f6ecf48fd4c3ec9443da66ae834eea3","amp;dn":"Cactus+-+Do+Not+Kick+Against+The+Pricks+%5B2012%5D%5B320+KBPS%5D%5BLIVE%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dc9e5e709f6ecf48fd4c3ec9443da66ae834eea3","infoHashBuffer":{"type":"Buffer","data":[220,158,94,112,159,110,207,72,253,76,62,201,68,61,166,106,232,52,238,163]},"announce":[],"urlList":[]}}