{"title":"Lilium - Short Stories (2003) [FLAC]","uid":8046207,"size":292000870,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:dcc0bd77c4ce78212c97ba53139e1e995b5ebf4c&amp;dn=Lilium+-+Short+Stories+%282003%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"dickspic","files":25,"time":1358751248,"description":"Artist: Lilium\nRelease: Short Stories\nDiscogs: 1493485\nReleased: 2003\nLabel: Glitterhouse Records\nCatalog#: GRCD 583\nFormat: FLAC / Lossless / Log (100%) / Cue / CD\nCountry: Germany\nStyle: Rock, Folk Rock, Acoustic, Ethereal, Country Rock\n\nTracklisting:\n\n01. If They Cheered\n02. Locked In Tight\n03. Whitewashed\n04. Lover\n05. Miles Away\n06. Sorry\n07. Sense And Grief\n08. Cavalcade\n09. The Trap\n10. Angels\n\nAccording to the ancient language of flowers, the Lily represents purity. It also represents other states such as hatred, pride, falseness and coquetry, depending on the variety you choose to give. Most countenances of the Lilium family are present on this album. This is grown up music. There are no screaming guitars, no over-excitable vocals. What we have is a collection of solid, introspective songs fuelled by an unnamed and troubling melancholia. It hums the kind of tension that permeates a room where a back stabbing, sleazy secret is known by everyone except the wronged.\n\nPascal Humbert and Jean-Yves Tola spend most of their time as two-thirds of the Gothically charged, alt-country, Denver based band 16 Horsepower. As Lilium, they have invited like-minded guest vocalists to add their own lyrics to the pair's lilting, atmospheric music that's been wholly built using real instruments of a traditional hue. David Eugene Edwards, the excluded 16hp portion, joins them for 'Whitewashed', to look death straight in the face without flinching. The moment Edwards' plaintive, passion-lead voice enters, is moving to the extreme. Formerly of the innovative 90s band Morphine, Dana Colley adds distinctive saxophone to a couple of tracks, and bleary, redolent vocals from Kal Cahoone help to keep the fragile moroseness on the road. Instrumentation is precise, and as basic as deemed necessary throughout. Nothing is wasted or indulged but the filigree atmosphere moves on from track to track to leave a quaint gravitas in its wake.\n\nThe acronym DVD is associated almost exclusively with film but the only visuals to come with this package are a series of stills, one per track, which vary in atmosphere and perceived relevance. Alongside each screen image is the who-does-what information for each track, which isn't so vital that we need it at eye height throughout each song. Rear covers and inlays have fed the inquisitive for years so no need for the ever present reminder. A better use of the visual medium would have been to include an interview vid or some such, as a bonus.\n\nIf you want to hear Short Stories in the car or anywhere other than through the TV system or your PC, then you're going to be stuck as your hi-fi won't read the disc. You'll need the regular CD for that. In fact, if your DVD player doesn't state its compatibility with DVD-Audio, you can forget that too. We are walking on virgin territory here as new technologies are vying for market shares. No single format has become the industry standard yet, so not everything is going to fit. (Remember Betamax or the 8-Track Cartridge. No? Ask your folks.)\n\nBut if you happen to find that all the jigsaw pieces in your home can handle this little novelty, then reason for celebration becomes clear as the disc is slipped into the player and a home cinema system of passable quality takes over. Raise the stakes by one more amazing notch with a DTS (Digital Theatre Systems) amplifier that can handle the wide dynamic range, and prepare for take off.\n\nAt moderate volume, it's a case of &quot;er.. o.. kay?&quot; but crank it up a decibel or two and something incredible happens. Studio skills burst into flower, making this toe dipping foray into the future a riveting listening experience. The DTS-Surround soundstage is balanced through the 5.1 set-up, with the rear effects speakers especially coming into their own. They provide some serious depth through the way they process the vocals, especially those fronted by Kal Cahoone, that have been mixed waaaay back as though she'd lain down the tracks in a wooden village hall on a single mic hung from the rafters. Rich bass work is handled magnificently too and comes straight out of the wood with no distortion.\n\nGlitterhouse have made a wise choice in selecting Lilium's second album to be their avant-guard, and as a test piece to see how good high-fidelity can really sound, you owe your ears this transcendental treat. Top marks.","torrent":{"xt":"urn:btih:dcc0bd77c4ce78212c97ba53139e1e995b5ebf4c","amp;dn":"Lilium+-+Short+Stories+%282003%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dcc0bd77c4ce78212c97ba53139e1e995b5ebf4c","infoHashBuffer":{"type":"Buffer","data":[220,192,189,119,196,206,120,33,44,151,186,83,19,158,30,153,91,94,191,76]},"announce":[],"urlList":[]}}