{"title":"Tom Kalin - Swoon (1992)","uid":4913787,"size":1464668160,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:dd1372356eb50babe94c0c63351d0940ceffb436&amp;dn=Tom+Kalin+-+Swoon+%281992%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"lord_terabyte","files":-1,"time":1243322261,"description":"Tom Kalin - Swoon (1992)\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0105508&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0105508&lt;/a&gt;\n &lt;a href=&quot;\nhttp://ecx.images-amazon.com/images/I/51EEJTES1XL.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://ecx.images-amazon.com/images/I/51EEJTES1XL.jpg&lt;/a&gt;\n\nBY ROGER EBERT /  November 13, 1992\n\n`Swoon&quot; reopens once again the notorious thrill-killing of Bobby Frank, whose murder in the 1920s became an international scandal when it was revealed that two rich young Chicago homosexuals, Richard Loeb and Nathan Leopold Jr., had committed the crime. Their motives were chilling: They wanted to do it simply to prove to themselves that they were smart enough to get away with it. Leopold and Loeb escaped the death penalty only because of an impassioned defense by Clarence Darrow, the best-known defense attorney of his time, who argued they were insane, and used their homosexuality as proof of insanity.\n\nThe case has been made into two previous movies - Alfred Hitchcock's &quot;Rope&quot; (1948) and Richard Fleisher's &quot;Compulsion&quot; (1959), but both to one degree or another played down the topic of homosexuality. This new version by writer-director Tom Kalin plays it up, sometimes in ways that are fairly disturbing, as when he seems to linger on the ways the dominant Loeb was able to control the more submissive Leopold by using sex as a weapon.\n\nThe movie, shot in black and white, has the look of modern men's fashion photography, and Kalin deliberately allows anachronistic props into the frame (a TV channel changer and a push-button phone, for example) to make the film's reality level more ambiguous. This is a period picture that knows it is a period picture, and is also aware of later periods; there is no attempt to fix the story's attitudes in the 1920s, and there is a subtle but unmistakable level of the film that addresses the killing in terms of sadomasochistic chic. The murder of Bobby Frank is seen not as a criminal act, but as a sexual adventure that got out of hand.\n\nThe question then becomes: How should one interpret the film? Kalin does not use the argument that society is to blame, that because homosexuality was outlawed, Leopold and Loeb were somehow forced into the lapse of sanity which led to the murder. There is every indication in the film that Loeb in particular enjoyed the whole event, not just the murder, but the way it demonstrated his power over Leopold; one imagines he would have been capable of the same crime in a more permissive era, or, for that matter, if he had not been homosexual at all. He is simply an evil person.\n\nLeopold, on the other hand, is a weak one, whose relationship with Loeb is complex. Sex is a part of it. So is fear; he dreads losing the approval and friendship of this man he finds so attractive, and does what he does almost in a daze of need and apprehension. Later in a long life, he tried to redeem himself, in prison and on parole, and there was never the sense that he was as essentially evil as Loeb.\n\nWhat is the movie trying to show us? The power of sexual control, for one thing; Loeb, who is depraved, is also highly intelligent, and everything he does seems almost like an exercise, to prove that he can do it. &quot;Swoon&quot; goes much deeper than the other studies of the Frank case, because it tries to show exactly how the psychosexual balance between the two killers made a murder possible, when neither Leopold nor Loeb could possibly have killed by himself.\n\nLoeb was incapable of the act, and Leopold incapable of the desire.\n\nThis is the kind of movie that inspires discussion afterwards. It is being reviewed as an example of the new &quot;queer cinema,&quot; deliberately gay films by openly gay filmmakers, but I am not sure &quot;Swoon&quot; would have needed to be much different if the killers had been heterosexual lovers. I don't think what they did resulted from the fact that they were gay; I believe similar acts throughout history, in tolerant times and repressive ones, have been committed by all kinds of people were born without what we call the conscience (as Loeb was) or without the courage to follow it (Leopold). It is probably true that more people fall in Leopold's category than Loeb's, which is why he has always drawn more sympathy from students of the case. It is easier and more reassuring to imagine being seduced into evil, than to imagine not even knowing what evil is. \n &lt;a href=&quot;\nhttp://i672.photobucket.com/albums/vv90/tau-tau_the-egyptian-mau/sw1.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i672.photobucket.com/albums/vv90/tau-tau_the-egyptian-mau/sw1.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://i672.photobucket.com/albums/vv90/tau-tau_the-egyptian-mau/sw2.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i672.photobucket.com/albums/vv90/tau-tau_the-egyptian-mau/sw2.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://i672.photobucket.com/albums/vv90/tau-tau_the-egyptian-mau/sw3.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i672.photobucket.com/albums/vv90/tau-tau_the-egyptian-mau/sw3.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://i672.photobucket.com/albums/vv90/tau-tau_the-egyptian-mau/sw4.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i672.photobucket.com/albums/vv90/tau-tau_the-egyptian-mau/sw4.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://i672.photobucket.com/albums/vv90/tau-tau_the-egyptian-mau/sw5.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i672.photobucket.com/albums/vv90/tau-tau_the-egyptian-mau/sw5.jpg&lt;/a&gt;\n\n-------not my rip------\n\nFile Size (in bytes):...........................1,464,668,160                     \n                                                                                \n--- Video Information ---                                                       \nVideo Codec Name:...............................XviD 1.1.0 Final              \nDuration (hh:mm:ss):............................1:29:19                \nFrame Count:....................................133950             \nFrame Width (pixels):...........................608                  \nFrame Height (pixels):..........................336                  \nAspect Ratio:...................................1.810                     \nFrames Per Second:..............................25.000          \nVideo Bitrate (kbps):...........................2053                 \n......MPEG-4......B-VOP........................                    \nQuality Factor (bits/pixel)/frame:..............0.402&quot;                     \n                                                                                \n--- Audio Information ---                                                       \nAudio Codec:....................................0x0055 MPEG-1 Layer 3                   \nAudio Sample Rate (Hz):.........................48000             \nAudio Bitrate(kbps):............................121                 \nAudio Bitrate Type (&quot;CBR&quot; or &quot;VBR&quot;):............VBR            \nAudio Channel Count:............................2           \n\nFreakyflicks is a free and open community dedicated to preserving and sharing cinematic art in the digital era. Our goal is to disseminate such works of art to the widest audience possible through the channels provided by P2P technology.\n\nThe Freakyflicks collection is limited to those films that have played an exceptional role in the history of cinema and its progression in becoming a great art. Films that are usually described as classic, cult, arthouse and avant-garde.\n\nIf you have films that fit this description feel free to share them and participate in our community. All you need do is include this tag in your upload and join us at the forum to announce your release.\n\n\n'If we all seed just 1:1, give at least what we take, this torrent will NEVER DIE ","torrent":{"xt":"urn:btih:dd1372356eb50babe94c0c63351d0940ceffb436","amp;dn":"Tom+Kalin+-+Swoon+%281992%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dd1372356eb50babe94c0c63351d0940ceffb436","infoHashBuffer":{"type":"Buffer","data":[221,19,114,53,110,181,11,171,233,76,12,99,53,29,9,64,206,255,180,54]},"announce":[],"urlList":[]}}