{"title":"Olympus Has Fallen.flv","uid":8299647,"size":309570842,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:dd514bdd48277e36c81fae9b40b794f081acecc1&amp;dn=Olympus+Has+Fallen.flv&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"globeplus","files":-1,"time":1364238050,"description":"* FLV h264Codec  * CAM  * 01H50M17S  * 640x270  * 40 frames  * Audio: mp4a 44100Hz\n\n\n* Plot :\n\nFormer U.S. Army Ranger Mike Banning (Gerard Butler) is now a Secret Service agent assigned to head the Presidential Detail. He maintains a personal, friendly relationship with President Benjamin Asher (Aaron Eckhart), First Lady Margaret Asher (Ashley Judd) and particularly their son Connor Asher (Finley Jacobsen). On a drive from Camp David on the snowy night of December 22, 2010, the car transporting the President and First Lady crashes; Banning saves Benjamin, but Margaret dies.\n\nEighteen months later, Banning works at the Treasury Department within eyesight of the White House, and wants to return to being a Secret Service agent on the Presidential detail, but Asher does not allow this as Banning brings up memories of the night Margaret died. During a meeting at the White House on July 5, 2012 between Asher and the South Korean Prime Minister, a Korean group leads a guerrilla attack against the White House. The assailants include an airplane attack against Washington D.C. by a stolen USAF AC-130 gunship, land forces disguised as citizens which initiate a car bomb attack, traitors within the security detail of the South Korean Prime Minister, and the current head of the Prime Minister's Detail, Dave Forbes (Dylan McDermott), who reveals himself to be a traitor. The assault ends with the Koreans capturing the White House and holding the President and several top officials hostage in the White House bunker, where they kill the South Korean Prime Minister. Agent Roma (Cole Hauser) informs Lynne Jacobs (Angela Bassett), the head of the Secret Service, that &quot;Olympus has fallen&quot; before getting killed.\n\n\n\n* enjoy ...","torrent":{"xt":"urn:btih:dd514bdd48277e36c81fae9b40b794f081acecc1","amp;dn":"Olympus+Has+Fallen.flv","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dd514bdd48277e36c81fae9b40b794f081acecc1","infoHashBuffer":{"type":"Buffer","data":[221,81,75,221,72,39,126,54,200,31,174,155,64,183,148,240,129,172,236,193]},"announce":[],"urlList":[]}}