{"title":"Forensic Chemistry Handbook","uid":14585464,"size":6880332,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:dd9c1d6f9ca59c14615691079ac4380440df465a&amp;dn=Forensic+Chemistry+Handbook&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1462918360,"description":"Forensic Chemistry Handbook - Lawrence Kobilinsky (Wiley, 2012).pdf\r\n\r\nISBN 978-0-471-73954-8\r\n\r\nA concise, robust introduction to the various topics covered by the discipline of forensic chemistry\r\n\r\nThe Forensic Chemistry Handbook focuses on topics in each of the major chemistry-related areas of forensic science. With chapter authors that span the forensic chemistry field, this book exposes readers to the state of the art on subjects such as serology (including blood, semen, and saliva), DNA/molecular biology, explosives and ballistics, toxicology, pharmacology, instrumental analysis, arson investigation, and various other types of chemical residue analysis. In addition, the Forensic Chemistry Handbook:\r\n\r\nCovers forensic chemistry in a clear, concise, and authoritative way\r\n\r\nBrings together in one volume the key topics in forensics where chemistry plays an important role, such as blood analysis, drug analysis, urine analysis, and DNA analysis\r\n\r\nExplains how to use analytical instruments to analyze crime scene evidence\r\n\r\nContains numerous charts, illustrations, graphs, and tables to give quick access to pertinent information\r\n\r\nMedia focus on high-profile trials like those of Scott Peterson or Kobe Bryant have peaked a growing interest in the fascinating subject of forensic chemistry. For those readers who want to understand the mechanisms of reactions used in laboratories to piece together crime scenes—and to fully grasp the chemistry behind it—this book is a must-have","torrent":{"xt":"urn:btih:dd9c1d6f9ca59c14615691079ac4380440df465a","amp;dn":"Forensic+Chemistry+Handbook","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dd9c1d6f9ca59c14615691079ac4380440df465a","infoHashBuffer":{"type":"Buffer","data":[221,156,29,111,156,165,156,20,97,86,145,7,154,196,56,4,64,223,70,90]},"announce":[],"urlList":[]}}