{"title":"Factorio 0.3.0 64bit","uid":8320129,"size":36426824,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:ddd583e790c7a879e5bc7f3bca533f2d358d485f&amp;dn=Factorio+0.3.0+64bit&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"razor1470","files":-1,"time":1364653563,"description":"Enjoy!\n\n\nFeatures:\nAdded walls. (Walls are made from stone bricks, these are created from stone in the furnace.)\nGame updates are using timer event. The program keeps 60 game updates even with FPS &lt; 60 or FPS &gt; 60. The &quot;catchup rate&quot; is configurable. When the FPS drops very low this stops having the effect.\nStoring console history in the player data.\nGraphics:\nNew tree graphics (8 dry trees 12 big trees)\nNew inserter graphics\nNew laser turret and gun turret graphics\nBullet particles for gun turret\nNew solar panel graphics\nLighter stone furnace graphics\nNew logistic robot graphics\n\nBugfixes:\nFixed crash when restarting the game with technology gui opened.\nFixed crafting queue properties when saved during crafting.\nFixed laser turret not consuming energy in idle state.\nSplitter has maximum memory of 5 items when forced to send items on one side because the other one is blocked. This means that when left is block for a long time, and then both are free, the right will get mostly 5 items before it is splitted 1:1 again.\nFixed that the electric pole has the same orientation all the time (regardless connections)\n\nGui:\nRemoved the text length limit from the input console.\nWrapping of the console text in the game.\n\nModding: (These changes are not compatible with the old mods! We will post documentation update on the wiki soon)\nMods are self sustainable folders now. They contain the prototype definitions, graphics, sounds, locale, scenarios or campaigns.\nMods Gui in the game to enable / disable mods and change their ordering.\nThe default game contents is treated as a mod (called base).\nPrototype definitions are generated by Lua scripts (no json anymore). Mods can manipulate the definitions from previous mods.\nMods can have control.lua script that supplements / changes the behavior of the default scenario script.\nMultiple running scripts (from the mods) can communicate with each other using interfaces.\nGeneral furnace energy source specification in json (so it can be electric)\nStarted to use the name of the recipe, this allows different recipes for the same product. Having different recipes for the same product for player crafting is not tested (regarding the auto crafting)\nTranslation files are merged properly.\nDefault english fallback for translations.\n\nScripting: (Exact scripting changes will be documented on the wiki soon.)\nSimple way to add gui elements using script.\nDivided the player and its character, some functions that are not directly connected with the charater (goal description, printing etc) are accessible from the player object, the rest from the charater. The access to character is game.player.character\nThe migration script runs before the control.lua is loaded and can be used to reload scripts from the original scenario this is used to solve the issue of incompatibile scripts in the save game.\nMerged onunitdied and onplayerdied to onentitydied\nCheck for positive addition in the LuaInventory::insert method\nAdded LuaInventory::remove method\nAdded LuaInventory::getcontents method\nSimplier access to player from game object (game.player instead of game.getplayer())\nAdded LuaRecipe::reload method\nAdded force parameter in createentity so player can specify the owner of the created entity (was always enemy now)\nAdded way to change force of entity and damage entity (damaging is different then sethealth).\nPosition doesn't need to be in format {x = 34, y = 7}, the format {34 ,7} works as well, the same with bounding box.\nAdded simple interface for the Freeplay that allows manipulating the attacks from mod scripts.\nScripts receive only events they have subscribed to.\nScripts can emit their own events (for instance Freeplay emits an event whenever it starts the attack).\n","torrent":{"xt":"urn:btih:ddd583e790c7a879e5bc7f3bca533f2d358d485f","amp;dn":"Factorio+0.3.0+64bit","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ddd583e790c7a879e5bc7f3bca533f2d358d485f","infoHashBuffer":{"type":"Buffer","data":[221,213,131,231,144,199,168,121,229,188,127,59,202,83,63,45,53,141,72,95]},"announce":[],"urlList":[]}}