{"title":"Doctor Who (2005) Season 1-6 and Specials for iPod Classic","uid":7763836,"size":14591456160,"categoryP":"video","categoryS":"handheld","magnet":"?xt=urn:btih:e1505f4edb8f906295850aba36ef552b827dba2c&amp;dn=Doctor+Who+%282005%29+Season+1-6+and+Specials+for+iPod+Classic&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"0victor0","files":98,"time":1351312269,"description":"These are files optimized for the Classic iPod, specifically the iPod Classic 5G. They are MP4s.\n\nIt contains Season 1-6 and the Specials, all widescreen and a nice clear picture (with the exception of a few specials that were low quality when I found them. These are just a couple of the short 3 or 4 minute specials that are TV Rips such as the Children in Need charity mini episodes. The rest are DVD or BluRay Rips.). All the Specials and episodes have been tagged in iTunes so that they will play when they're supposed to. All you have to do is add them in iTunes, and tell iTunes that they are TV episodes.\n\nI have added the description of each episode in iTunes, as well as the original broadcast date.\n\nI plan on uploading Season 7 when it is finished, for now however, there is no Season 7 nor is the S7 Christmas special in this torrent. I decided that there was no point in adding everything that was released so far since the season is in the middle of being broadcast.\n\nIf you notice any issues with any files, please leave a comment. I've tried to make sure that there are no issues, but I haven't had the chance to watch through all the converted episodes.\n\nThe reason for uploading this is that when I went looking for some Doctor Who for my iPod, I noticed that the available torrents where low quality and inconsistent. I decided to convert it myself, and here we are.\n\nI had converted the video at various bitrates to find the perfect blend of quality versus size. I tried 200kbps, I even tried 1000kbps. I found that there was nearly no difference between 300kbps and 1000kbps on such a small screen. I would have had to convert it at 600 or 700kbps in order to get the quality better, and the visual difference was unnoticable 99% of the time, and barely noticable the other 1% of the time. And converting it at such a high bitrate doubled the size. I decided to stick with 300kbps. This may change if I ever have to use a lower quality source, however for high quality DVD Rips and HD BD Rips, this provides a clear, consistant picture.\n\n\n\nThis torrent is on a Seedbox, so there should be no issues with speed. I'll be leaving it on there for a while, until there's a healthy Seed pool. This is my first torrent, so if there are any problems, I apologize.\n\nI hope you enjoy, and remember, if you like the show, buy it!\n\n\n(Now for a little technical info on the rips):\n\n\nThese are converted using HandBrake, with custom settings. I rip the video with an average bitrate of 300kbps at 320x192, audio is AAC 160kbps.\n\nVideo Codec: H.264","torrent":{"xt":"urn:btih:e1505f4edb8f906295850aba36ef552b827dba2c","amp;dn":"Doctor+Who+%282005%29+Season+1-6+and+Specials+for+iPod+Classic","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e1505f4edb8f906295850aba36ef552b827dba2c","infoHashBuffer":{"type":"Buffer","data":[225,80,95,78,219,143,144,98,149,133,10,186,54,239,85,43,130,125,186,44]},"announce":[],"urlList":[]}}