{"title":"Atrapa.El.Fuego.Spanish.DVDRip.","uid":5139065,"size":733116416,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e17aaa68116a85eb69048ee8e480600b7ed37bb1&amp;dn=Atrapa.El.Fuego.Spanish.DVDRip.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"zurera","files":1,"time":1256748461,"description":"Reparto: Tim Robbins, Derek Luke\nDirector: Phillip Noyce\nProductor: Tim Bevan, Eric Fellner, Anthony Minghella, Johnny Breedt\nDuraciÃƒÂ³n: 01:41:00\nEstreno: viernes 19 enero 2007\nGÃƒÂ©nero: Intriga\nPaÃƒÂ­s: EE.UU.,Reino Unido,Francia\nDistribuidora: United International Pictures\nIdioma: EspaÃƒÂ±ol\nSinopsis:\n\nPatrick Chamusso es un hÃƒÂ©roe de carne y hueso de la historia reciente de SudÃƒÂ¡frica. Patrick ama tiernamente a su esposa Precious y a sus dos hijas pequeÃƒÂ±as. Trabaja de encargado en la refinerÃƒÂ­a Secunda, sÃƒÂ­mbolo de la autosuficiencia de SudÃƒÂ¡frica en una ÃƒÂ©poca en la que el resto del mundo se alzaba contra el opresivo sistema del apartheid.\n\n\nEl astuto y carismÃƒÂ¡tico coronel del Departamento de Seguridad, Vos, intenta mantener el orden en situaciones explosivas cada vez mÃƒÂ¡s frecuentes desde que el ilegalizado Congreso Nacional Africano reagrupa a la poblaciÃƒÂ³n negra contra el apartheid. TambiÃƒÂ©n le preocupa la seguridad de su esposa y de sus dos hijas. El mundo en el que se mueve el coronel poco tiene que ver con el de la familia Chamusso.\n\n\nDe pronto, la tranquila vida de Patrick se desmorona cuando es acusado de sabotear la refinerÃƒÂ­a Secunda y detenido en junio de 1980. Tiene una coartada, pero no quiere que Precious se entere de que le fue infiel hace tiempo, y ademÃƒÂ¡s desea conservar su trabajo. No estÃƒÂ¡ preparado para soportar los brutales interrogatorios a los que es sometido por los hombres de Vos. El acoso del coronel crece y Patrick ve con desesperaciÃƒÂ³n cÃƒÂ³mo encarcelan y torturan a Precious. La policÃƒÂ­a no tarda en soltar a la pareja, pero los objetivos de Patrick ya no son los mismos. Deja a su familia y se une al CNA.\n\n\nEl hombre tranquilo es ahora miembro de una organizaciÃƒÂ³n armada que lucha para defender a su pueblo y a su paÃƒÂ­s. Acaba por planear un importante y peligroso golpe contra la refinerÃƒÂ­a Secunda, arriesgando su vida y su futuro. Ha llegado la hora de que las cosas cambien para Patrick y su familia, y para toda SudÃƒÂ¡frica.","torrent":{"xt":"urn:btih:e17aaa68116a85eb69048ee8e480600b7ed37bb1","amp;dn":"Atrapa.El.Fuego.Spanish.DVDRip.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e17aaa68116a85eb69048ee8e480600b7ed37bb1","infoHashBuffer":{"type":"Buffer","data":[225,122,170,104,17,106,133,235,105,4,142,232,228,128,96,11,126,211,123,177]},"announce":[],"urlList":[]}}