{"title":"Amnesia - The Dark Descent (2-click run)(requested)","uid":8486008,"size":1013837630,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:e193d67b6a60534cb35749a505334eb12fe4ebce&amp;dn=Amnesia+-+The+Dark+Descent+%282-click+run%29%28requested%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"The_Duck1","files":-1,"time":1368863961,"description":"No need for serials and cracks to get the full version, (already done it for you).\nNo unnecessary registry changes. \nNo boring installation of tool-bars in your browser or other unwanted things.\nYou can even run this torrent from an USB-Stick.\nEasy Uninstall with the Windows control panel.\nChoose where you want to put the files on your PC. \nThese are a few things that makes a '2-click run' version a better version.\n\nAmnesia: The Dark Descent is a survival horror video game by Frictional Games, who previously developed the Penumbra series.\nAmnesia is an adventure game played from a first-person perspective. \nThe game retains the physical object interaction used in the Penumbra series, allowing for physics-based puzzles and interactions such as opening doors and fixing machinery.\nFew in-game objects are operated by toggle; to open a door, for instance, the player must hold down a mouse button and then push (or pull) the mouse. \nThis gives the player stealth, allowing them to peek out a barely-opened door or open it slowly to sneak away, \nbut also adds to the player's sense of helplessness, as it is now entirely possible to attempt to push open a &quot;pull&quot; door whilst danger approaches from behind.\nIn late August in the year 1839, Daniel, a young man from London, awakens in the dark halls of the Prussian Brennenburg Castle with little to no memory about himself or his past.\nAll he can remember is his name, that he lives in Mayfair and that something is hunting him.\nShortly after awakening, Daniel discovers a note written to himself, from which he learns that he has deliberately erased his own memory, and that he needs to descend into the Inner Sanctum of the castle to kill the Baron, Alexander......","torrent":{"xt":"urn:btih:e193d67b6a60534cb35749a505334eb12fe4ebce","amp;dn":"Amnesia+-+The+Dark+Descent+%282-click+run%29%28requested%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e193d67b6a60534cb35749a505334eb12fe4ebce","infoHashBuffer":{"type":"Buffer","data":[225,147,214,123,106,96,83,76,179,87,73,165,5,51,78,177,47,228,235,206]},"announce":[],"urlList":[]}}