{"title":"A Perfect Stranger by Danielle Steel (Retail) {Rose88}","uid":10711674,"size":1949005,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e19a5bf73b9af17f2158548ba36aa7b1f4a7157a&amp;dn=A+Perfect+Stranger+by+Danielle+Steel+%28Retail%29+%7BRose88%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"TheRose88","files":-1,"time":1407363508,"description":"Title: A Perfect Stranger\nAuthor: Danielle Steel\nPublished: Feb 2009\nPublisher: Dell\nISBN: 978-0-307-56631-7\nFormat: Epub (Retail)\nLanguage: English\nGenres: Fiction, Romance\n\nThe only daughter of a European banking dynasty, Raphaella had always been sheltered from the world. Married to a much older American, she was kept in the privacy of great luxury, tended to by servants, watched over by bodyguards. She was the beautiful dark-eyed woman the young lawyer from San Francisco, Alexander Hale, saw sitting alone one misty evening. Before he could approach her, she rushed away into the garden. She was the &quot;perfect stranger&quot; he couldn't forget. When they met again their lives would change forever.\n\nRaphaella de Mornay-Malle grew up in the sheltered world of the Mediterranean aristocracy under the careful tutelage of her stern father and her dutiful duennas. Married at age 18 to a much older American, John Henry Phillips, Raphaella fills her life with his wishes and desires. But when John is incapacitated by a series of strokes, she finds her world shrinking to the size of a sickbed.\n\nThough Raphaella has an uncommonly strong sense of her duty in marriage, she can not ignore her attraction for Alexander Hale, a handsome acquaintance. As John's condition worsens and Alex grows insistent that she acknowledge what lies between them, Raphaella faces a classic duty-versus-love dilemma.\n\n","torrent":{"xt":"urn:btih:e19a5bf73b9af17f2158548ba36aa7b1f4a7157a","amp;dn":"A+Perfect+Stranger+by+Danielle+Steel+%28Retail%29+%7BRose88%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e19a5bf73b9af17f2158548ba36aa7b1f4a7157a","infoHashBuffer":{"type":"Buffer","data":[225,154,91,247,59,154,241,127,33,88,84,139,163,106,167,177,244,167,21,122]},"announce":[],"urlList":[]}}