{"title":"CAPTAIN CREDIBLE - (2012) MOUNTAIN CLOUDBOY FLAC","uid":7201408,"size":116935506,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:e33aae48100d7e4acf116f99841272bde8150d1b&amp;dn=CAPTAIN+CREDIBLE+-+%282012%29+MOUNTAIN+CLOUDBOY+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"m1ndbl45t","files":-1,"time":1334949779,"description":"A brand new release from MINDBLAST RECORDS. Captain Credible releasing his new EP &quot;MOUNTAIN CLOUDBOY&quot; for free!\n\nMountain Cloud Boy, is not so much an EP as it is a sparsely populated planet ruled by small farm animals who are addicted to crack. But it also tells a story, a story of love, and a story of 100% scientifically proven fact:\n\nThe Spirit Seed (the legacy of mountain cloud boy begineth):\nAt the beginning of time, there was lots of cool purple shit floating around, and then suddenly. The mother-brain began to exist. It was burning with rage! Because the internet hadnÎ“Ã‡Ã–t been invented yet and it wanted to look at cute puppies on you tube. So then the mother brain collapsed into a singularity known as the spirit seed.\n\nMany years later a young boy found the spiritseed lying in the ditch by the M1, unwittingly he proceeded to insert it into his body. As if by magic his depressingly dull life was transformed into an epic adventure of crime, flaming rodents, space, and pictures of dead cats. Eventually at the age of 20 000 he died while riding an exploding unicorn in the vacuum of space without wearing a spacesuit. Yet he was reincarnated and will live forever as the Soul Turd.\n\nFEATURES\n: D IÎ“Ã‡Ã–ts mainly music\n: D Composed in windows movie maker\n: D Based on 100% factual documentation of actual spaceship missions\n: D Done by real astronauts\n: D Drums from downsampled photos of dead cats\n: D It has the word MOUNTAIN in the title\n: 0 can be duplicated ad infinitum to get rid of that pesky free space on your c: drive\n: D Is insanely, mind meltingly, awesome\n\nENJOY! www.mindblastrecords.com","torrent":{"xt":"urn:btih:e33aae48100d7e4acf116f99841272bde8150d1b","amp;dn":"CAPTAIN+CREDIBLE+-+%282012%29+MOUNTAIN+CLOUDBOY+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e33aae48100d7e4acf116f99841272bde8150d1b","infoHashBuffer":{"type":"Buffer","data":[227,58,174,72,16,13,126,74,207,17,111,153,132,18,114,189,232,21,13,27]},"announce":[],"urlList":[]}}