{"title":"Why I Left Goldman Sachs A Wall Street Story by Greg Smith (ePUB","uid":7794296,"size":911452,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e3fabde2c1526c4e50a5c4ed28dd4555bd784d13&amp;dn=Why+I+Left+Goldman+Sachs+A+Wall+Street+Story+by+Greg+Smith+%28ePUB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"azizex666","files":-1,"time":1352102485,"description":"On March 14, 2012, more than three million people read Greg Smith's bombshell Op-Ed in the New York Times titled &quot;Why I Am Leaving Goldman Sachs.&quot; The column immediately went viral, became a worldwide trending topic on Twitter, and drew passionate responses from former Fed chairman Paul Volcker, legendary General Electric CEO Jack Welch, and New York City mayor Mike Bloomberg. Mostly, though, it hit a nerve among the general public who question the role of Wall Street in society -- and the callous &quot;take-the-money-and-run&quot; mentality that brought the world economy to its knees a few short years ago. Smith now picks up where his Op-Ed left off.\n\nHis story begins in the summer of 2000, when an idealistic 21-year-old arrives as an intern at Goldman Sachs and learns about the firm's Business Principle #1: Our clients' interests always come first. This remains Smith's mantra as he rises from intern to analyst to sales trader, with clients controlling assets of more than a trillion dollars.\n\nFrom the shenanigans of his summer internship during the technology bubble to Las Vegas hot tubs and the excesses of the real estate boom; from the career lifeline he received from an NFL Hall of Famer during the bear market to the day Warren Buffett came to save Goldman Sachs from extinction-Smith will take the reader on his personal journey through the firm, and bring us inside the world's most powerful bank.\n\n\n                              Format 1 - .ePUB\n\n                              Format 2 - .Mobi\n\n                              Published - October 26th 2012\n\n                All my Ebook uploads are separated by Genre Tags \n\n \n            **Support Your Favorite Authors By Buying Their Books**\n\n\n                Check out all my Magazine and ebook uploads here.\n\n                    &lt;a href=&quot; https://thepiratebay.se/user/azizex666/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; https://thepiratebay.se/user/azizex666/&lt;/a&gt;\t","torrent":{"xt":"urn:btih:e3fabde2c1526c4e50a5c4ed28dd4555bd784d13","amp;dn":"Why+I+Left+Goldman+Sachs+A+Wall+Street+Story+by+Greg+Smith+%28ePUB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e3fabde2c1526c4e50a5c4ed28dd4555bd784d13","infoHashBuffer":{"type":"Buffer","data":[227,250,189,226,193,82,108,78,80,165,196,237,40,221,69,85,189,120,77,19]},"announce":[],"urlList":[]}}