{"title":"Ziggy Marley - Love Is My Religion [REGGAE][2007]sid]","uid":3978617,"size":88130101,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:e66e1cd603a477a3693e02e56bec9facc16f47e9&amp;dn=Ziggy+Marley+-+Love+Is+My+Religion+%5BREGGAE%5D%5B2007%5Dsid%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"sidthefish","files":15,"time":1200424850,"description":" Ziggy Marley&amp;#039;s life story is filled with changes and transitions. In fact, change has been the one constant in his life. From his earliest days, raised in Trench Town, Jamaica, to the present, he has been guided by his keen awareness and driving compassion. These qualities are the earmarks of his work and his journey.\n\nThe eldest Marley son is not one to let any moss grow under his feet. His 2006 release, Love is My Religion (Tuff Gong Worldwide), garnered a Grammy for Best Reggae Album at the 49th Annual Grammy Awards, giving him a total of four Grammys as an artist. It was his second solo album, and the first to be released independently on the Tuff Gong Worldwide label.\n\nThe album&amp;#039;s follow-up, an extended version including three live tracks, will hit the streets on December 4, 2007. A live DVD, filmed during the Love is My Religion world tour, is scheduled for release in early 2008. A bold move launched an independent distribution deal between Tuff Gong Worldwide and Ryko Distribution, allowing Marley to eschew the traditional record industry formula and big name labels.\n\n&quot;This album is from my heart,&quot; Ziggy says of the album, originally released in July 2006. Love showcases Ziggy&amp;#039;s keenly honed talents as a composer, producer, and musician. With all tracks written and produced by Ziggy, and shared production on three tracks with Grammy-winning producer Ross Hogarth, Marley also played a majority of the instruments on the album. ","torrent":{"xt":"urn:btih:e66e1cd603a477a3693e02e56bec9facc16f47e9","amp;dn":"Ziggy+Marley+-+Love+Is+My+Religion+%5BREGGAE%5D%5B2007%5Dsid%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e66e1cd603a477a3693e02e56bec9facc16f47e9","infoHashBuffer":{"type":"Buffer","data":[230,110,28,214,3,164,119,163,105,62,2,229,107,236,159,172,193,111,71,233]},"announce":[],"urlList":[]}}