{"title":"Quiet Riot - Cum On Feel The Noize (Live) (2nafish)","uid":5998207,"size":188485636,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:e6e8544bf8274618809c18593371b3ac8301c775&amp;dn=Quiet+Riot+-+Cum+On+Feel+The+Noize+%28Live%29+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1291102975,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nThis video has no logos or titles.\n\n\n&quot;Cum On Feel the Noize&quot; is a rock song originally released by Slade in 1973.\n\nWritten by Jim Lea and Noddy Holder and produced by Chas Chandler, &quot;Cum On Feel the Noize&quot; was Slade's fourth number-one single in the UK and their first to enter straight at number one. As a single from Slade, it was a follow-up to &quot;Gudbuy t'Jane&quot;, a #2-hit in the UK.\n\n&quot;Cum On Feel the Noize&quot; entered at the top slot in both the UK and Irish charts, which was quite a rare feat at the time and was the first occasion this had happened since The Beatles' &quot;Get Back&quot; in 1969. The track stayed at #1 for 4 weeks. The song went on to spend four weeks at the top of the chart in March 1973. According to Noddy Holder's autobiography, the single had half a million preorders on the days leading up to the release. Typical of Slade's releases at the time, it fared less well in the USA, where it would only peak at #98 on the Billboard Hot 100. The song actually inspired New York rock band Kiss to write their popular signature rock anthem &quot;Rock and Roll All Nite&quot;.\n\nThe song is also commonly spelled as &quot;Come On Feel the Noise&quot;, most likely due to common spelling or censorship reasons.\n\nThis was the first Slade track in which the band attempted to recreate and write about the atmosphere at their gigs. Originally, the song was titled &quot;Cum on Hear the Noize&quot;; Holder revised the title when he recalled, &quot;how I had felt the sound of the crowd pounding in my chest&quot;. Holder's 'Baby baby baby' introduction was actually just a microphone test.\n\nThe song was revived in 1983 by heavy metal band Quiet Riot, who also covered Slade's &quot;Mama Weer All Crazee Now&quot;. Quiet Riot's version of &quot;Cum On Feel the Noize&quot; went on to peak at number five on the Billboard Hot 100 on November 19, 1983. It helped make Quiet Riot's Metal Health album a number-one hit. The song's success drew huge nationwide attention to the 1980s Los Angeles metal scene. It also helped to break Slade belatedly in the US. The song was certified gold by the RIAA. Originally, Kevin DuBrow and Frankie Banali were dead set on not covering the song, because they claimed that they hated it. Instead, they decided to try to cover the song as badly as they could so the label would refuse to release it.\n\nThe Quiet Riot version is also featured in the popular video game Grand Theft Auto: Vice City by Rockstar North, which takes place in 1986. It is also featured in the video game NHL 2K8 by 2K Sports. It was used in the fake trailer &quot;The Fatties: Fart 2&quot;, which itself was attached to the film Tropic Thunder. The song is included in the soundtrack of the music video game Rock Revolution by Konami.\n\nQuiet Riot's version of &quot;Cum On Feel the Noize&quot; was ranked #80 on VH1's 100 Greatest One-Hit Wonders back in 2002, though the song was not Quiet Riot's only Top 40 hit and therefore not a true one-hit wonder. In 2009, it was named the 41st best hard rock song of all time also by VH1.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:e6e8544bf8274618809c18593371b3ac8301c775","amp;dn":"Quiet+Riot+-+Cum+On+Feel+The+Noize+%28Live%29+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e6e8544bf8274618809c18593371b3ac8301c775","infoHashBuffer":{"type":"Buffer","data":[230,232,84,75,248,39,70,24,128,156,24,89,51,113,179,172,131,1,199,117]},"announce":[],"urlList":[]}}