{"title":"The Health Wyze Report - Episode 11","uid":6982527,"size":79422291,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:e7aad41242b86923feb074b68b136fea96d564a6&amp;dn=The+Health+Wyze+Report+-+Episode+11&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mandalasarah","files":-1,"time":1327447980,"description":"In this show, we discussed how Greek's socialized medical system is amputating limbs to save money, states are linking prescription databases in spite of privacy violations, the paradoxical pattern between doctor strikes and mortality rates, and how formaldehyde is being used to straighten hair. We also talked about how Walgreens is offering vaccination gift cards, the regular flu shot now contains H1N1, and a case of amazing medicine in which fatty acid therapy can actually make somebody's chopped off fingertip grow back. We analyzed the current era of marketing to children, the way that radiation is now glorified to youngsters, how power is seen as an end unto itself, and the subliminal messages embedded into cartoons.\n\nWe exposed the F.D.A.'s pro-poisoning agenda with their approval of the botulism toxin, and their simultaneous attack on chelation therapies that can cure autism. We warned of the high levels of lead and cadmium in children's jewelry, in large part because cadmium is currently unregulated. Then, we explained how people can cure ulcers permanently with cabbage juice, a fact that was studied 60 years ago, but buried.\n\nTime: 81 Minutes, 19 Seconds. Size: 76 Mb\n\nLearn more about The Health Wyze Report at http://healthwyze.org/. The Health Wyze Report releases this media presentation to the public, and encourages the sharing of it, so long as it is not remade into a form that maligns our work, and so long as conspicuous credit is given for its authorship, as specified in our Liberal Copyright Policy.","torrent":{"xt":"urn:btih:e7aad41242b86923feb074b68b136fea96d564a6","amp;dn":"The+Health+Wyze+Report+-+Episode+11","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e7aad41242b86923feb074b68b136fea96d564a6","infoHashBuffer":{"type":"Buffer","data":[231,170,212,18,66,184,105,35,254,176,116,182,139,19,111,234,150,213,100,166]},"announce":[],"urlList":[]}}