{"title":"HISTORY OF POP AND ROCK MUSIC - part 002","uid":6495616,"size":187014306,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:e8adc7dcfb447f8c19949f6358a70dc9b6e9971e&amp;dn=HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+002&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"zlatkopupovac","files":-1,"time":1309053960,"description":"                            PART 02\n\n\n                 SHOCKING BLUE  -  Venus  (1970)\n                 CHRISTIE  -  Yellow river  (1970)\n                 MUNGO JERRY -  In The Summertime  (1970)\n\n\n\n            &quot;Shocking Blue&quot; was a Dutch rock band from The Hague that existed from 1967 to 1974. Their biggest hit, &quot;Venus,&quot; went to #1 on the Billboard Hot 100 in February 1970.&quot;Venus&quot; is the only song in the history of the Billboard charts to hit number one three times (first time on February 7, 1970, second time on June 20, 1981 by &quot;Stars On 45&quot;; third time on September 6, 1986 by Bananarama).\n             Christie was a British pop band formed at the end of the 1960s.In addition to Jeff Christie - vocalist, bassist and songwriter, they initially included guitarist Vic Elmes and drummer Mike Blakely who happened to be the younger brother of The Tremeloes' Alan Blakely.In 1969, Christie offered his composition &quot;Yellow River&quot; to The Tremeloes. They recorded it to release as a single, but when they changed their minds they allowed Christie to use the backing track themselves. The result was a UK number one hit in May 1970, and subsequently #23 in the U.S.&quot;San Bernadino&quot;, another highly commercial song, gave them another Top Ten hit, but after one further minor hit &quot;Iron Horse&quot;, they faded from contention. The second and last album, &quot;For All Mankind&quot; was issued only on the Continent..\n            &quot;Mungo Jerry&quot; is the name of a pop group whose greatest success was in the early 1970s, though they have continued throughout the years with an ever-changing line-up, always fronted by Ray Dorset. They are remembered above all for their classic hit &quot;In the Summertime&quot;, the evergreen &quot;Lady Rose&quot; and the rock smash &quot;Alright Alright Alright&quot;. Their name was inspired by the poem &quot;Mungojerrie and Rumpelteazer&quot;, from T.S. Eliot's Old Possum's Book of Practical Cats.","torrent":{"xt":"urn:btih:e8adc7dcfb447f8c19949f6358a70dc9b6e9971e","amp;dn":"HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+002","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e8adc7dcfb447f8c19949f6358a70dc9b6e9971e","infoHashBuffer":{"type":"Buffer","data":[232,173,199,220,251,68,127,140,25,148,159,99,88,167,13,201,182,233,151,30]},"announce":[],"urlList":[]}}