{"title":"The Romantics - What I Like About You [promo].VOB","uid":8769407,"size":57191316,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:e8c699255e5af1cd82c17b298bed371fda87dbc5&amp;dn=The+Romantics+-+What+I+Like+About+You+%5Bpromo%5D.VOB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SgtRlee","files":-1,"time":1375414835,"description":"The Romantics - What I Like About You [promo].VOB\n\n\nHQ rare promo music video from a promo DVD. &quot;What I Like About You&quot; is a song by American rock music band The Romantics. The song, written by Romantics members Wally Palmar, Mike Skill and Jimmy Marinos is featured on the band's self-titled 1980 debut album, and was also released as a single. Marinos, the band's drummer, is the lead vocalist on the song. The band filmed a music video for the song that appeared frequently on MTV during the early 1980s. \n\n&quot;What I Like About You&quot; was written by the group around a guitar part by Skill. The song's &quot;Hey, uh-huh-huh&quot; refrain was influenced by The Yardbirds' &quot;Over Under Sideways Down&quot; and Chuck Berry's &quot;Back in the U.S.A.&quot;. The song's riff is slightly similar to Neil Diamond's &quot;Cherry, Cherry&quot; and The Standells hit &quot;Dirty Water.&quot; The song is frequently mis-identified as being recorded by the Kinks due in part to its mid 60's British pop rock sound. The Romantics recorded the song and the accompanying album at Coconuts recording studio in Miami Beach.\n\nWhen first released, &quot;What I Like About You&quot; was already a popular song on the Romantics' concert playlist. In terms of record sales and radio airplay, however, the song was only a moderate success at the time of its release, reaching only #49 on the Billboard Hot 100. The song did quite well in Australia however, reaching #2 on the Australian Singles Chart (Kent Music Report) on its initial release. It was only towards the end of the 1980s, after the song had been licensed for use in television commercials for Budweiser beer, that &quot;What I Like About You&quot; grew to become one of the most popular rock anthems of all time.\n\n&quot;What I Like About You&quot; has become a staple of modern rock, appearing on numerous compilation albums of 1980s pop and rock music hits and heard in frequent rotation on modern rock and classic rock radio. The song is also often played at sporting events, parties, and at bars and clubs. In addition to Budweiser, the song has also been heard promoting products, services, and institutions including the Los Angeles Dodgers baseball team, Barbie toy dolls, SeaWorld and T.G.I. Friday's restaurants. The song was also featured in TV commercials for Hampton Inn, Esurance, Papa John's Pizza, Toon Disney, and Toyota as recently as 2008. The song was also included in the films Richie Rich (1994), Shrek 2 (2004), Surf's Up (2007) and Marmaduke (2010).\n\nThe Romantics is an American new wave band from Detroit, Michigan, formed in 1977. The band adopted the name &quot;The Romantics&quot; because they formed on Valentine's Day, 1977. The Romantics achieved popularity in the United States, Canada, parts of Asia, Australia, Europe, and Latin America during the first half of the 1980s on the strength of the band's songs and music videos. They were influenced by 1950s American rock and roll and 1960s American garage rock as well as British Invasion music.\n(video has a semi-transparent white &quot;vh1 classic&quot; logo at the bottom right)\n\n\n    &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/What_I_Like_About_You_(song)&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/What_I_Like_About_You_(song)&lt;/a&gt; \n      &lt;a href=&quot;\nhttp://bayimg.com/KAocMAaeB&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/KAocMAaeB&lt;/a&gt; \n   \n\n\nFile properties info using Media Player Classic:     \n   Video: MPEG2 Video 480x480 (4:3) 29.97fps 2420kbps\n   Audio: MPEG Digital Audio 44100Hz stereo 224kbps\n   Duration: 00:02:50\n\n\n\n\n*Install the &quot;Media Player Classic&quot; player if you can't play this file, \nor for better visual and audio quality playback of all your videos. \nIt's 100% free to download and use. Latest stable build is v1.6.8\n\n*Media Player Classic Home Cinema*         &lt;a href=&quot;\nhttp://mpc-hc.sourceforge.net/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://mpc-hc.sourceforge.net/&lt;/a&gt; \n\nSgtRlee (Sgt.R.Lee) \n\t","torrent":{"xt":"urn:btih:e8c699255e5af1cd82c17b298bed371fda87dbc5","amp;dn":"The+Romantics+-+What+I+Like+About+You+%5Bpromo%5D.VOB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e8c699255e5af1cd82c17b298bed371fda87dbc5","infoHashBuffer":{"type":"Buffer","data":[232,198,153,37,94,90,241,205,130,193,123,41,139,237,55,31,218,135,219,197]},"announce":[],"urlList":[]}}