{"title":"The Fathers of the Church: Intro to the First Christian Teachers","uid":15623809,"size":6464070,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e8de7b9ab04016ac20f18f7a8ca140b4866ee81c&amp;dn=The+Fathers+of+the+Church%3A+Intro+to+the+First+Christian+Teachers&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"catholicstuff","files":6,"time":1471895312,"description":"Mike Aquilina - The Fathers of the Church: An Introduction to the First Christian Teachers (EPUB, MOBI, PDF)\r\n\r\nWe hear the voices of the early Church Fathers even today. Their teachings, their guidance, their insights, and their sacrifice shaped the Catholic Church. They defined the canon of Scripture. They developed our creeds and forms of worship. They defined Christianity's distinctive moral sense.\r\n\r\nBut who were they? What can we learn from their ancient teachings? What can the Fathers teach the 21st century - about holiness, culture, faith, and the Gospel.\r\n\r\nThis is the definitive resource for anyone interested in learning about the Church Fathers and their legacy. Ideal for RCIA, catechists, clergy, as well as lay Catholics who want to learn more about the great teachers of early Christianity.\r\n\r\nIn this new and extensively updated Third Edition, you'll find:\r\n\r\n    New! Twenty Church Fathers never before covered in this series\r\n    Nearly 75 more pages of information on the early Church!\r\n    New! Many poets of ancient Christianity, whose hymns we still sing today.\r\n    An extensively revised introduction\r\n    The Mothers of the Church and their impact\r\n    Research-friendly references and citations, topical index, timeline, and detailed bibliography\r\n\r\nThe Fathers of the Church, first published a decade ago, has become the standard popular introduction to the great teachers of early Christianity. Now, this new edition presents more material from more of the Fathers -- including authors from little-known traditions of Egypt, East Syria, North Africa, and the lands that make up modern Iran and Iraq. Also new with this edition is a section on selected &quot;Mothers of the Church,&quot; holy women from Christian antiquity.\r\n\r\nThis expanded edition features full references and citations, a topical index, detailed bibliography, and ancient texts available in English for the first time in more than a century.\r\n\r\nThe Fathers of the Church is an excellent place to pass on those same teachings and traditions -- long established as an indispensable reference tool for clergy, seminarians, RCIA candidates, and lay Catholics who want to strive to live up to the &quot;Faith of Our Fathers.&quot;\r\n\r\n---\r\n\r\nIf you enjoy this media, please seed and purchase a physical copy to support the producers and share with family and friends. \r\n\r\nFor more Catholic ebooks, audiobooks, audio presentations, movies &amp; video, visit \nhttps://thepiratebay.org/user/catholicstuff/","torrent":{"xt":"urn:btih:e8de7b9ab04016ac20f18f7a8ca140b4866ee81c","amp;dn":"The+Fathers+of+the+Church%3A+Intro+to+the+First+Christian+Teachers","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e8de7b9ab04016ac20f18f7a8ca140b4866ee81c","infoHashBuffer":{"type":"Buffer","data":[232,222,123,154,176,64,22,172,32,241,143,122,140,161,64,180,134,110,232,28]},"announce":[],"urlList":[]}}