{"title":"Primus - Jerry Was a Race Car Driver [promo].VOB","uid":9932161,"size":143757312,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:e8f2799f025822b985fe84a88fd5e2a99d3159fe&amp;dn=Primus+-+Jerry+Was+a+Race+Car+Driver+%5Bpromo%5D.VOB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SgtRlee","files":-1,"time":1397116951,"description":"Primus - Jerry Was a Race Car Driver [promo].VOB\n\n\nHQ rare promo music video from a promo DVD. &quot;Jerry Was a Race Car Driver&quot; is the first single of Primus's 1991 album Sailing the Seas of Cheese. The song tells the stories of two characters, Jerry, an ill-fated race car driver who collides with a telephone pole while driving intoxicated (hence the use of &quot;was&quot;, in the title) and Captain Pierce, a retired fireman. \n\nDespite popular belief, &quot;Jerry Was a Race Car Driver&quot; was not the first ever Primus single. That credit goes to &quot;John the Fisherman&quot; from 1990's indie release Frizzle Fry. Because &quot;John the Fisherman&quot; was released on an indie record it had limited popularity, whereas &quot;Jerry Was a Race Car Driver&quot; was released on a major label, allowing for greater availability at record stores and more media exposure.\n\nThe music is built around Les Claypool's funky idiosyncratic finger-tapped bass line and silly story-telling style vocals, as well as eccentric guitar accompaniment from Larry LaLonde, including a guitar solo (which has been included in many of the Top 100 guitar solos lists on the Internet and in magazines), and Tim Alexander's tight drumming. The chorus is followed by a metallic riff that mimics an engine revving. The result was a catchy song that helped Primus expand their fanbase. &quot;Jerry Was a Race Car Driver&quot; received heavy airplay on rock radio, and peaked at number 23 on the Modern Rock Tracks in 1991.\n\nA music video was also created for the song. The video begins with Bob Cock getting an order of nachos, only to drop them after a collision with Larry LaLonde on a skateboard. The rest of the video cuts between scenes of the band playing an out-of-control gig in a small club (Phoenix Theater), shots of the nachos being zoomed into, and race car footage. At the end, the camera zooms in on the cheese, and there is a claymation segment which features many of the creatures on the cover of the Sailing the Seas of Cheese album, then zooms back out to the cheese, and a pit bull sniffs it, closing the video. In the video Les Claypool's Rainbow Bass can be seen without its upper horn. This is because the bass was not balanced well which caused Les to send it back to get its signature scroll horn attached. The video was created before the modification of the bass. The video became an MTV favorite and is still sometimes played.\n\nPrimus is an American rock band based in San Francisco, California, currently composed of bassist/vocalist Les Claypool, guitarist Larry &quot;Ler&quot; LaLonde and drummer Tim &quot;Herb&quot; Alexander. Primus originally formed in 1984 with Claypool and guitarist Todd Huth, later joined by Jay Lane, though the latter two departed the band at the end of 1988. Featuring LaLonde and drummer Tim &quot;Herb&quot; Alexander, Primus recorded their debut Suck on This in 1989, followed by four studio albums: Frizzle Fry, Sailing the Seas of Cheese, Pork Soda, and Tales from the Punchbowl. Alexander left the band in 1996, replaced by Bryan &quot;Brain&quot; Mantia, and Primus went on to record the original theme song for the TV show South Park and two more albums, Brown Album and Antipop, before declaring a hiatus in 2000.\n\nIn 2003, Claypool and LaLonde reunited with Alexander and released a DVD/EP, Animals Should Not Try to Act Like People, before touring sporadically through 2009. In 2010, it was announced that Lane had rejoined Primus, replacing Alexander, and the band released their eighth album, Green Naugahyde, in 2011. In 2013, Lane left the band to focus on other projects, and Tim Alexander rejoined once again.\n\nPrimus is characterized by its irreverent, quirky approach to music. They have released some of their records on Claypool's Prawn Song Records label, a parody of Led Zeppelin's Swan Song label.\n(video does not have any logos)\n\n\n    &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Jerry_Was_a_Race_Car_Driver&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Jerry_Was_a_Race_Car_Driver&lt;/a&gt; \n      &lt;a href=&quot;\nhttp://bayimg.com/LanAbaAFh&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/LanAbaAFh&lt;/a&gt; \n   \n\n\nFile properties info using Media Player Classic:     \n   Video: MPEG2 Video 720x576 (4:3) 25fps 8000kbps\n   Audio: Dolby Digital AC3 48000Hz stereo 192kbps    \n   Duration: 00:03:38\n\n\n\n\n*Install the &quot;Media Player Classic&quot; player if you can't play this file, \nor for better visual and audio quality playback of all your videos. \nIt's 100% free to download and use. Latest stable build is v1.7.3\n\n*Media Player Classic Home Cinema*         &lt;a href=&quot;\nhttp://mpc-hc.sourceforge.net/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://mpc-hc.sourceforge.net/&lt;/a&gt; \n\nSgtRlee (Sgt.R.Lee) \n\t","torrent":{"xt":"urn:btih:e8f2799f025822b985fe84a88fd5e2a99d3159fe","amp;dn":"Primus+-+Jerry+Was+a+Race+Car+Driver+%5Bpromo%5D.VOB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e8f2799f025822b985fe84a88fd5e2a99d3159fe","infoHashBuffer":{"type":"Buffer","data":[232,242,121,159,2,88,34,185,133,254,132,168,143,213,226,169,157,49,89,254]},"announce":[],"urlList":[]}}