{"title":"Architextiles (Architectural Design)","uid":6518904,"size":8735323,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e9ae11524c6480ab9b36d67716d43b6e7d759edf&amp;dn=Architextiles+%28Architectural+Design%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"_F1_","files":-1,"time":1309932169,"description":"Mark Garcia - Architextiles (Architectural Design)\n Wiley | 2007 | ISBN: 0470026340 | English | 139 pages | PDF | 15.5 MB\n\n Focusing on the intersections between textiles and architectural design, this title communicates the full range of possibilities for a multidisciplinary design hybrid. It examines the generative concepts, forms, patterns, materials, processes, technologies and practices that are driving this cross-fertilisation in contemporary urban and architectural design. Architextiles represent a transition stage in the reorientation of spatial design towards a more networked, dynamic, interactive, communicative and multifunctional state. The paradigms of fashion and textile design, with their unique, accelerated aesthetics and ability to embody a burgeoning, composite and complex range of properties such as lightness, flow, flexibility, surface, complexity and movement have a natural affinity with architecture's shifts towards a more liquid state. The preoccupation with textiles in architecture challenges traditional perceptions and practices in interior, architectural, urban, textile and fashion design. Interweaving new designs and speculative projects for the future, Architextiles, brings together architects, designers, engineers, technologists, theorists and materials researchers to unravel these new methodologies of fabricating space.","torrent":{"xt":"urn:btih:e9ae11524c6480ab9b36d67716d43b6e7d759edf","amp;dn":"Architextiles+%28Architectural+Design%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e9ae11524c6480ab9b36d67716d43b6e7d759edf","infoHashBuffer":{"type":"Buffer","data":[233,174,17,82,76,100,128,171,155,54,214,119,22,212,59,110,125,117,158,223]},"announce":[],"urlList":[]}}