{"title":"SEPTERRA.CORE-DEViANCE","uid":8265600,"size":674267607,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:e9cd984bf6e279d2cf0fbf761ac99cb97f7b15d1&amp;dn=SEPTERRA.CORE-DEViANCE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Totenkruez","files":-1,"time":1363488097,"description":"Septerra Core (c) Monolith/Topware\n\nFormat......: BIN/CUE\nRAR Count......:  45 x 15mb\nDate........: Oct. 28,1999\nGame Rating....: You Decide\nCracker.....: Who?\nProtection.....: Where?\n\nRequirements:      P133 32mb 8Xcd W9X 3DFX Sound\n\n\n** Release Information **\n\n\nEnter a world where the laws of nature work in strange new ways, allowing\ncontinents to orbit at different elevations around the planet. Where\nconcentric World Shells create seven unique ecosystems, and Bio-Engineering \nhas ushered in a revolution of societal changes. Where living battleships \nfloat overhead, and Junk Pirates roam the darkness. A world whose Core is\na living computer, watching over the fruits of its master's creation. A \nworld devised in the ancient past as a test for its own inhabitants to \nunravel ...\n\nWelcome to Septerra ...\n\nOn the Outer Shell layer above, the ancient society of the Chosen live an \nextravagant lifestyle, consuming mass amounts of  energy and dumping their \nwaste down onto the layers below.\n\nBut things are not what they seem. The Chosen believe that Septerra was created\nin the ancient past by a mysterious being from the heavens. The world is a \nclockwork, built for some unknown purpose to work in the way it does. They \nhave discovered artifacts and clues which lead them to believe that the \nanswer lies in the depths of the Core, around which all the other layers \norbit. It is this Legacy that calls them from their self imposed exile, to \nreturn to the lower levels.\n\nNow, as they begin their journey, they find that they cannot travel even one\nlevel down without artificial aid. Their bones have become brittle in the \nhigher altitudes, their muscles stringy and weak in the lower gravity of the\nupper shell. But journey to the Core they must, for they believe it is their\nbirthright to unlock the secret of the Legacy, and know the face of their Creator.\n\nIt is into these events that you are drawn. You take the role of a Junk \nScavenger from World Shell 2, directly below the Chosens' layer. Here you\nmake your living, sifting through the trash from above to find useful \nitems to sell. As the Chosen and their Technopapist regime begin their \ndescent to the core, war looms over the land. The many nations of the \nlower levels, including your own, are threatened by the exodus, and fear \nthe destruction to come. At first you stand in the way of the Chosen, \nfighting to slow their march to the Core, and protect your homeland. But it\nis you who will ultimately discover Septerra's true nature, as you journey\nout of the familiar surroundings of your home country, and come face to face\nwith the Legacy ...\n\nAt the Core, you will discover a planet-sized Bio-Computer which holds the \nanswer to the Creator's Riddle. You will learn that Septerra is a giant puzzle\npiece, waiting to be locked into the universe around it, as soon as its \ninhabitants solve the Legacy. If you fail, the world is certainly doomed. If \nyou succeed, and solve the puzzle - it may well destroy you, and those you \nlove ... Certain continents on the lower layers can be moved to the Outer Shell,\nwhere they will snap into place. If the correct ones are raised, an ancient \nsymbol will be created across the face of the planet, and the Legacy will \nunfold. But is it the right thing to do? The moving of whole continents will \ncause catastrophe on a scale of which has never been imagined ...\n\nAgainst a backdrop of political intrigue and savage war, you will journey across\nthe various worlds, encountering dear friends and wicked enemies. Travel to the\ncore and unlock its secret. Face the war machine of the TechnoPapacy, and bring\nit to its knees.\n\nIn a world where the boundaries of good and evil are blurred, only the strong \nwill survive to see a new day, and a new era, as you solve the Legacy - and \nlook upon the face of the Creator.\n\n \n\nGame Features:\n\nHundreds of locations for players to operate within creates a large, fully\nexplorable world.\n\nHighly developed storyline and characters offer fifteen chapters of gameplay.\n\nRecognizable adventure interface allows players to tap into the complex options\nof the game, without overly complex menus.\n\nIn addition to the main character, players may choose from eight companions, \neach with a unique background story, motivation and skill set.\n\nPlayer companion AI and skill sets allow for multiple approaches to exploration.\n\nClock based combat has all the strategy of turn based combat, but keeps the \ngame fast paced.\n\nPlayer may experiment with item combinations to create new spell effects by \ncollecting a deck of &quot;Fate Cards.&quot;\n\nCharacters and enemies are fully developed 3D models, pre-rendered to 16-bit \nsprites for smooth animation.\n\nLarge 16-bit backgrounds that are natural and non-repetitive.\n\nHighest quality production, including 640x480 graphics, 16-bit color, completely\nrecorded dialogue and fully animated movie sequences.\n\n  \n\nCan you believe it? Hell, we cant...","torrent":{"xt":"urn:btih:e9cd984bf6e279d2cf0fbf761ac99cb97f7b15d1","amp;dn":"SEPTERRA.CORE-DEViANCE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e9cd984bf6e279d2cf0fbf761ac99cb97f7b15d1","infoHashBuffer":{"type":"Buffer","data":[233,205,152,75,246,226,121,210,207,15,191,118,26,201,156,185,127,123,21,209]},"announce":[],"urlList":[]}}