{"title":"The Middle Ages - an illustrated history (Oxford Ebook).pdf","uid":14206335,"size":30523910,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ead4b651cb669e7a1daa0ecd2b4ac99b64415666&amp;dn=The+Middle+Ages+-+an+illustrated+history+%28Oxford+Ebook%29.pdf&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"STBGD","files":1,"time":1459973805,"description":"Oxford University | 1998 | Eng | Pdf | 0195103599 | 161 pag | 29 MB\r\n\r\nA brisk narrative of battles and plagues, monastic orders, heroic women, and knights-errant, barbaric tortures and tender romance, intrigue, scandals, and conquest, The Middle Ages: An Illustrated History mixes a spirited and entertaining writing style with exquisite, thorough scholarship. Barbara A. Hanawalt, a renowned medievalist, launches her story with the often violent amalgamation of Roman, Christian, and Germanic cultures following the destruction and pillaging of the crown jewel of the Roman Empirethe great city of Rome. The story moves on to the redrawn map of Europe, in which power players like Byzantium and the newly-established Frankish kingdom begin a precarious existence in a &quot;sea of tribes&quot; (in the words of a contemporary). Savage peoplesthe bloodthirsty Germans, the wild Visigoths and Ostrogoths, the fierce Anglo-Saxons, and the Slavs to the Eastas well as the sophisticated and ever-expanding Arabs threaten each others borders, invade cities and have their own cities sacked, fight victorious battles and get conquered in turn. Hanawalt charts the spread of Christianity in Europe, maps out the trail of misery and mayhem the Crusades left in their wake, explains feudalism and Church reform, familiarizes us with the astrolabe and the masterpieces of Romanesque and Gothic architecture, tracks the progress of the Hundred Years' War, and brings great historical figures--such as Charlemagne, King Henry II, Joan of Arc, Dante, and Justinian--to life.Spanning the millennium between the fifth and the fifteenth centuries, The Middle Ages: An Illustrated History captures the major historical and political events in great depth and clarity, but never loses sight of the plain and often-overlooked facts of lifelife as lived by peasants and townsfolk, kings and monks, men and women. Hanawalt offers fascinating tidbits on diverse facets of medieval society, from herbal medical cures to table etiquette and drinking habits, from tabloid-worthy court scandals to a unique listing of the rules of a monastic order. She examines rare textsfrom illuminated manuscripts to Carolingian minusculeand takes us inside the awe-inspiring Hagia Sofia in Constantinople.Barbara Hanawalt makes use of eclectic source material, including inscriptions, chronicles, artifacts, and literature, from the Koran to the Scriptures, and from Omar Khayam to the Goliardic poems. Fascinating stories--like that of the discovery of the burial site of an Anglo-Saxon chieftain which contained, among other treasures, an entire 86-foot long shipare interspersed among the chronicles of great historical upheavals. The author takes a sweeping approach to the subject, building a comprehensive, animated portrait of every aspect of life in that period by including material on women's place in medieval society, agriculture, art and literature, religion and superstitions, philosophy, and weaponry. Lavishly illustrated with art, photographs, documents, artifacts, and maps, The Middle Ages also includes a glossary, index, chronology, and suggestions for further reading","torrent":{"xt":"urn:btih:ead4b651cb669e7a1daa0ecd2b4ac99b64415666","amp;dn":"The+Middle+Ages+-+an+illustrated+history+%28Oxford+Ebook%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ead4b651cb669e7a1daa0ecd2b4ac99b64415666","infoHashBuffer":{"type":"Buffer","data":[234,212,182,81,203,102,158,122,29,170,14,205,43,74,201,155,100,65,86,102]},"announce":[],"urlList":[]}}