{"title":"CDRoller v7.70.50.1 RES.rar","uid":4467832,"size":5792609,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:ed85cdde928654f53fc8700d693136cc728558a2&amp;dn=CDRoller+v7.70.50.1+RES.rar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"jsph69","files":1,"time":1224985144,"description":"Effectively retrieves the data off the discs created by &quot;drag and drop&quot; CD/DVD writing software, such as well-known Roxio (Adaptec) and Ahead Nero software packages, CeQuadrat's PacketCD, Sonic Solutions DLA, B's CLiP and others.\nRecovers DVD video and photos, created by a wide set of standalone devices that record directly onto disks, including Hitachi, Canon, Panasonic, Samsung and Sony DVD camcorders as well as standalone video recorders.\nIncludes a built-in Video Splitter. Splits the recovered VOB or VRO files into a several clips (scenes), automatically converting a &quot;raw&quot; DVD-video into MPEG files without loss of quality. Specially tested on the discs, recorded by Hitachi DVD camcorders.\nBurns a new DVD with recovered video that can be played back in the most DVD players.\nRecovers CD data written by Sony Mavica CD digital cameras.\nIncludes a fault-tolerant UDF Reader. Provides direct access to UDF discs, including CDs and DVDs written by old versions of Roxio (Adaptec) DirectCD and Drag-To-Disk. Finds and retrieves accidently deleted files, files located in the corrupted folders, files on incorrectly closed disks, etc.\n&quot;On-the-fly&quot; unpacks the files initially compressed by Roxio (Adaptec) DirectCD.\nRetrieves back up files from the discs recorded in several stages (multisession discs).\nIncludes a built-in CD/DVD data burner. There is no need to run third-party CD/DVD mastering software if you wish to burn a new DVD-video disc or backup your files and folders immediately after recovery. The &quot;Burn&quot; option is integrated into a common shell. Just write a new disc with recovered data shortly, without leaving CDRoller!\nErases CD and DVD re-writable media. Supports quick and full erase methods.\nExamines disc sectors at low level. Displays the sector content in text, binary, hexadecimal or unicode mode. It also scans all sectors of a disc (selected track or file) for particular data. Recommended for engineering purposes and also for law enforcement and forensic investigators.\nIdentifies the lost files on ISO/Joliet discs with the damaged file system (volume descriptors, path tables and directories), using the raw data only.\nRescues the data from scratched, damaged or defective discs.\nProvides direct access to the hardware, bypassing the Windows File System. Looks for the lost tracks (sessions) every time when you insert a new disc into the drive\nDigitally extracts audio tracks into a wide set of wave formats.\nTests CD/DVD readability.\nExtracts ISO Image file. Burns ISO Image file to a new disc.\nCatalogs files and folders into CD/DVD library.\nAll features are integrated into a common and easy-to-use intuitive shell.\n\n\n\nCDRoller supports industry-standard ISO 9660 file system, including Microsoft's extensions for long file names support, so-called Joliet extensions. CDRoller also supports the discs formatted in UDF file system, including versions 1.02, 1.50, 2.0, 2.01, 2.50, 2.60 and also so-called UDF Bridge format.\n\nSupport of wide set of CD, CD-R, CD-RW and DVD formats such as\n\nCD/DVD format CD-DA,\nCD/DVD format CD-ROM,\nCD/DVD format CD-WO,\nCD/DVD format CD-ROM XA and Mixed-Mode CD,\nCD/DVD format Stamped multisession CD,\nCD/DVD format CD-MRW (&quot;Mt. Rainier&quot; CD-RW),\nCD/DVD format DVD-ROM, DVD-R, DVD-RW, DVD+R, DVD+R DL, DVD+RW, DVD-RAM.\n\n\nSystem Requirements\n\nTo run CDRoller, you need at least:\nMicrosoft Windows 95/98/ME/2000/XP/2003/Vista operating system,\nIntel Pentium or compatible CPU,\n256 MB of RAM,\n12 MB free hard disk space for program installation and some additional space for CD/DVD images,\nCD/DVD drive(s). The devices with IDE or SCSI interfaces are highly recommended under Windows 95/98/ME\n\n","torrent":{"xt":"urn:btih:ed85cdde928654f53fc8700d693136cc728558a2","amp;dn":"CDRoller+v7.70.50.1+RES.rar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ed85cdde928654f53fc8700d693136cc728558a2","infoHashBuffer":{"type":"Buffer","data":[237,133,205,222,146,134,84,245,63,200,112,13,105,49,54,204,114,133,88,162]},"announce":[],"urlList":[]}}