{"title":"Thrice - To Be Everywhere Is to Be Nowhere (2016) [24.44 FLAC]","uid":14705528,"size":516648923,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:edbd63cdcb980ee1d1d4c1e6eb6e904c58671386&amp;dn=Thrice+-+To+Be+Everywhere+Is+to+Be+Nowhere+%282016%29+%5B24.44+FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"politux","files":12,"time":1464355310,"description":"\n  Thrice - To Be Everywhere Is to Be Nowhere (2016) [24.44 FLAC]\r\n\r\n  Genre: Rock\r\n  Styles: Alternative, Post-Hardcore\r\n  Source: Vagrant Records (WEB)\r\n  Codec: FLAC\r\n  Bit rate: ~ 1,700 kbps\r\n  Bit depth: 24\r\n  Sample rate: 44.1 kHz\r\n\r\n  01 Hurricane \r\n  02 Blood on the Sand\r\n  03 The Window \r\n  04 Wake Up \r\n  05 The Long Defeat \r\n  06 Seneca\r\n  07 Black Honey \r\n  08 Stay With Me \r\n  09 Death From Above\r\n  10 Whistleblower \r\n  11 Salt and Shadow \r\n\r\n  After a three-year hiatus, Thrice returned with their ninth studio effort -- and first since 2011's Major/Minor -- To Be Everywhere Is to Be Nowhere, an album far-removed from the sound of the early-aughts screamo scene they helped popularize. Not as unhinged as their initial breakthrough albums, nor as experimental as their Alchemy Index quadrilogy, Nowhere falls nicely alongside their more straightforward rock works like Vheissu, Beggars, and Major/Minor. This is an album full of power and focus. Vocalist Dustin Kensrue can still scream, but gone is the ferocious wail, instead replaced with a gravelly rasp that can sound like Chris Cornell, Dave Grohl, or Dan Reynolds, depending on the song. That bloody strain opens the album on &quot;Hurricane,&quot; which finds the band -- guitarist Teppei Teranishi, bassist Eddie Breckenridge, and drummer Riley Breckenridge -- whipping up a midtempo torrent that swirls into the throat-shredding &quot;Blood on the Sand,&quot; one of a few moments on the album where the early Thrice can be heard (&quot;The Long Defeat&quot; is another nostalgic trip). Many of the best moments take the alternating heavy-pretty sound that their forebears Deftones have perfected and smash it with meandering atmospherics similar to Radiohead. \r\n\r\n  Highlight &quot;The Window&quot; is one such track, weaving an ominous guitar melody through tribal drum beats. There are multiple instances where the band also veer into a distinctly political arena, addressing American political indifference (&quot;Wake Up&quot;), aggression abroad (&quot;Black Honey&quot;), drones (&quot;Death from Above&quot;), and Edward Snowden (&quot;Whistleblower&quot;). The topical concerns show a maturity that comes with age, and the updated priorities that the band members, most of whom are raising families, face. That intensity carries over to the music, creating a very consistent delivery: there aren't many thrilling peaks or desperate lows, just muscular force. Nothing simply pummels from start to finish. At the close, Thrice opt for a quiet, plaintive finish with the lullaby &quot;Salt and Shadow.&quot; After an album's worth of controlled adult raging, the pain is washed away with a gorgeous, aqueous swirl that loops directly back into the tempest of &quot;Hurricane.&quot; Fans hoping for a post-hiatus &quot;return to form&quot; shouldn't expect another &quot;All That's Left.&quot; For a band that has consistently switched up their direction with each successive album, the biggest surprise is not that To Be Everywhere Is to Be Nowhere once again manages to add fresh ideas to the Thrice catalog, but that a band 17 years into their career still has new directions to travel","torrent":{"xt":"urn:btih:edbd63cdcb980ee1d1d4c1e6eb6e904c58671386","amp;dn":"Thrice+-+To+Be+Everywhere+Is+to+Be+Nowhere+%282016%29+%5B24.44+FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"edbd63cdcb980ee1d1d4c1e6eb6e904c58671386","infoHashBuffer":{"type":"Buffer","data":[237,189,99,205,203,152,14,225,209,212,193,230,235,110,144,76,88,103,19,134]},"announce":[],"urlList":[]}}