{"title":"Carr 2003 Stroke Rehabilitation","uid":7544956,"size":62101689,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ee7b286eab3c0fb92a6b3e75e956c9166687ee29&amp;dn=Carr+2003+Stroke+Rehabilitation&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"kinebooks","files":1,"time":1345319436,"description":"In this book we have set down guidelines for training critical motor actions after stroke: walking, reaching and manipulation, balancing in sitting and standing, and standing up and sitting down. The guidelines are designed to optimize motor performance, in other words, skill. They are science-based in that we have preceded each set of guidelines with a brief resume of scientific findings relevant to the action, including a description of major biomechanical characteristics, and of muscle activity, and the changes that occur in performance due to impairments and adaptations. Since stroke is the model used, details of agerelated changes in performance are also provided. The guidelines themselves include methods of task-oriented training of motor control to maximize skill, environmental manipulations to foster cognitive engagement and enhance skill learning, and methods of increasing muscle strength, soft tissue flexibility, endurance and fitness. A short list of appropriate methods of measurement is included. The guidelines are based on the limited evidence so far available from clinical outcome studies, and each training chapter includes a table of recent clinical trials we consider are of particular clinical interest, trials in which the interventions are clearly outlined. The mechanisms of impairments and adaptations and their impact on performance, the task-dependence of strength training and conditioning, and a brief overview of the role of physiotherapy in the early care of individuals who have had a stroke, are included in appendices.","torrent":{"xt":"urn:btih:ee7b286eab3c0fb92a6b3e75e956c9166687ee29","amp;dn":"Carr+2003+Stroke+Rehabilitation","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ee7b286eab3c0fb92a6b3e75e956c9166687ee29","infoHashBuffer":{"type":"Buffer","data":[238,123,40,110,171,60,15,185,42,107,62,117,233,86,201,22,102,135,238,41]},"announce":[],"urlList":[]}}