{"title":"Free Control - Extended Play","uid":7014013,"size":44384032,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:f07d2b06c893d767fa1f459fb63db2c9ff30adaa&amp;dn=Free+Control+-+Extended+Play&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"TheCrossroad","files":7,"time":1328582956,"description":"Extended Play EP by Free Control\n----------------------------------------------------------------------\n\nLeicester-based band, Free Control, officially launched their latest EP, Extended Play, on 30th January 2012.\n\nFree Control, who have been together since 2008, comprise of bass guitarist Oliver Bloor, drummer Paul Cole, guitarist and vocalist Greg Shute, flutist and vocalist Sally Hossack and Mike Sole on keyboards.\n\nIn 2009, the band appeared at Summer Sundae Festival, adorning the main stage at De Montfort Hall and making an instant connection with the crowd. Regular gigs in Leicester and London followed and now, after a year dedicated to writing, recording and refining existing songs, as well as crafting new ones, the band are set to return with a bang.\n\nGuitarist, Greg Shute, provided an insight into what can be expected from Extended Play.\n\n&quot;We wanted to try and get a good mix of songs. Two tracks have been recorded in demo form before but we wanted to record them properly as our sound has developed. The other tracks are regulars in our live set and have been honed. The newest track, Strawman, reflects the direction we're going in, but I wouldn't say its a new sound, just an evolved one.&quot; Lead-singer, Sally Hossack, is also proud of what the band have produced.\n\n&quot;This the best I have ever heard these songs sound, they are truly crafted. Paul Warrener at Seamus Wong Studios created a massive drum sound and I think our recordings benefited from his advice and the recording space. It is being mixed by John Meredith who understands how we feel about our music.&quot;\n\nExtended Play can be purchased from iTunes, Spotify, Amazon and other online retailers.\n\nFor more information on Free Control, visit their official website:\n\nwww.freecontrol.co.uk","torrent":{"xt":"urn:btih:f07d2b06c893d767fa1f459fb63db2c9ff30adaa","amp;dn":"Free+Control+-+Extended+Play","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f07d2b06c893d767fa1f459fb63db2c9ff30adaa","infoHashBuffer":{"type":"Buffer","data":[240,125,43,6,200,147,215,103,250,31,69,159,182,61,178,201,255,48,173,170]},"announce":[],"urlList":[]}}