{"title":"Game of Thrones 2 [x264]","uid":9911163,"size":2268937272,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:f0f0a519ecacb80baef15c62be24bdbe59592e10&amp;dn=Game+of+Thrones+2+%5Bx264%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"skumole83","files":10,"time":1396899856,"description":"Game of Thrones 2\n\nHaving won three victories, Robb Stark offers the Lannisters peace in exchange for the North's independence, sending Theon to gain Balon Greyjoy's support and Catelyn to seek Renly Baratheon's. Cersei rejects Robb Stark's terms and Tyrion exiles Janos Slynt, head of the Gold Cloaks, to the Wall, promoting Bronn to commander of the watch.\n\nCatelyn Stark arrives at King Renly's camp to negotiate an alliance, and the woman warrior Brienne of Tarth wins the right to join Renly's guard. Catelyn and Brienne witness Renly's murder at the hands of dark magic sent by the Red Lady, an emissary of Stannis Baratheon. Catelyn and Brienne flee Renly's camp as his supporters switch their allegiance to Stannis and rejoin Robb's army. Meanwhile, Theon betrays the Starks by siding with his father and seizing Winterfell by force. Robb receives news of Theon's plans and sends men to retake Winterfell, while inside the city the Starks' allies form plans to sneak Bran and Rickon out.\n\nRobb Stark learns that his mother Catelyn has secretly freed Jaime Lannister, now escorted by Brienne of Tarth, in order to ransom her daughters Sansa and Arya; he also enters into a romantic relationship with Talisa. Yara Greyjoy arrives at Winterfell to bring Theon back to Pyke, after his botched attempt to recapture the Stark boys.\n\nTywin Lannister leaves Harrenhal, which allows Arya Stark, Gendry and Hot Pie to make an escape with Jaqen H'ghar's help. In King's Landing, Cersei Lannister attempts to blackmail Tyrion by abducting the whore, Ros, whom Cersei believes to be his secret lover. Leading the defense, Tyrion Lannister destroys many of the attacking craft with an exploding ship full of wildfire, and is forced to lead a counterattack as King Joffrey and his bodyguard Sandor Clegane each desert the battlefield. Stannis' forces make it inside the castle, but Tyrion leads his men behind the Baratheon forces via underground tunnels and attacks. Baratheon is defeated when Tywin Lannister's forces arrive at King's Landing shortly after.","torrent":{"xt":"urn:btih:f0f0a519ecacb80baef15c62be24bdbe59592e10","amp;dn":"Game+of+Thrones+2+%5Bx264%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f0f0a519ecacb80baef15c62be24bdbe59592e10","infoHashBuffer":{"type":"Buffer","data":[240,240,165,25,236,172,184,11,174,241,92,98,190,36,189,190,89,89,46,16]},"announce":[],"urlList":[]}}