{"title":"Hanson-MMMBop.(1997)(Promo Only)-Wushan.avi","uid":4796033,"size":102130162,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:f15996dcf971aae8fcd00d578122a7eef5238a4f&amp;dn=Hanson-MMMBop.%281997%29%28Promo+Only%29-Wushan.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"wushan","files":1,"time":1237884304,"description":"                               Hanson-MMMBop\n\n\nHanson is an American pop rock band formed in Tulsa, Oklahoma by brothers Isaac, Taylor, and Zac Hanson. They are best known for the 1997 hit song &quot;MMMBop&quot; from their major label debut album Middle of Nowhere that earned three Grammy nominations. Despite the enormous commercial success of Middle of Nowhere, the band suffered from the merge that eliminated Mercury Records and were moved to Island Def Jam Music Group, which they eventually left after conflict with the label about creative input. The band now records under its own label, \n\nAll three boys started their musical careers as pianists. Isaac later picked up a second-hand guitar, Zac borrowed an old set of drums, and Taylor became the keyboard player of what turned into a garage band. The band recorded two independent albums in their hometown of Tulsa, Boomerang (recorded in autumn 1994, released in 1995) and MMMBop (released in 1996).\n\n\nMMMBop was released in 1996 and was Hanson's second independent album after Boomerang (1995). It contains many songs that were later rerecorded for their debut studio album Middle of Nowhere (1997). Many of these songs were also rereleased on 3 Car Garage (1998). You can no longer buy this album in stores, and it's extremely hard to find anywhere on the internet.\n\n\n                              ***MMMBop.*** \n\n\n                                  Enjoy!!!","torrent":{"xt":"urn:btih:f15996dcf971aae8fcd00d578122a7eef5238a4f","amp;dn":"Hanson-MMMBop.%281997%29%28Promo+Only%29-Wushan.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f15996dcf971aae8fcd00d578122a7eef5238a4f","infoHashBuffer":{"type":"Buffer","data":[241,89,150,220,249,113,170,232,252,208,13,87,129,34,167,238,245,35,138,79]},"announce":[],"urlList":[]}}