{"title":"Rush - LIVE 02/14/1980 [320k MP3] 'La Villa Strangiato'","uid":4686207,"size":176167164,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:f20e4611aa39deb3d643844ce57267bc7c0baf0f&amp;dn=Rush+-+LIVE+02%2F14%2F1980+%5B320k+MP3%5D+%5C%27La+Villa+Strangiato%5C%27&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"smbdownload","files":-1,"time":1233241961,"description":"Rush - &quot;La Villa Strangiato&quot; \n2/14/80 Kiel Auditorium, St. Louis, MO US \n[320k MP3]\n\n2112   \nThe Spirit of Radio  \nNatural Science  \nBeneath, Between and Behind  \nBy-Tor and the Snow Dog  \nXanadu  \nWorking Man / Anthem / Bastille Day / In The Mood  \nDrum Solo  \nLa Villa Strangiato \n\n----------------------------------------------------------------------------------\n\nComments and Reviews:\n\nThe Digital Dan: \n\nYes, that is correct, there are two ROIO's of the same show with the same name!  The Seagull version is generally considered the better of the two.  This is an awesome show, another required recording if you are a true Rush fan.  The best part of this show to me is the version of 2112.  By far and away this is my favorite performance of it.  Alex is absolutely devastating on this version with some wicked use of wah-wah at the start of the song.  Other reviews below give a better description of the show and to not sound like a repeat of someone else's words I'll give a little of the lighter side of reviews here.  One thing to take into consideration, the bass on this recording goes really LOW.  How low, well I have a dual 12&quot; sub with 250 watts of amplification, and I blew out a dorm window with this CD!  I had a hard time explaining the huge cracks in the window and the small hunk of glass missing in the corner :)  It is this reason that I can assume that Moose Records chose to call their copy of this show &quot;Taurus Pedals from Hell&quot;.  I have to be careful playing this disc on high end systems because of the potential for damage!  It scared the hell out of my friend when he heard it for the first time on my stereo.  Actually, he was responsible for the blown window.  How the bass got that low I can only guess seeing as this was recorded in '80 to tape, then broadcast, then taped again, then pressed to LP, and then transferred to CD.  With the age and the number of transfers of media, it is amazing the signal is that pure. \n\nTaken from the Rush Trading Register: \n\nIf you're looking for one of the definitive Permanent Waves Tour bootlegs then you need look no further.  This single CD recording is an outstanding document of the tour, featuring a great mix of old favorites and the occasional surprise rarity. Highlights on the recording, which was taken from St. Louis and broadcast on radio, include a great opening version of 2112; it's very evident on this rendition that Alex has been playing around with guitar effects a lot since 1976. Further highlights include stand-out versions of La Villa Strangiato (complete with electric guitar, not acoustic intro), The Spirit of Radio, Natural Science and a killer oldies medley which begins with an amusing reggae intro to Working Man. Sound quality on the whole is excellent, although there are a few crackles and pops, as this was originally recorded on vinyl and then remastered to CD later.  These vinyl deficiencies tend to be very noticeable on quieter moments, such as the openings for Natural Science and Xanadu.  The band are in fine form, and all of the respective instruments come out nicely; one exception being Geddy's voice, which seems a little too far back in the mix for my liking, much in the same way as was evident on Exit...Stage Left. Packaging is nice, with a calligraphic title on the CD itself, and HYF/RTB pictures on the front and back sleeves of Geddy and Alex. Track-listing is accurate.  For all of you PeW fans who were disappointed by ESL, this is the bootleg you should be looking to acquire. \n\nTaken from Ron's Rush ROIO Review: \n\nWhere else could you find 2112, Natural Science, Xanadu and La Villa Strangiato on one CD? This is a must-have for collectors, not only in terms of song selection but in terms of quality. It was originally a radio broadcast, pressed into a bootleg double-LP entitled &quot;Xanadu&quot;, and finally arrived in the CD format. Packed with over 74 minutes of music, this CD is well worth the money. There has been much confusion over the date of the original concert. This CD lists it as March 29th, while the LP listed it as March 16th. Neither of these dates is correct (as Rush was playing the East Coast at the time), and are more likely the date(s) of the radio broadcast itself.  The most accepted date is February 14th -- this has been confirmed as the date Rush did play in St. Louis, although they may have played there more than once. Although the sound quality is excellent, there are two flaws. First, this CD was recorded from the LP bootleg itself, and occasionally &quot;pops&quot; can be heard in the songs (most notably &quot;La Villa&quot;). The second is that the show may sound TOO good to some -- it sounds more like a studio album, with the crowd faded in and out at the appropriate moments, than a true live album. That, however, is a matter of personal choice. The biggest flaw in this CD is the packaging. The cover is a washed-out picture of the band with bad exposure; it appears to have been taken during the &quot;Signals&quot; tour, and not &quot;Permanent Waves&quot; (when the concert was recorded). The CD booklet is not even a booklet, merely a single piece folded in half. Inside there are three pictures, one of each band member, but again the pictures are washed-out. The CD itself is plain. One plus is that unlike most bootlegs, the songs have the correct titles and are in the order listed on the CD. This show is the same as the bootleg &quot;Spirit Of St. Louis&quot;. If you come across this CD in your hunts at the local record store, by all means pick it up! \n\n\n","torrent":{"xt":"urn:btih:f20e4611aa39deb3d643844ce57267bc7c0baf0f","amp;dn":"Rush+-+LIVE+02%2F14%2F1980+%5B320k+MP3%5D+%5C%27La+Villa+Strangiato%5C%27","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f20e4611aa39deb3d643844ce57267bc7c0baf0f","infoHashBuffer":{"type":"Buffer","data":[242,14,70,17,170,57,222,179,214,67,132,76,229,114,103,188,124,11,175,15]},"announce":[],"urlList":[]}}