{"title":"HISTORY OF POP AND ROCK MUSIC - part 328","uid":6799740,"size":390982194,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:f2dd20ebe4f351c03c38c6a8c97c9a71aeae5319&amp;dn=HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+328&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pupovaczlatko","files":-1,"time":1320658501,"description":"                     PART  325\n\n\n\n             BEGGARS OPERA - Raymond's road  (1971)\n             CAN  - Paperhouse  (1971)\n             IF - Forgotten roads  (1971)\n                           \n\n      Beggars Opera were a progressive rock band from Glasgow, Scotland, formed in Glasgow in 1969 by guitarist Ricky Gardiner. The line-up consisted of Ricky Gardiner (guitar/vocals), Alan Park (keyboards)  Martin Griffiths (vocals), Marshall Erskine (bass/flute) and Raymond Wilson (drums). Beggars Opera made a lot of records but remained acting in the shade of most progressive rock bands. Their debut-album &quot;Act one&quot; (1970) contains fluent and tasteful organ driven progrock with powerful &quot;Sixties&quot; sounding guitarwork. The long track &quot;Raymonds Road&quot; is a splendid tribute to the &quot;classics&quot; featuring Mozarts A la Turka, Bachs Toaccata in d-fuga en Griegs Peer Gynt Suite on the Hammond organ. The second album &quot;Waters of Change&quot; (1971) is build around the dual keyboardplay of Alan Park and newcomer Virginia Scott and the distinctive, a bit cynical vocals of Gardiner. The nine tracks are beautiful symphonic landscapes with many organ solos, some swelling and glorious Mellotron waves (like The Moody Blues and early King Crimson) and fine electric guitarwork.The single &quot;Time Machine&quot; from that album was successful in Germany, where the band toured extensively. On the third LP &quot;Pathfinder&quot; Beggars Opera  seems to have reached its pinnacle: strong and alternating compositions with lush keyboards (Mellotron, organ, piano and harpsichord), powerful electric guitarplay and many shifting moods.\n\n     &quot;Paperhouse&quot;, a song by German krautrock band Can on their 1971 album &quot;Tago Mago&quot;.It is the third studio album by Can, and was originally released as a double LP in 1971 by United Artists. It was the band's second studio album to feature Kenji &quot;Damo&quot; Suzuki after their previous vocalist, Malcolm Mooney, quit the band in 1970 after having a nervous breakdown.Tago Mago has been critically well-received and is credited with pioneering various modern musical styles. Raggett called Tago Mago a &quot;rarity of the early '70s, a double album without a wasted note.&quot; In the book Kraftwerk: Man, Machine and Music, Pascal Bussy described the double LP as &quot;hugely influential&quot;. The album is listed in the book &quot;1001 Albums You Must Hear Before You Die&quot; in which it stated, &quot;Even after 30 years Tago Mago sounds refreshingly contemporary and gloriously extreme.\n  \n    If was a progressive rock band formed in Britain in 1969. Referred to by Billboard as &quot;unquestionably the best of the so-called jazz-rock bands&quot; in the period spanning 1970-1975, they produced 8 studio-recorded albums and did some 17 tours of Europe, the US and Canada. They toured extensively in Europe and the United States during the early 1970s, with two U.S. tours during their first year, performing at most of the major venues and festivals of the day including Newport, Reading, Fillmore East (November 10, 1970, sharing the billing with Black Sabbath and Small Faces) and Fillmore West, Whisky A Go-Go and The Marquee.They also shared billings with, amongst others, Miles Davis, Muddy Waters, Willie Dixon and Leon Russell as well as many of the classic rock bands of the day, such as Cream, Traffic, Yes, Grand Funk Railroad, Ten Years After, KISS, Dr. Hook and the Medicine Show, and Lynyrd Skynyrd.\n     If  broke up in 1975, Dick Morrissey going on to work with the Average White Band and Herbie Mann, eventually forming Morrissey-Mullen; Geoff Whitehorn to join Crawler and, subsequently, Procol Harum. Cliff Davies, Walt Monaghan and Gabriel Magno joined Ted Nugent, who was also produced by Lew Futterman.\n  \n    ","torrent":{"xt":"urn:btih:f2dd20ebe4f351c03c38c6a8c97c9a71aeae5319","amp;dn":"HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+328","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f2dd20ebe4f351c03c38c6a8c97c9a71aeae5319","infoHashBuffer":{"type":"Buffer","data":[242,221,32,235,228,243,81,192,60,56,198,168,201,124,154,113,174,174,83,25]},"announce":[],"urlList":[]}}