{"title":"The New Cars - Its Alive (2006) VBR-WLM","uid":6475129,"size":119315083,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:f316ff74e97e7454c32f54b1e8096260bfb1570e&amp;dn=The+New+Cars+-+Its+Alive+%282006%29+VBR-WLM&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"jam5150","files":20,"time":1308290816,"description":"Enjoy! (NOT MY RIP, JUST SHARING)\n\n\nReview (courtesy http://www.allmusic.com)\nby Stephen Thomas Erlewine\n\n\nIt's easy to be skeptical of reunions of classic rock bands, especially when they're lacking such crucial members as the group's two lead singers and songwriters. There have been plenty of embarrassing reunions of this nature -- ranging from Creedence Clearwater Revisited to the David Byrne-less Heads -- so the initial prospect of the Cars getting back together without their frontman and songwriter Ric Ocasek and the deceased Ben Orr doesn't seem enticing, or even logical. But Cars guitarist Elliot Easton and keyboardist Greg Hawkes do something unexpected for the New Cars, their cleverly named reunion of 2006: they hired a strong personality to fill the shoes of Ocasek. They've brought in Todd Rundgren, a pop maverick and chameleon who never quite ran in the same circles as the Cars -- his late-'70s arena rock band Utopia occasionally played shows with the Cars, but he never had the same quirky, nervy new wave sensibility of Ocasek -- to front the band, and he in turn brought in Utopia's bassist Kasim Sulton and Tubes drummer Prairie Prince to fill out the lineup. Rundgren smartly treats this gig as work-for-hire and fits into the requirements of the job instead of trying to bend the Cars to fit his style. He's always been a musical magpie, piecing together elements from other artists as either homage or parody, and he easily blends into the Cars' sound, as the 2006 album It's Alive proves. Essentially a live album with three bonus tracks, this record doesn't stray from the original recordings, nor does it improve on them, but the band is surprisingly natural and enjoyable. Without Ocasek as frontman, it's possible to really appreciate what Easton and Hawkes brought to their band; the blend of guitar and synth make this unmistakably the sound of the Cars. Prince and Sulton give the band a slightly heavier backbeat than the original Cars and Rundgren manages to capture Ocasek's cadences without mimicking him -- he serves the song, and he certainly helps this set be thoroughly enjoyable. A couple of Todd songs are thrown in for good measure -- a nice reading of &quot;I Saw the Light&quot; that's trumped by an excellent &quot;Open My Eyes&quot; -- and the new song &quot;Not Tonight&quot; shows up in both live and studio incarnations, and it's quite good in both, a good replication of the classic Cars sound and Rundgren's impish humor. Two other new studio recordings are here -- a slow-rolling ballad called &quot;Warm&quot; and an insistent anthem called &quot;More,&quot; both of which sound like fusions of Cars and Utopia from 1982, which is hardly a bad thing -- and they're good enough to suggest that far from being just an oldies act, this New Cars could come up with a nifty little album if they choose to follow up their 2006 tour with a real record. Until then, It's Alive functions as a good appetizer for the tour: it's not earth-shaking, but it's far better than nearly any other reunion of this kind, and at the very least it suggests that if you lay your money down for a night out with the New Cars, you're guaranteed a good time.","torrent":{"xt":"urn:btih:f316ff74e97e7454c32f54b1e8096260bfb1570e","amp;dn":"The+New+Cars+-+Its+Alive+%282006%29+VBR-WLM","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f316ff74e97e7454c32f54b1e8096260bfb1570e","infoHashBuffer":{"type":"Buffer","data":[243,22,255,116,233,126,116,84,195,47,84,177,232,9,98,96,191,177,87,14]},"announce":[],"urlList":[]}}