{"title":"Gossip Girl 1x01 [DVD DVB] [Spanish]","uid":4580223,"size":361601110,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:f4ff4bfe1f0c578c70cc62aebd017a69754c6c35&amp;dn=Gossip+Girl+1x01+%5BDVD+DVB%5D+%5BSpanish%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mois20","files":3,"time":1229392789,"description":"Gossip Girl es una serie de la CW del prolÃƒÂ­fico Josh Schwartz, creador de The O.C.. Esta vez el guionista trabaja sobre seguro ya que la serie se basa en una exitosa serie de libros del mismo nombre que la serie escritas por Cecily von Ziegesar y destinadas a las adolescentes.\nLas historias de Gossip Girl son contadas a travÃƒÂ©s de los ojos de una bloguera que se mantiene anÃƒÂ³nima. En la serie, ella tendrÃƒÂ¡ la voz de Kristen Bell, de Veronica Mars.\nLa niÃƒÂ±a cotilla del tÃƒÂ­tulo sigue con ÃƒÂ¡vido interÃƒÂ©s las vidas de los jÃƒÂ³venes y ricos miembros de la privilegiada alta sociedad de Nueva York. Las aventuras de esos adolescentes generalmente girarÃƒÂ¡n alrededor del sexo, las drogas, una angustia teen ya conocida por otras series como la misma The O.C. y una interminable red de conflictos amorosos.\nSerena Van Der Woodsen (Blake Lively) era la chica mÃƒÂ¡s popular de su colegio hasta que decidiÃƒÂ³ marcharse a Europa huyendo de algo. Su regreso es el punto de partida de la trama. Blair (Leighton Meester) era su mejor amiga que, con la desapariciÃƒÂ³n de Serena, tuvo la ocasiÃƒÂ³n de ser el centro de todas las miradas y convertirse, ella misma, en la chica mÃƒÂ¡s popular. Nate (Chace Crawford), el joven de los sueÃƒÂ±os de cualquier chica, es la otra punta de ese triÃƒÂ¡ngulo. TambiÃƒÂ©n tenemos a Jenny (Taylor Momsen) y Dan (Penn Badgley), dos hermanos que no son exactamente pobres, pero tampoco forman parte del mismo escalafÃƒÂ³n social que los demÃƒÂ¡s personajes.\nEn un principio la serie tiene potencial para agradar a los adolescentes y volverse la tÃƒÂ­pica serie que los adultos ven pero que por vergÃƒÂ¼enza niegan haber visto nunca.\nEn el piloto de &quot;Gossip Girl&quot;, la voz en off de Gossip Girl que nos narra la historia, habla de Manhattan y mÃƒÂ¡s particularmente del Upper East Side. Este es uno de los barrios de mayor prestigio de la ciudad de Nueva York, estando ubicado en la mitad este de la isla de Manhattan, donde viven los neoyorquinos mÃƒÂ¡s adinerados y donde podemos encontrar prestigiosos museos como el Metropolitan Museum o el Museo Solomon R. Guggenheim. ","torrent":{"xt":"urn:btih:f4ff4bfe1f0c578c70cc62aebd017a69754c6c35","amp;dn":"Gossip+Girl+1x01+%5BDVD+DVB%5D+%5BSpanish%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f4ff4bfe1f0c578c70cc62aebd017a69754c6c35","infoHashBuffer":{"type":"Buffer","data":[244,255,75,254,31,12,87,140,112,204,98,174,189,1,122,105,117,76,108,53]},"announce":[],"urlList":[]}}