{"title":"Superman Documentary 6-Pack","uid":9794944,"size":4143626240,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:f562157520122787edf20aab999c8b1724afadea&amp;dn=Superman+Documentary+6-Pack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"MaxiDownloads","files":-1,"time":1395299426,"description":"This is a collection of six documentaries about the Man of Steel, his cultural impact, and history. Included are:\n\n\n\nConfessions of a Superhero\n==========================\nA 2007 documentary film directed by Matthew Ogens about costumed superheroes on the Hollywood Walk of Fame. The film focuses in particular on Christopher Dennis, Jennifer Wenger, Joseph McQueen, and Maxwell Allen, who dress as Superman, Wonder Woman, The Hulk, and Batman, respectively. The film tells the life story of its four main subjects, all aspiring actors who have very different backgrounds. Dennis grew up in Los Angeles as an orphan, but claims to be the son of Oscar and Tony winning actress Sandy Dennis, though Sandy Dennis's family denies that she had any children. Wenger was a small-town cheerleader before moving to Hollywood to become an actress. McQueen moved to Los Angeles during the Rodney King riots and was homeless for four years before becoming the Hulk, and achieves the most success of any of the subjects in the film, winning a small role in Justin Lin's Finishing the Game. Allen claims to be a former mobster with a murderous past, though his wife casts doubts on his stories in the film.\n\n\nHollywoodland \n=============\nA 2006 American biographical docudrama film directed by Allen Coulter in his feature directorial debut. The story presents a fictionalized account of the circumstances surrounding the death of actor George Reeves (played by Ben Affleck), the star of the 1950s television series Adventures of Superman. Adrien Brody co-stars as a fictional character, Louis Simo, a private detective investigating Toni Mannix (Diane Lane), who was involved in a long romantic relationship with Reeves and was the wife of MGM studio executive Eddie Mannix (Bob Hoskins). Reeves had ended the affair and had become engaged to a younger woman, aspiring actress Leonore Lemmon (Robin Tunney).\n\n\nLook, Up in the Sky! The Amazing Story of Superman \n==================================================\nA 2006 documentary film from executive producers Bryan Singer and Kevin Burns which details the history of the Superman franchise, from comic book, to television, to the big screen. The story of Superman is told through archival footage, as well as interviews with many of the actors, directors, and producers involved with the Superman media over the years. The closing credits feature outtakes from the Christopher Reeve Superman films, including an outtake of Marlon Brando improvising during the recitation of a poem in a scene deleted from the original version of Superman II.\n\n\nSuperheroes: A Never Ending Battle\n==================================\nThe first documentary to examine the dawn of the comic book genre and its powerful legacy, as well as the evolution of the characters who leapt from the pages over the last 75 years and their ongoing worldwide cultural impact. \n(A three-part, three-hour mini-series)\n\n\nThe science of Superman\n=======================\nThe Science of Superman is a documentary film analyzing Superman's powers, how they would work, and which ones might be possible, or could at least be scientifically explained.\n\n\nThe Making of Superman II\n=========================\nA video on how Superman II was made by Alexander Salkind.\n\n\n\n\n\n\n\n\n\n\n--- ALSO ---\n\nDo you like oldies? Check out MaxiMusic! MaxiMusic is a collection of popular and rare oldies from the 1910-2000's. Either search &quot;MaxiMusic&quot; on The Pirate Bay, or head over to this link:\n   &lt;a href=&quot;\nhttp://thepiratebay.se/user/MaxiMusic/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/MaxiMusic/&lt;/a&gt;\n","torrent":{"xt":"urn:btih:f562157520122787edf20aab999c8b1724afadea","amp;dn":"Superman+Documentary+6-Pack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f562157520122787edf20aab999c8b1724afadea","infoHashBuffer":{"type":"Buffer","data":[245,98,21,117,32,18,39,135,237,242,10,171,153,156,139,23,36,175,173,234]},"announce":[],"urlList":[]}}