{"title":"Lonely Planet Sweden 6th Edition","uid":12879999,"size":46537870,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f59bb29539909fe9464fe2be4453947438c80d39&amp;dn=Lonely+Planet+Sweden+6th+Edition&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"TopShelfBook","files":2,"time":1448999683,"description":"Lonely Planet Sweden 6th Ed.: 6th Edition | EPUB\r\n\r\nLonely Planet: The world's leading travel guide publisher \r\n\r\nLonely Planet Sweden is your passport to the most relevant, up-to-date advice on what to see and skip, and what hidden discoveries await you. Experience the beauty of Stockholm's glittering waterways and cobble-stoned streets, hike through the wild natural landscape of its northern regions, or dine on innovative Swedish cuisine; all with your trusted travel companion. Get to the heart of Sweden and begin your journey now!\r\n\r\nInside Lonely Planet's Sweden Travel Guide: \r\n\r\n\r\n- Colour maps and images throughout - Highlights and itineraries help you tailor your trip to your personal needs and interests - Insider tips to save time and money and get around like a local, avoiding crowds and trouble spots - Essential info at your fingertips - hours of operation, phone numbers, websites, transit tips, prices - Honest reviews for all budgets - eating, sleeping, sight-seeing, going out, shopping, hidden gems that most guidebooks miss - Cultural insights give you a richer, more rewarding travel experience - including history, literature, cinema, design, architecture, music, politics, landscapes, wildlife, cuisine, customs. - Free, convenient pull-out Stockholm map (included in print version), plus over 50 maps - Covers Stockholm, Lappland, the Far North, Ostersund, the Bothnian Coast, Uppsala, Central Sweden, Goteborg, the Southwest, Malmo, the South, the Southeast, Gotland, Visby, Stockholm Archipelago, and more\r\nThe Perfect Choice: Lonely Planet Sweden, our most comprehensive guide to Sweden, is perfect for both exploring top sights and taking roads less travelled.\r\n\r\n**PLEASE SEED**","torrent":{"xt":"urn:btih:f59bb29539909fe9464fe2be4453947438c80d39","amp;dn":"Lonely+Planet+Sweden+6th+Edition","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f59bb29539909fe9464fe2be4453947438c80d39","infoHashBuffer":{"type":"Buffer","data":[245,155,178,149,57,144,159,233,70,79,226,190,68,83,148,116,56,200,13,57]},"announce":[],"urlList":[]}}