{"title":"Privacy Eraser Pro v2.8 Build 639 Incl Patch-ATT [TorDigger]","uid":10476921,"size":6152234,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:f66e62a3238142aefb1e2083f1599ded86bae2b0&amp;dn=Privacy+Eraser+Pro+v2.8+Build+639+Incl+Patch-ATT+%5BTorDigger%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"TorDigger","files":11,"time":1404348310,"description":"Privacy Eraser Pro\n\nPrivacy Eraser is an all-in-one privacy suite that protects your privacy by cleaning up all your Internet history tracks and past computer activities. It supports popular web browsers such as Internet Explorer, Mozilla Firefox, Google Chrome, Safari and Opera.\n\nWith simply one click, Privacy Eraser can quickly erase the Internet cache, cookies, browsing history, address bar history, typed urls, autocomplete form history, saved password and index.dat files of your browser, and Windows' run history, search history, open/save history, recent documents, temporary files, recycle bin, clipboard, taskbar jump lists, dns cache, log files, memory dumps, error reporting and much more.\n\nFurthermore, Privacy Eraser supports plug-ins to extend cleaning features, you can easily delete the tracks left by any applications by making your own plug-ins. Privacy Eraser embedded more than 200 FREE plug-ins which supports the most popular programs such as ACDSee, Adobe Reader, Microsoft Office, WinZip, WinRAR, Windows Media Player, VLC Player, eMule, BitTorrent, Google Toolbar and many others. With the flexible, highly customizable and open plug-in architecture, you can even customize your own exclusive Privacy Eraser!\n\nPrivacy Eraser works on Microsoft Windows 8.1/8/7/Vista/XP/2012/2008 (32/64-bit) and supports Microsoft Windows FAT16/FAT32/exFAT/NTFS file systems, completely implements and exceeds the US Department of Defense and NSA clearing and sanitizing standard, to gives you confidence that once erased, your file data is gone forever and can not be recovered.\n\nMajor Features:\n\nInternet Explorer, Mozilla Firefox, Google Chrome, Safari and Opera\nCleans Internet cache (Temporary Internet Files ), Internet history, cookies, typed urls, download history, autocomplete/autofill form history, saved password, etc.\n\nWindows\nCleans run history, search history, open/save history, recent documents, temporary files, recycle bin, clipboard, taskbar jump lists, dns cache, log files, memory dumps, error reporting, etc.\n\nThird-party Applications\nOver 200 FREE, pre-configured plug-ins to clean the tracks of popular applications. You can also extend cleaning features by making your own app plug-ins. This allows you to easily remove the history traces left by any applications.\n\nFlexible, Highly Customizable and Open Plug-In Architecture\nEmbedded the flexible, highly customizable and open plug-in architecture, you can even customize your own exclusive Privacy Eraser!\n\nSecurity Level\nSupports Simple zero-fill (1 pass), US DoD 5220.22-M (3 passes), US DoD 5220.22-M (ECE) (7 passes), Peter Gutmann (35 passes) and custom wipe methods.\n\nFile Shredder\nPermanently erases specified files and folders from your PC beyond recovery.\n\nDrive Wiper\nSecurely wipes spare and hidden data areas on your drives. All free clusters on the drives, including the contents of deleted files and folders, will be wiped like a new drive.\n\nCookies Manager\nYou can easily select which cookies to keep and which to delete during each cleaning process. This will keep your persistent login cookies for websites, such asGmail and Yahoo! Mail.\n\nWindows Startup Manager\nYou can control which programs will be loaded automatically during Windows startup.\n\nApp Uninstaller\nYou can easily uninstall/remove any unwanted applications from your PC.\n\nStealth Mode\nYou can run Privacy Eraser in invisible mode. In this case, Privacy Eraser will not show an eraser icon in the system tray, but it can still work in the background.\n\nBoss Mode\nYou can instantly hide and restore the applications (windows) on your screen in order to prevent uninvited persons from seeing them and protect your sensitive information.\n\nSchedule Options\nYou can easily schedule cleaning tasks to run at a time that is most convenient for you, such as every specified number of minutes, hours, daily, weekly, monthly, or at certain times.\nAnd much more...\n\nKey Benefits:\n\nEasy to use\nCleans up all your Internet history tracks and past computer activities with one click.\n\nPrivacy\nPermanently deletes Internet history, visited urls, saved user names and passwords from a public or shared computer.\n\nSecurity\nCompletely implements and exceeds the US Department of Defense and NSA clearing and sanitizing standard, to gives you confidence that once deleted, your file data is gone forever and can not be recovered.\n\nSpace\nRecovers and maximizes hard drive space by deleting unnecessary files.\n\nSpeed\nSpeeds up Internet surfing and browsing, boosts your PC's performance and stability making it much faster and efficient!\n\nSupported OS:\n\nWindows 8.1/8/7/Vista/XP/2012/2008 (32/64-bit)\n\nHomepage: http://www.cybertronsoft.com/products/privacy-eraser/\n\nInstallation Instructions: \n\n- Install program.\n- Apply Patch to get registered application.\n- Done, Enjoy.\n\nHave A Nice Day\n\nNote: Uploader is only responsible if any problem in torrent, never responsible for software functionality problems.","torrent":{"xt":"urn:btih:f66e62a3238142aefb1e2083f1599ded86bae2b0","amp;dn":"Privacy+Eraser+Pro+v2.8+Build+639+Incl+Patch-ATT+%5BTorDigger%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f66e62a3238142aefb1e2083f1599ded86bae2b0","infoHashBuffer":{"type":"Buffer","data":[246,110,98,163,35,129,66,174,251,30,32,131,241,89,157,237,134,186,226,176]},"announce":[],"urlList":[]}}