{"title":"[XLGirls] Marilyn Mayson (Marilyn Does a Body Good)","uid":8483199,"size":305693942,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:f6ba6a7de5cd348494995c68000cc8837d717b9c&amp;dn=%5BXLGirls%5D+Marilyn+Mayson+%28Marilyn+Does+a+Body+Good%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"chkm8te","files":2,"time":1368788989,"description":"[XLGirls] Marilyn Mayson (Marilyn Does a Body Good)\n\nMarilyn Mayson Might be wearing her sexiest outfit to Date in this smokin 'XLGirls Show. It's tight, just right and curve-hugging like a Maserati on a mountain road. The brunette beauty admires herself in the mirror before lowering her dress to pop her bra-clad hooters out. She Plops each Magnificent MAM out of ITS Prison of fabric, two-Looking Tasty, Pointed tatas, the kind Women Spend Thousands to Get but can never Hope to Match, the kind of Big Boobs That Drive Men breastnotized sin-sane.\n\nMarilyn squeezes A glob of white moisturizer and spreads it all over her naked breast flesh, rubbing it in good while jiggling her tits as our cameraman captures the motion close-up. Marilyn's huge boobs fill the screen! The coating of White goo is A sign of Things to Come.\n\nAt this moment, A dude named James interrupts the sexy Bombshell, Claiming he was Looking for A comb. That's not a problem. Marilyn beckons him forward and asks him to help her get out of her dress before she gets lotion on it. As they slip her out of it, he's on her like that lotion, his hands roaming her chest, palming her soft breast flesh. &quot;Wanna stick your dick between them now that they're lotioned up?&quot; Marilyn asks. That question is really Necessary or does she just like to Say IT?\n\nHe lies back on the bed so Marilyn can Give HIM the wettest, messiest blow job and tit Fuck Could Get A MAN. Marilyn knows all the little tongue and titty tricks that rocket a guy into outer space. And then she rides him into sexual nirvana. Think of this Vixen What Could do to your boner.\n\nScreens: &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=l3z2fm2idxl65jr16zvd.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=l3z2fm2idxl65jr16zvd.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=icnlq1rw6z1phyt1wogt.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=icnlq1rw6z1phyt1wogt.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:f6ba6a7de5cd348494995c68000cc8837d717b9c","amp;dn":"%5BXLGirls%5D+Marilyn+Mayson+%28Marilyn+Does+a+Body+Good%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f6ba6a7de5cd348494995c68000cc8837d717b9c","infoHashBuffer":{"type":"Buffer","data":[246,186,106,125,229,205,52,132,148,153,92,104,0,12,200,131,125,113,123,156]},"announce":[],"urlList":[]}}