{"title":"Duel At Diablo (1966) Untouched DVD5 Western - James Garner, Syd","uid":11181952,"size":4393931382,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:f6cf01e79006ee773cb016fac6f7a1534eaf3ce0&amp;dn=Duel+At+Diablo+%281966%29+Untouched+DVD5+Western+-+James+Garner%2C+Syd&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"SaM","files":-1,"time":1412869662,"description":"Duel At Diablo (1966) Untouched DVD5 Western - James Garner, Sydney Poitier [DDR]\n\nDuel at Diablo is a 1966 western film starring James Garner in his first Western since leaving Maverick and Sidney Poitier in his first Western. Based on Marvin H. Albert's 1957 novel Apache Rising, the film was written by Albert and Michael M. Grilikhes and directed by Ralph Nelson who had directed Poitier in Lilies of the Field. The supporting cast includes Bibi Andersson, Bill Travers, Dennis Weaver and John Hoyt; Ralph Nelson has a cameo as an Army Major. The movie was shot on location amidst striking scenery in Utah; the musical score was composed by Neal Hefti.\n\n    CAST:-\n    James Garner as Jess Remsberg\n    Sidney Poitier as Toller\n    Bibi Andersson as Ellen Grange\n    Dennis Weaver as Willard Grange\n    Bill Travers as Lieutenant Scotty McAllister\n    Ralph Nelson as Colonel Foster\n    John Hubbard as Major Novak \n    John Hoyt as Chata\n    William Redfield as First Sergeant\n    Bill Hart as Corporal Harrington\n    Eddie Little Sky as Alchise\n    John Crawford as Clay Dean\n\nDirected by Ralph Nelson\nProduced by Fred Engel\nWritten by Marvin H. Albert\nMusic by Neal Hefti\nRunning time 103 min.\n\nMOVIE PLOT:- Duel At Diablo (1966) \nWhile crossing the desert, a frontier scout, Jess Remsberg (James Garner), rescues Ellen Grange (Bibi Andersson) from a pursuing band of Apaches, and returns her to her husband, Willard Grange (Dennis Weaver). The couple have been on the move since two years before, when Ellen Grange had been kidnapped by Apaches and rescued. The townsfolk treated her as an outcast because, in captivity, she had a child by an Indian warrior.\n\nJess is searching for the murderers of his Comanche wife. He travels to Fort Concho to obtain information from the town marshal. On the way there, he is contracted to act as a scout for an Army cavalry unit of twenty-five inexperienced soldiers bringing horses, ammunition, and supplies to the fort. Willard, Ellen, and her infant son are along for the ride, as is horse breaker Toller (Sidney Poitier), a veteran of the 10th Cavalry (the &quot;Buffalo Soldiers&quot;). As Toller was contracted to provide broken horses suitable for riding, he is paid only for the horses already broken and will accompany the party breaking his horses on the way. The commander of the detachment, Lt. &quot;Scotty&quot; McAllister, a highly experienced former sergeant, will give Toller receipts to be paid at Fort Concho.\n\nThe party is trapped in a canyon by Chata (John Hoyt), an Apache chief and grandfather of Ellen's baby. Willard is captured and tortured mercilessly. Jess sneaks away and brings reinforcements from the fort just in time to save the day. At the fort, Jess had learned that the man he has been hunting is none other than Willard Grange, out for revenge for what was done to his wife. He finds Willard, tied to a wagon wheel and barely alive. When Willard begs him to put him out of his misery, Jess gives him his pistol and leaves.\n\nTECHNICAL SPECIFICATIONS:-\nVideo Codec: MPEG-2\nVideo Bitrate: 4445 kbps\nVideo Resolution: 720x480\nVideo Aspect Ratio: 1.778:1\nFrames Per Second: 29.970\nAudio Codec:  AC3\nAudio Bitrate: 192kb/s CBR 48000 Hz\nAudio Streams:  2\nAudio Languages: English\nRunTime 103 mins\nSubtitles: NONE\nRipped by: Trinidad [DDR]","torrent":{"xt":"urn:btih:f6cf01e79006ee773cb016fac6f7a1534eaf3ce0","amp;dn":"Duel+At+Diablo+%281966%29+Untouched+DVD5+Western+-+James+Garner%2C+Syd","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f6cf01e79006ee773cb016fac6f7a1534eaf3ce0","infoHashBuffer":{"type":"Buffer","data":[246,207,1,231,144,6,238,119,60,176,22,250,198,247,161,83,78,175,60,224]},"announce":[],"urlList":[]}}