{"title":"Stoned - The Brian Jones story - Rolling Stones DVD rip Unrated","uid":3961215,"size":662828488,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:f7c1985e5c4eccf8fc53a195e20e81f32ddeb41d&amp;dn=Stoned+-+The+Brian+Jones+story+-+Rolling+Stones+DVD+rip+Unrated&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"st2580smile","files":1,"time":1199465273,"description":"Plot Synopsis by Mark Deming\n\n \nThe final days of one of the truly legendary figures of British rock &amp; roll are explored in this biographical drama, which marks the directorial debut of veteran producer Stephen Woolley. Brian Jones (played by Leo Gregory) was one of the founding members of the Rolling Stones, and his incisive blues guitar style, broad range of musical influences, and striking blond good looks helped establish him as part of the true royalty of the British music scene. But by 1969, Jones&amp;#039; life had begun to spiral out of control; his appetite for drugs made him wildly unreliable, his arrests for possession of marijuana prevented the Stones from touring the United States, his bandmates Mick Jagger (Luke de Woolfson) and Keith Richards (Ben Whishaw) had grown tired of working with him (and envious of the attention he received in the press), and his longtime paramour Anita Pallenberg (Monet Mazur) had become involved with fellow Stone Richards. Worried about Jones&amp;#039; drug abuse, the band&amp;#039;s tour manager, Tom Keylock (David Morrissey), hires middle-aged carpenter Frank Thorogood (Paddy Considine) to do some repairs at Jones&amp;#039; estate, but also asks him to look after the musician and try to keep him away from dope. Keylock underestimates the power of Brian&amp;#039;s personality, and before long, the straight-arrow Thorogood is Jones&amp;#039; household manservant and partner in hedonism, through Thorogood begins to chafe at the emotional games Jones enjoys playing with his new companion. Stoned was adapted in part from three different books on Brian Jones and the Rolling Stones as well as recently uncovered interviews with people who claim to have been involved in Brian Jones&amp;#039; death.(AMG)\n \n","torrent":{"xt":"urn:btih:f7c1985e5c4eccf8fc53a195e20e81f32ddeb41d","amp;dn":"Stoned+-+The+Brian+Jones+story+-+Rolling+Stones+DVD+rip+Unrated","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f7c1985e5c4eccf8fc53a195e20e81f32ddeb41d","infoHashBuffer":{"type":"Buffer","data":[247,193,152,94,92,78,204,248,252,83,161,149,226,14,129,243,45,222,180,29]},"announce":[],"urlList":[]}}