{"title":"Design Methods (Part 1) by John Chris Jones","uid":4526720,"size":51421638,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f87a4041b6be1401fd09c619f2f839637b09d7be&amp;dn=Design+Methods+%28Part+1%29+by+John+Chris+Jones&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bra1ns","files":-1,"time":1227380393,"description":"Design Methods (Part 1) by John Chris Jones\n\nThis is NOT the complete book, but the first part of the book (up to page 86).\nThe source images are photos and photocopies of the book's pages.\n &lt;a href=&quot;\nhttp://books.google.com/books?id=IR7KZXa1Nl8C&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://books.google.com/books?id=IR7KZXa1Nl8C&lt;/a&gt;\n\nAn interesting interview with John Chris Jones:  &lt;a href=&quot;\nhttp://www.nextd.org/02/09/02/index.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.nextd.org/02/09/02/index.html&lt;/a&gt;\n\n&quot;...'stepping away' is to me the error of all of us as instruments or victims of an incapable society, governed by hierarchy, mechanization and other such blindnesses, a divided culture that forces us to act more narrowly and less imaginatively than we are capable of doing. Instead of blaming early upbringing, I tend to blame the narrowness of industrial society and the pressure to specialize and to refuse responsibility for the situation as a whole.&quot;\n\n---------------------------------------------------------------------------------\n\nPublisher: Wiley; 2nd edition (1992)\nLanguage: English\nISBN-10: 0471284963\nISBN-13: 978-0471284963\n\nSince its initial publication in 1970, Design Methods has been considered the seminal work on design methodology. Written by one of the founders of the design methods movement, it has been highly praised in international journals and has been translated into Japanese, Romanian, Polish, Russian, and Spanish. As Jones states in the preface: &quot;Alongside the old idea of design as the drawing of objects that are then to be built or manufactured there are many new ideas of what it is, all very different:\n\n* designing as the process of devising not individual products but whole systems or environments such as airports, transportation, hypermarkets, educational curricula, broadcasting schedules, welfare schemes, banking systems, computer networks;\n \n* design as participation, the involvement of the public in the decision-making process;\n    \n* design as creativity, which is supposed to be potentially present in everyone;\n    \n* design as an educational discipline that unites arts and science and perhaps can go further than either;\n    \n* and now the idea of designing Without a Product, as a process or way of living in itself.&quot;\n\nDesign Methods first evaluates traditional methods such as design-by-drawing and shows how they do not adequately address the complexity of demands upon today's designer. The book then provides 35 new methods that have been developed to assist designers and planners to become more sensitive to user needs. These methods move beyond a focus on the product to the thought that precedes it. Throughout, the book's emphasis on integrating creative and rational skills directs readers away from narrow specialization to a broader view of design. The new methods are described and classified in a way that makes it easier for designers and planners to find a method that suits a particular design situation. They include logical procedures such as systematic search and systems engineering, data gathering procedures such as literature searching and the writing of questionnaires, innovative procedures such as brainstorming and synectic and system transformation, and evaluative procedures such as specification writing and the selection of criteria. Offering a wider view--accompanied by appropriate skills--than can be obtained from the teaching of any specialized design profession, Design Methods is important reading for designers and teachers in numerous fields. It will be welcomed by engineers, architects, planners, and landscape architects, as well as by interior, graphic, product, and industrial designers. This extraordinary book will provide key insights to software designers and numerous others outside traditional design professions who are nevertheless creatively involved in design processes. It is also relevant to the teaching of cultural studies, technology, and any kind of creative project.","torrent":{"xt":"urn:btih:f87a4041b6be1401fd09c619f2f839637b09d7be","amp;dn":"Design+Methods+%28Part+1%29+by+John+Chris+Jones","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f87a4041b6be1401fd09c619f2f839637b09d7be","infoHashBuffer":{"type":"Buffer","data":[248,122,64,65,182,190,20,1,253,9,198,25,242,248,57,99,123,9,215,190]},"announce":[],"urlList":[]}}