{"title":"Man-Be Good To Yourself At Least Once A Day (LP-Rip)-FLAC","uid":6878337,"size":254341471,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:f8a3cf66e770f8fd1994ec8045ef2f71ef64d4cc&amp;dn=Man-Be+Good+To+Yourself+At+Least+Once+A+Day+%28LP-Rip%29-FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Ritxard","files":9,"time":1323543129,"description":" \n\nKaixo, Hello, Sali ZÃƒÂ¤mÃƒÂ¤ !!!\nHere is another great classic from my mother's LP collection. \nToday it's Man's &quot;Be Good To Yourself At Least Once A Day&quot; album in .flac. Recorded with NÃ‚Âº 23 Recorder (A very nice freeware) to WAVE, edited with Nero Wave Editor and converted to FLAC with DB Poweramp.\nThe two tracks on the first side seemed unseparable to me so I left them almost untouched. And as it is a LP - Rip it comes with noises. If you want some more information about The Band take a look here: http://en.wikipedia.org/wiki/Man_(band) For further information about the album look here:http://en.wikipedia.org/wiki/Be_Good_to_Yourself_at_Least_Once_a_Day\n\n\nAnd here is some REAL IMPORTANT INFORMATION:\nThis is the one and only way how to prepare the real Marianito preparao as it has to be on sunday morning after church: \nGive about five or six ice cubes into a jar\nnow a litlle hint of Angostura over the ice (0,5 cl)\nadd some fine quality gin and Red CuraÃƒÂ§ao (1cl of each)\nnow add Martini Rosso (10cl)\nstir it , NEVER AND IN NO WAY THINK ABOUT SHAKING HIM !!!!!!\npour it with filtering the ice into two cocktailglasses \nadd a piece of orange skin lightly pressed over each of the Marianitos preparaos. \nEnjoy with some Olives or caracoliÃƒÂ±os. And thank the lord that you are so lucky to live in Bilbao, the center of the universe where they make the best of them. AMEN\n\n\nPlease don't be upsetted if the download may take a while: I can only upload with a speed of about 200 KBit/s. Blame Euskaltel and or the basque and especially the spanish government for it !!!!!\n\nHave also a look on other torrents I've posted and feel free to place a comment or a feedback. I would be very glad about. Eskerrik asko ! Thank you!\n\n---------------------------------------------------------------------------------------------------\n \n \nAupa Athletik! Beti zurekin!\n\n\nBerne is the capital of Switzerland. It has seven times the size of the graveyard of Naples, but it's only half as funny. (Luciano di Crescenco)\n\n \nSeed, or you'll get anal punishment from Rocco Siffreddi! \n \n","torrent":{"xt":"urn:btih:f8a3cf66e770f8fd1994ec8045ef2f71ef64d4cc","amp;dn":"Man-Be+Good+To+Yourself+At+Least+Once+A+Day+%28LP-Rip%29-FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f8a3cf66e770f8fd1994ec8045ef2f71ef64d4cc","infoHashBuffer":{"type":"Buffer","data":[248,163,207,102,231,112,248,253,25,148,236,128,69,239,47,113,239,100,212,204]},"announce":[],"urlList":[]}}