{"title":"Psychic Lifeforce Vampirism (PDFs and Videos)","uid":15458425,"size":616529639,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f92db21c9506250d729d01ad9b6414421fc2bd31&amp;dn=Psychic+Lifeforce+Vampirism+%28PDFs+and+Videos%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"barlattan","files":53,"time":1470017167,"description":"Psychic Lifeforce Vampirism (PDFs and Videos)\r\nThe Complete Collection of the VAMPIRE TEMPLE.\r\n(PDF Books, Photos and Videos)\r\n\r\nWith this Torrent you have the authentic Teachings of true Vampirism. You have every published  book of the Temple of the Vampire. The Vampire is the next step in human evolution. If you are ready, the Temple is here to empower you. READ AND LEARN !!! This is the Path of Immortality. The Energy-Psychic Vampires are Real, blood is a metaphor, they dont drink real blood, but they take your lifeforce energy of the soul. They drink your prana! They steal your astral blood, your Ki, Chi, etc.\r\n\r\nThe following folders include All the  PDF ebooks of the Temple of the Vampire, photos and audioVideos:\r\n- Awaken to Your Vampire Nature\r\n- Basic Information\r\n- Extra Knowledge\r\n- The Bloodlines\r\n- The Five Bibles\r\n- The Vampire by Night\r\n- ToV Photos\r\n- Vampiric Bibles\r\n\r\nTOV DETAILS:\r\nThe Temple of the Vampire is an ancient religion now registered with the federal government of the United States, and possessing an international membership. Shrouded in secrecy, the Temple has been known in historical times by many different names to include The Order of the Dragon, The Temple of the Dragon, and in ancient Samaria, as Hekal Tiamat (The Temple of the Vampire Dragon Goddess, Tiamat). Membership, until the present time, has been closed except by personal sponsorship and invitation, subject to the approval of the inner council. The modern Temple is a careful calculated experiment to more publicly reach those of us who may be of the Body of the Blood yet unaware of our full heritage. We seek only those who have become aware of their unique difference from the mass herd of humanity, those who resonate with the Dark of the Night, those who have recognized their nature as predators, those who sense there is something more to life and want to possess it. Vampires are the predator humans. We have come from the human stock, but represent the next stage in human evolution. We who accept and glory in our predatory nature. We fully accept our bestial instincts and origins while applying the power of our minds and will to the achievement of our deepest desires through earthly and magical means. We are the masters of the world. Our reach extends from the highest corporate executive offices to the most secluded country estates. Our membership includes almost virtually every profession and lifestyle. Our interest in world affairs is that of leaders who control and command, rather than mere followers who hear and obey. We have a rational plan for the world and for our own personal physical immortality. We are the few who truly rule this material world and those who throw their lot with us are wise indeed. Many are called. Fewer still, enter. \r\n\r\nNow, you know they Truth about VAMPIRES...\r\nSeed and Share!","torrent":{"xt":"urn:btih:f92db21c9506250d729d01ad9b6414421fc2bd31","amp;dn":"Psychic+Lifeforce+Vampirism+%28PDFs+and+Videos%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f92db21c9506250d729d01ad9b6414421fc2bd31","infoHashBuffer":{"type":"Buffer","data":[249,45,178,28,149,6,37,13,114,157,1,173,155,100,20,66,31,194,189,49]},"announce":[],"urlList":[]}}