{"title":"After Stonewall [1999] John Scagliotti","uid":6829176,"size":1576443521,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:f94569badd46e65581c047b16f30091b5615e06b&amp;dn=After+Stonewall+%5B1999%5D+John+Scagliotti&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ThorntonWilde","files":10,"time":1321719186,"description":"After Stonewall (1999) \n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0244955/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0244955/&lt;/a&gt;\n\nNarrated by Melissa Etheridge, this engrossing documentary details our fight for social and political justice after the fateful night that saw a group of drag queens take one stiletto step forward for justice and one giant leap toward homosexual equality and in the process, lay the foundation stone of the gay rights movement of today. \n\nYet in detailing the changing times from the Stonewall riot through to the new millennium, no work of this nature could not but comment upon the onset of AIDS, its devastating consequences and the fight of the gay community against the indifference and sheer ignorance of the White House. To this end, it documents the Reagan administration and one that will go down in history as having grossly mishandled the AIDS epidemic. Yet in keeping a presidential balance, this work equally comments upon Bill Clinton's political promises to the gay electorate and ones that for many, turned into bitter betrayals. \n\nThe frustrating problem with this absorbing film is that it is almost impossible to adequately detail decades of political and social change in just under ninety minutes; years that saw the growth of the gay press, the reality of AIDS, the Names Project Quilt, the horrific murders of Harvey Milk and Matthew Shepard, the emergence of the queer cinema movement, the Gay Games, openly gay writers, the growing visibility of out personalities, political wins, social losses, the antigay hysteria of the Religious Right ... and the list goes on. \n\nThat this film does it best to address such a series of key issues and events is a credit to its crew and inparticular director John Scagliotti, who as before intercuts his work with a series of fascinating recollections from activists of the period and archive footage of the time. Yet the result is more than just a hugely informative work, given this moving documentary makes you sit back and take account of and in the words of the film itself: &quot;a quarter century of lesbian and gay activism.&quot;","torrent":{"xt":"urn:btih:f94569badd46e65581c047b16f30091b5615e06b","amp;dn":"After+Stonewall+%5B1999%5D+John+Scagliotti","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f94569badd46e65581c047b16f30091b5615e06b","infoHashBuffer":{"type":"Buffer","data":[249,69,105,186,221,70,230,85,129,192,71,177,111,48,9,27,86,21,224,107]},"announce":[],"urlList":[]}}