{"title":"Octopus - From A to B [1996]","uid":9408377,"size":354902435,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:f9d07366801f2498e3bab47352a678ca805fffe0&amp;dn=Octopus+-+From+A+to+B+%5B1996%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GenXRock","files":-1,"time":1388214327,"description":"AMG 4.5/5\n\nFrom a to b is the only album by the British alternative rock/Britpop band Octopus, released in October 1996 on Food Records. The album contained four singles, all of which charted within the British Top 100 (although only one, &quot;Saved&quot;, scraped into the Top 40).\nFrom a to b was recorded in various sessions in six different studios. The band's producer was David Francolini (formerly the drummer with Levitation and later performing the same role for Dark Star) with Chris Sheldon assisting with several of the mixes.\nDuring the recording, various external musicians were brought in to play core instrumental parts. Only five of the album's fifteen tracks do not feature a guest bass guitar player: the other ten tracks feature bass playing by sessions musician Dave Quinn, Francolini's former Levitation colleague Robert White (also of The Milk and Honey Band), or the original Octopus bass guitarist Steven McSeveney. In addition, Francolini plays drums on two tracks and piano on another, as well as playing Moog synthesizer on five tracks and contributing keyboards, percussion, samples and various noises throughout the album. Francolini also co-wrote six of the album's songs, including the single &quot;Magazine&quot;.\nOther contributing musicians include both core members of Blowpipe (Robin and Andrew Blick, the latter of whom was part of Octopus' live brass section), singer Katherine Blake (Mediaeval Baebes, Miranda Sex Garden), folk musician Nigel Mazlyn Jones and cellist Audrey Riley.","torrent":{"xt":"urn:btih:f9d07366801f2498e3bab47352a678ca805fffe0","amp;dn":"Octopus+-+From+A+to+B+%5B1996%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f9d07366801f2498e3bab47352a678ca805fffe0","infoHashBuffer":{"type":"Buffer","data":[249,208,115,102,128,31,36,152,227,186,180,115,82,166,120,202,128,95,255,224]},"announce":[],"urlList":[]}}