{"title":"Orlando - Passive Soul [1997]","uid":9618297,"size":319483270,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:fa488b27f7cbfea16af043ce9811f0bf61e37224&amp;dn=Orlando+-+Passive+Soul+%5B1997%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"GenXRock","files":-1,"time":1392454121,"description":"Review by Stephen Thomas Erlewine  [-]\nNobody wanted romo, but the music industry didn't realize that until it was too late. It wasn't until Melody Maker's Fiddling When Romo Burns tour went up in flames that the industry and journalists realized that Simon Price and Taylor Parkes' grand folly wasn't going to work. Just about 100 people attended the tour throughout the entire nation in 1996, but a few recordings were stuck in the pipeline. Mostly, they were singles, but there was one full-length record ready to be unleashed -- Orlando's brilliant Passive Soul. Even if there had been competition within the romo world -- in other words, if other romo bands had been allowed to release a full-length album -- Passive Soul would still stand as the movement's Sgt. Pepper since it is so fully realized and accomplished. After all, Orlando had a broader reach than their peers, digging back to the past to draw on Motown, Northern soul, and Philly soul, all crossed with an ironic detachment borrowed from Bowie and Brian Ferry, of course, but also pitched at the intimate scale and deliberate introspection so reminiscent of the Sarah Records roster. So, yes, this album masterminded by Tim and Dickon is clearly studied and careful, but that earnestness of ambition is endearing, especially since it's tempered by the bedsit fascinations and obsessions of these effete misfits. That means there are some bewildering moments on Passive Moments -- the &quot;Oh Tennenbaum&quot; introduction to the album, the crooning of Tim, Dickon's weirdly personal confessions, such as &quot;a brown carpet will hide all stains&quot; -- but it's ultimately a triumph of unabashed style and shyness, filled with lively hooks and impassionedly fey sentiment. Yes, it is all too precious -- even Sebadoh fans will find this entirely too sensitive -- but that's its charm, since Orlando is about being delicate outsiders who find life within pop music, especially when it's awkward, geeky, and just waiting to bloom. This album captures that outsider sentiment as well as any other pop album, which means that it's not just the best romo album ever (and it still would have been the best, even if another romo group would have had the chance to record), but it's one of the best indie pop records of its time. (4.5/5)","torrent":{"xt":"urn:btih:fa488b27f7cbfea16af043ce9811f0bf61e37224","amp;dn":"Orlando+-+Passive+Soul+%5B1997%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fa488b27f7cbfea16af043ce9811f0bf61e37224","infoHashBuffer":{"type":"Buffer","data":[250,72,139,39,247,203,254,161,106,240,67,206,152,17,240,191,97,227,114,36]},"announce":[],"urlList":[]}}