{"title":"Coast to Coast AM December 26 2012","uid":7962237,"size":55896625,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:fc2a5efae9350f647f5793d3531c5d73d21543bc&amp;dn=Coast+to+Coast+AM+December+26+2012&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"runcdfirst","files":5,"time":1356615447,"description":"#we.are.some.of.the.leaders.on.the.motherpla.net\n\nDate: \t12-26-12\nHost: \tGeorge Noory\nGuests: \tDoug Elwell, Dr. George Pratt\n\nIn the first half, clinical psychologist Dr. George Pratt talked about techniques for achieving emotional and psychological well being. He noted that stress, which releases the hormone cortisol, can suppress the function of the immune system. One way to counteract this is to do a breathing exercise, where one simply observes their breath. This will trigger a relaxation response, and a host of positive biochemical measures, he said. Regarding New Year's resolutions, Pratt suggested that people pick just one goal to focus on. Write down your goal and delineate specifically what you want to happen-- the writing process helps to transfer the data and activate different parts of the brain, he stated.\n\nBy utilizing tools that access the subconscious mind, you can have more powerful results than working with the conscious mind, he continued. He described a balanced breathing exercise (video) which can adjust a person's polarity or electrical system. Dr. Pratt discussed the process for releasing deeply held negative beliefs, and unlocking your natural state of happiness. He also cited three powerful therapeutic tools-- EMDR, clinical hypnosis, and energy psychology (tapping).\n\n------------------------------------\n\nIn the latter half, publisher of the Mysterious World books, Doug Elwell, discussed his research on Planet X, as well as the ancient evidence for giants, and riddles of the Sphinx. He believes that during Planet X's first pass, the Earth was moved into its current orbit, closer to the sun than it was originally. Subsequently, when Planet X enters the inner solar system around every 2,000 years, it only comes as far as the asteroid belt, but it scatters a lot of asteroids around, and some of these impact Earth, he stated. One of these Planet X-related asteroids may have caused the destruction of the ancient Sumerian empire, he added. Elwell said there are numerous coded references to Planet X in the Bible, such as the trumpet judgments in Revelation, as well as in the Genesis flood narrative; he also contends that the Star of Bethlehem was actually Planet X.\n\nThe dire prophecies of Revelation may relate to Planet X's next arrival-- it could come closer to the Earth than previous passes if its path is perturbed when it passes Jupiter or Saturn, he said. Regarding giants, Elwell suggested they were designed by the fallen angels, who used them as an army in their battle to retake the throne of heaven. He also theorized that buried underneath the Sphinx in Egypt is an ancient technological artifact from the world before the flood. Referred to by Cayce as the Hall of Records, the artifact is a stone such as a sapphire, which can hold massive amounts of data, and function as a powerful weapon, he continued, adding that according to his interpretation of prophecy, it will eventually be recovered by the Antichrist and used to conquer the world.\n\nNews segment guests: Lauren Weinstein, Dr. Betty Martini\nWebsite(s):\n\n    mysteriousworld.com\n    ireland.mysteriousworld.com\n   \n    codetojoy.com\n\nBook(s):\n\n    Planet X: The Sign of the Son of Man and the End of the Age\n    The Riddle of the Sphinx\n    Code to Joy\n\n","torrent":{"xt":"urn:btih:fc2a5efae9350f647f5793d3531c5d73d21543bc","amp;dn":"Coast+to+Coast+AM+December+26+2012","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fc2a5efae9350f647f5793d3531c5d73d21543bc","infoHashBuffer":{"type":"Buffer","data":[252,42,94,250,233,53,15,100,127,87,147,211,83,28,93,115,210,21,67,188]},"announce":[],"urlList":[]}}