{"title":"Think Of A Number.pdf","uid":5162364,"size":11546303,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fe36f9478b64cd51ad7ca1557a3d7ca20272bbc3&amp;dn=Think+Of+A+Number.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Djofullinn","files":1,"time":1258219608,"description":"Product Description\nMaths isn't just about sums and calculations, number can take you anywhere. With &quot;Think of a Number&quot; you'll explore a fantastic world of wonder that is full of surprises. Join Johnny Ball on a dazzling adventure to infinity and beyond - crack codes, unravel mazes and discover why finding a prime number could make you a millionaire. Test your friends with magic tricks and mind-reading techniques and find out about the simple puzzles that stumped the world's brainiest mathematicians for centuries. Think maths is boring? Think again!\n\n\nAbout the Author\nJohnny Ball has masterminded and presented more than 20 children's television series about maths and science. He is best known for the hit BBC series Think of a Number, which transformed maths for a generation of children. A former Butlins redcoat and comedian, Johnny presented Playschool for 17 years and has earned an EMMY nomination, a BAFTA, and 10 other awards. A Fellow of the Mathematical Association, Johnny has written five children's books and the hit educational musical &quot;Tales and Maths and Legends&quot;.\n\n","torrent":{"xt":"urn:btih:fe36f9478b64cd51ad7ca1557a3d7ca20272bbc3","amp;dn":"Think+Of+A+Number.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fe36f9478b64cd51ad7ca1557a3d7ca20272bbc3","infoHashBuffer":{"type":"Buffer","data":[254,54,249,71,139,100,205,81,173,124,161,85,122,61,124,162,2,114,187,195]},"announce":[],"urlList":[]}}