{"title":"Flying Tigers (1942) Xvid 1cd - War Drama - John Wayne, Mae Clar","uid":10612093,"size":733911040,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:ff3be85065e32741cc3d07401ece8587ba1d0702&amp;dn=Flying+Tigers+%281942%29+Xvid+1cd+-+War+Drama+-+John+Wayne%2C+Mae+Clar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"SaM","files":-1,"time":1406052966,"description":"Flying Tigers (1942) Xvid 1cd - War Drama - John Wayne, Mae Clarke, John Carroll [DDR]\n\nFlying Tigers (a.k.a Yank Over Singapore and Yanks Over the Burma Road) is a 1942 black-and-white war film, starring John Wayne and John Carroll as pilots in the mercenary fighter group fighting the Japanese in China prior to the U.S. entry into World War II.\n\nFlying Tigers dramatized the exploits of Americans already fighting the enemy in the Pacific. It was unabashedly a propaganda film that was well received by a populace looking for a &quot;flagwaver.&quot;\n\n    CAST:-\n    John Wayne as Capt. Jim Gordon\n    John Carroll as Woodrow &quot;Woody&quot; Jason\n    Anna Lee as Brooke Elliott\n    Paul Kelly as Hap Smith, Pilot\n    Gordon Jones as &quot;Alabama&quot; Smith\n    Mae Clarke as Verna Bales\n\nDirected by David Miller\nProduced by Edmund Grainger\nMusic by Victor Young\nRunning time 102 minutes\n\nSYNOPSIS:- Flying Tigers (1942)\nJim Gordon (John Wayne in his first war film) leads the Flying Tigers, a legendary unit not sanctioned by the American government at the time. His men fly Curtiss P-40 fighters against Japanese bombers and fighters in the skies over China. The pilots are a mixed bunch, motivated by money (they receive a bounty for each aircraft shot down), patriotism or just the thrill of combat.\n\nOne day, old friend Woody Jason (John Carroll) enlists. An arrogant, hot-shot aviator, he starts causing trouble immediately. When the Japanese raid the base, the enthusiastic new arrival goes after them, taking up a fighter aircraft without permission, not realizing until too late that it has no ammunition. As a result, he is shot down. He is unharmed, but the precious fighter is a wreck. As time goes on, he shows that he has little use for teamwork, alienating and endangering the other pilots. He abandons his wingman, Blackie Bales (Edmund MacDonald), to chase a Japanese airplane. As a result, Blackie is killed after bailing out of his crippled fighter.\n\nWoody starts romancing nurse Brooke Elliott (Anna Lee), who had been waiting for Jim to notice her. One night, they go on a date. When he is late getting back for a patrol, Jim's right hand man, &quot;Hap&quot; Smith (Paul Kelly), secretly takes his place, despite being grounded by Jim because his vision had deteriorated, particularly at night. In the resulting dogfight, Hap is unable to judge distances accurately and winds up dying in a collision with a Japanese aircraft he is pursuing. This proves to be the final straw. While sitting at his office desk, Jim fires Woody, explaining that &quot;It's out of my hands now. None of these men will ever fly with you again. And they 'have' to fly.&quot; The date is Sunday, December 7, 1941, the date of the Japanese air raid on Pearl Harbor, which brings the United States into World War II.\n\nA day later, Jim receives word that a vital bridge has to be destroyed. The target is so heavily defended, the only way that has a chance of working is to try to sneak in with a single cargo aircraft and bomb it, but it would likely be a one-way trip. Jim flies the plane, but Woody invites himself along, much to Jim's irritation. They bomb the bridge too late to stop a crucial supply train from crossing. The aircraft is hit and catches fire. Jim bails out, expecting Woody to follow. However, Woody has concealed the fact he has been hit by shrapnel from a flak burst. He crashes into the train, destroying it at the cost of his own life. Woody has written a goodbye letter which Jim and Brooke read; in the letter he has asked his scarf be given to the next pilot who thinks it will be &quot;an easy ride.&quot;\n\nPRODUTION NOTES:-\nActual Flying Tigers Lawrence Moore and Kenneth Sanger were technical advisers but they had been dishonorably discharged from the American Volunteer Group (AVG) in February 1942. None of the real Flying Tigers are mentioned by name in this film, which went into production when the original AVG was still in operation.\n\nActual combat footage was used in some of the scenes. Movie models were used to portray the Curtiss P-40 Warhawk aircraft the Tigers actually flew, although they were only mock-ups which did no more than taxi. The covers protruding over the cylinder heads of the V-8 automobile engines that propelled the mock-ups are noticeable, and the aircraft lack elevators on the rear horizontal stabilizers. John Wayne's character arrives at the base on the one-off Capelis XC-12, a failed design that found a new life as a non-flying movie prop. It also was used in Five Came Back and a number of other films.\n\nIn 1942, due to wartime priorities that prohibited the use of military aircraft for Hollywood productions, Republic Studios approached Curtiss-Wright in Buffalo to recreate the aerial battle sequences required for Flying Tigers. A number of P-40E fighter aircraft waiting for delivery to the U.S. Army Air Forces were repainted in AVG markings, and with the aid of Curtiss test pilots, flew in the film. Chief Production Test Pilot Herbert O. Fisher's screen role was in subbing for John Wayne.\n\nMost of the combat footage of the planes were in actuality miniatures on wires created by the special effect experts Howard and Theodore Lydecker. This included the American and Japanese planes - and also included the miniature train and bridge for the climax, and the miniature of the Capelis transport plane that is seen flying through canyons and crashes into the train. No real, flying planes were used for the combat scenes.\n\nThe effects were nominated for an Academy Award - but many people voting didn't realize the planes were miniatures on wires, and passed it by for an award.\n\nHISTORICAL ACCURACY\nThe film had little to do with the American Volunteer Group, the real &quot;Flying Tigers&quot;; unlike the movie characters, the AVG pilots were all recruited from active or reserve U.S. military forces, were in Asia with the knowledge and approval of the White House, and were in training, not yet in combat, before the Japanese attack on Pearl Harbor. The actual AVG didn't fly its first combat mission until December 20, 1941- nearly two weeks after the Pearl Harbor attack.\n\nJohn Wayne's character is nicknamed &quot;Pappy.&quot; This was real-life Marine fighter ace Gregory Boyington's moniker. Boyington (the inspiration for the TV series Baa Baa Black Sheep) did in fact fly with the Tigers until early 1942, at that point parting ways with the AVG and returning to the United States in order to be reinstated in the Marine Corps. However, Boyington was not the inspiration for Wayne's character. &quot;Pappy&quot; was a common nickname for an older man, particularly as a military commander, in those days. Besides this, Boyington was not widely known as &quot;Pappy&quot; until late 1943, when he commanded VMF-214 (the Black Sheep Squadron), well after this movie was released. The goggles that John Wayne wears in the promotional posters is actually a set of tanker goggles.\n\nWhen Jim Gordon fires Woody Jason, Gordon stresses to him that the other pilots &quot;have to fly.&quot; The date on the calendar is December 7, 1941. Though not spoken, the drama suggests Gordon means the men must fly to respond to the Japanese attack. But the time zone difference is not taken into consideration here. When Pearl Harbor is attacked at 7:55 AM Sunday Hawaiian time, it is 1:55 AM Monday December 8 in Kunming, China- 18 hours ahead of Hawaii.\n\nThe scene where Japanese soldiers firing anti-aircraft cannons in the last bridge bombing were actually taken from footages of Chinese soldiers. This can be seen from the M1935 Stahlhelm helmets that were only used by elements of the Chinese Army.\n\nFlying Tiger Bert Christman's fighter had come under fire and been hit in the engine on Friday, January 23, 1942. He was forced to bail out. As he hung in his parachute and descended to the ground, a Japanese pilot strafed him. Bert was hit in several places and probably died as a bullet passed through the back of his neck. The cruel manner of Christman's death led to a great deal of media coverage in 1942. The Associated Press did a feature piece with illustrations that ran in papers around the country, and Paramount pictures did a short newsreel documentary about his life. Later in the year Christman was featured in war bond advertisements that read, &quot;He gave his life, what will you give?&quot;.\n\nTECHNICAL SPECIFICATIONS:-\nVideo Bitrate: 1295 kbps\nVideo Resolution: 640x480\nVideo Aspect Ratio: 1.333:1\nFrames Per Second: 23.976\nAudio Codec: 0x2000 (Dolby AC3) AC3\nAudio Bitrate: 192kb/s CBR 48000 Hz\nAudio Streams: 2\nAudio Languages: English\nRunTime: 102 mins\nSubtitles: NONE\nRipped by: Trinidad [DDR]   \nDuration: 102 mins","torrent":{"xt":"urn:btih:ff3be85065e32741cc3d07401ece8587ba1d0702","amp;dn":"Flying+Tigers+%281942%29+Xvid+1cd+-+War+Drama+-+John+Wayne%2C+Mae+Clar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ff3be85065e32741cc3d07401ece8587ba1d0702","infoHashBuffer":{"type":"Buffer","data":[255,59,232,80,101,227,39,65,204,61,7,64,30,206,133,135,186,29,7,2]},"announce":[],"urlList":[]}}