{"title":"Metallica - Black Album 1991 (Custom Optimization/Remaster, 2007","uid":3785600,"size":603122601,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:ffc84c471bdbc39a3cda0be182a997d2f1843c6d&amp;dn=Metallica+-+Black+Album+1991+%28Custom+Optimization%2FRemaster%2C+2007&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Tech-Noir","files":28,"time":1188186114,"description":"Metallica - Metallica (Black Album) 1991 (Custom Optimization/Remaster, 2007) FLAC\n\n\n-----------------------------------------------------------------------\nTechnical Info\n-----------------------------------------------------------------------\n\n-Source material:\nFLAC Lossless\n\n\n-New Encoding:\n&quot;audiophile&quot; version: FLAC Lossless (In other words, full quality compressed to generally about 1/2 of an Audio CD size)\n&quot;airplay&quot; version: MP3 VBR (lame 3.97)\n\n\n-Total Size:\nAirplay Version: 119MB\nAudiophile Version : 455MB\n\n\n-Total Play Time:\n1:02:31\n\n\n-Tracklist:\n1. Metallica - Enter Sandman (5:31)\n2. Metallica - Sad But True (5:24)\n3. Metallica - Holier Than (3:47)\n4. Metallica - The Unforgiven (6:27)\n5. Metallica - Wherever I May Roam (6:44)\n6. Metallica - Don&amp;#039;t Tread On Me (4:00)\n7. Metallica - Through The Never (4:04)\n8. Metallica - Nothing Else Matters (6:28)\n9. Metallica - Of Wolf And Man (4:16)\n10. Metallica - The God That Failed (5:08)\n11. Metallica - My Friend Of Misery (6:49)\n12. Metallica - The Struggle Within (3:53)\n\n\n\n\n-----------------------------------------------------------------------\nGeneral Info\n-----------------------------------------------------------------------\n\n\nThis Metallica album sounds very good to begin with. Clean recording, very little to almost no audible noise. My main complaint is that it sounds a bit to bright. At louder volumes the snare drum attack really pierces your eardrums, and it can become straining to listen to at loud levels. On the other hand, there is alot of punch and brightness to work with here, which is very preferably compared to a completely compressed track.\n\nFor this optimization experiment, I decided to try 2 different approaches. One is a proper (&quot;audiophile&quot; for lack of a more descriptive word, though ti sounds a bit highflying) version which keeps the punchyness intact, and really shows off all the good sides of the tracks. It is open and basically only equalized and &quot;sweetened&quot; slightly to harness the sharp attacks. An analog-modelled compressor is gently applied since I feel the tracks were perhaps slightly too &quot;flat&quot; originally. The Gold Remasters of &quot;Master Of Puppets&quot; and &quot;Ride The Lightning&quot; were quite compressed aswell, but in a way that only helps the tracks sound even better.\n\nI couldn&amp;#039;t be bothered with adding a comparison to the original tracks. But if you have them in Mp3 or FLAC on your computer, comparing should reveal the differences quite quickly. Guitars have some nice beef in the lower midrange, the snare drum doesn&amp;#039;t have as harsh a sound, but still punches wildly. Vocals sound nice and natural.\n\n\n\n\nI also decided to try my hand at a differently optimized &quot;airplay&quot; version. You know, the kind of compressed-to-hell tracks that basically all recordings today are. In all honesty, in certain situations those versions can be preferable, like if you are riding in a car and don&amp;#039;t want the subtle nuances, just something that you can hear over the engine.\n\nAnd to be frank, I still think it sounds decent. Obviously the tracks are alot less nuanced and more &quot;in your face the whole time&quot;, since you need to limit the punches of drums etc to fit the track as snuggly and loudly as possible. But I have tried hard to make them not fatiguing to listen to. Some professionally mastered tracks can be downright painful to listen to, to the point where I need to take my headphones off just to stop this feeling of suction in my ears (generally  I feel this comes from the high-end of drums etc coming and going, basically being reduced in volume and presence to give room for other elements that forces their way in.\nI prefer the highend always as intact and non-compressed as possible, since that is the section of the audio that I feel is most important in terms of being a &quot;reference point&quot; for the brain that it can use to judge the amount of compression and such. Keeping it intact means that you can quite unnoticably compress the other frequency parts of the track, without the tracks becoming tiresome to listen to. (A good Metallica example is &quot;St. Anger&quot;, where the drums and vocals become VERY much brighter and more present in slow calm sections, but as soon as the treacks takes off full force, the cymbals start pumping and it&amp;#039;s like there is a low-pass filter just blanketing the whole track).\n\nAnyways, I was a bit surprised myself at how &quot;transparent&quot; this still sounds. No pumping that can quickly become tiresome to listen to, and that is considering I really pushed the levels on this one to really prove the point. It distorts audibly on some sections (&quot;In your closet, in your head&quot; part of &quot;Enter Sandman&quot; towards the end of the track being an example), but not in a fatiguing way, but a rather plesant and unintrusive way. Overall there is very little harshness to the tracks, no clipping noises, or other similar artifacts that can sometimes be heard on sustained sounds (like a guitar squeal) when pushing volumes with a maximizer. If there are stuff there, is was most likely part of the original I worked on.\n\nAlso limited to -0.2dB, so the audio never actually maxes out. This &quot;should&quot; (without being an expert) mean that there probably is very little chance that amps in digital devices (like iPods or CD players) start introducing clipping, since the audio never pushes against the maximum level. If I kept the limiting level at 0.0dB, even though the files when listening on a computer or such would sound clip-free, if you played it with older stuff, there is a chance that those devices would introduce clipping because of hardware limitations.\n\nRegardless of how accurate my technical knowledge of this aspect is, My point is that I have tried hard to avoid there being any harshness such as clipping and such introduced at any point. It sounds horrible in some cases (St. Anger?), even though you are listening to a FLAC-ripped album without replay gain or such things.\n\n\n\n\nI also kept the maximized version in MP3, since there isn&amp;#039;t much point in a FLAC of it, and it keeps the overall size down.\n\nSo if you want to listen on the pricey stereo setup, you have a FLAC version. But if you want a MP3 version that will be heard over ambient noise (or if you are allergic to transients), I give you that aswell.\n\n\nSo enjoy and do give me your comments and criticism. Anything is welcome. :)","torrent":{"xt":"urn:btih:ffc84c471bdbc39a3cda0be182a997d2f1843c6d","amp;dn":"Metallica+-+Black+Album+1991+%28Custom+Optimization%2FRemaster%2C+2007","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ffc84c471bdbc39a3cda0be182a997d2f1843c6d","infoHashBuffer":{"type":"Buffer","data":[255,200,76,71,27,219,195,154,60,218,11,225,130,169,151,210,241,132,60,109]},"announce":[],"urlList":[]}}